[
    {
        "id": 0,
        "Series_Title": "The Shawshank Redemption",
        "Released_Year": "1994",
        "Runtime": "142 min",
        "Genre": "Drama",
        "IMDB_Rating": "9.3",
        "Overview": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.",
        "Director": "Frank Darabont",
        "Star1": "Tim Robbins",
        "Star2": "Morgan Freeman",
        "Star3": "Bob Gunton",
        "Star4": "William Sadler",
        "Gross": "28,341,469",
        "Synopsis": "**The Shawshank Redemption** is a drama film that follows the story of Andy Dufresne, a banker who is sentenced to two consecutive life terms in prison for the murders of his wife and her lover, crimes he insists he did not commit. The story unfolds in Shawshank State Penitentiary over several decades, beginning in the late 1940s.\n\nOnce inside, Andy befriends Ellis \"Red\" Redding, the prison's fixer, who can smuggle in items from the outside world. Despite initial skepticism from other inmates, Andy earns their respect through his quiet resolve and intelligence. He soon becomes an asset to the corrupt warden, Samuel Norton, and the guards overseeing various illicit financial operations. Andy's financial expertise allows him to manage the warden's illegal endeavors, laundering money under a false identity.\n\nWhile facing brutal realities, including violent encounters with a gang called \"The Sisters,\" Andy maintains hope, finding solace in small acts of defiance. He revitalizes the prison library, helping fellow inmates pursue education. His friendship with Red deepens, standing as a pillar of trust and mutual reliance within the oppressive environment.\n\nEventually, Andy discovers evidence that could potentially exonerate him. He approaches the warden, hoping to earn a retrial. However, Warden Norton refuses, fearing exposure of their illegal schemes, and takes drastic measures to silence new witness testimony.\n\nDespite his apparent despair, Andy secretly plans an elaborate escape. One night, he disappears from his cell, having meticulously tunneled through the walls. The next morning, his absence is discovered, and it is revealed that he has escaped through the prison sewage system.\n\nOn the outside, Andy lives under a new identity, having withdrawn the laundered money. He sends evidence of the prison's corruption to the authorities, leading to the downfall of the warden and guards involved.\n\nThe film concludes with Red finally receiving parole after serving 40 years. Following a path left by Andy, he discovers a letter inviting him to join his friend in Zihuatanejo, Mexico. The final scenes capture Red's hope-filled journey and his reunion with Andy on the Pacific coast.\n\nThe film explores themes of friendship, hope, and the enduring human spirit against the backdrop of institutional injustice and despair."
    },
    {
        "id": 1,
        "Series_Title": "The Godfather",
        "Released_Year": "1972",
        "Runtime": "175 min",
        "Genre": "Crime, Drama",
        "IMDB_Rating": "9.2",
        "Overview": "An organized crime dynasty's aging patriarch transfers control of his clandestine empire to his reluctant son.",
        "Director": "Francis Ford Coppola",
        "Star1": "Marlon Brando",
        "Star2": "Al Pacino",
        "Star3": "James Caan",
        "Star4": "Diane Keaton",
        "Gross": "134,966,411",
        "Synopsis": "\"The Godfather,\" directed by Francis Ford Coppola, is a 1972 American crime film based on the novel by Mario Puzo. The story follows the powerful Italian-American crime family of Don Vito Corleone, played by Marlon Brando, in 1940s New York. The narrative unfolds during a pivotal period for the Corleones, marked by violence, loyalty, and betrayal.\n\nThe film opens with Don Corleone presiding over his daughter's wedding, a traditional and celebratory event that also serves as a forum for business. Various characters seek the Don's favor, highlighting his influence and authority. Vito is a mafia patriarch embodying old-world principles, prioritizing family and honor.\n\nThe plot thickens when a rival, Virgil Sollozzo, seeks the Corleones' involvement in an emerging narcotics trade. Vito, cautious of the legal implications, declines. This decision incites a chain of events leading to an assassination attempt on Vito. As he recuperates, his sons, Sonny (James Caan) and Michael (Al Pacino), navigate the ensuing turmoil.\n\nMichael, initially an outsider in family affairs, becomes deeply involved after his father's shooting. In a pivotal moment at a restaurant, Michael murders Sollozzo and a corrupt police officer, cementing his commitment to the family business.\n\nAs the power struggles escalate, Sonny is violently killed, intensifying the family's resolve. With Vito's health failing, Michael assumes leadership, transforming from reluctant son to ruthless godfather. He orchestrates a calculated and deadly massacre of the family's enemies, consolidating power and securing the family's future.\n\nBy the film's end, Michael has fully embraced his role as the head of the Corleone dynasty, maintaining the family's legacy with calculated power and authority. The film concludes with Michael's transformation complete, illustrating the complex intertwining of loyalty and violence in the world of organized crime."
    },
    {
        "id": 2,
        "Series_Title": "The Dark Knight",
        "Released_Year": "2008",
        "Runtime": "152 min",
        "Genre": "Action, Crime, Drama",
        "IMDB_Rating": "9",
        "Overview": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
        "Director": "Christopher Nolan",
        "Star1": "Christian Bale",
        "Star2": "Heath Ledger",
        "Star3": "Aaron Eckhart",
        "Star4": "Michael Caine",
        "Gross": "534,858,444",
        "Synopsis": "**The Dark Knight** is a 2008 superhero film directed by Christopher Nolan, featuring Bruce Wayne (Batman), portrayed by Christian Bale. The movie is a sequel to \"Batman Begins\" and is set in Gotham City, where organized crime is on the rise. With the help of allies such as Lieutenant Jim Gordon (Gary Oldman) and newly elected District Attorney Harvey Dent (Aaron Eckhart), Batman strives to dismantle the criminal underworld that plagues Gotham.\n\nThe fragile peace brought by their partnership is shattered by the appearance of a mysterious and sadistic criminal mastermind known only as the Joker (Heath Ledger). A chaotic force of nature, the Joker seeks to terrorize Gotham City and bring its people to their knees. He begins a series of heists and attacks, targeting Gotham’s political and financial institutions, while aiming to bring down Harvey Dent and expose his vulnerabilities.\n\nAs Batman battles against the Joker's destructive plans, he faces moral dilemmas about the fine line between heroism and vigilantism. The Joker’s twisted logic challenges Batman by exploiting Gotham’s citizens and forcing him into impossible choices, testing Batman’s resolve and the city's faith in their heroes.\n\nThe Joker ultimately corrupts Harvey Dent, turning him into \"Two-Face,\" who blames Gordon and Batman for his devastating personal losses. This transformation marks the fall of Gotham's \"White Knight,\" complicating Batman's mission even further.\n\nIn a climactic finale, Batman must confront his own ideals and the city's future. He takes the blame for Harvey Dent’s crimes to preserve Dent’s image as a beacon of hope for Gotham. His sacrifice ensures that Harvey remains a symbol of justice, even as Batman becomes a hunted fugitive.\n\nThe film ends with Batman fleeing into the darkness, steadfast in his mission to protect Gotham, leaving audiences pondering the complex nature of justice, sacrifice, and heroism."
    },
    {
        "id": 3,
        "Series_Title": "The Godfather: Part II",
        "Released_Year": "1974",
        "Runtime": "202 min",
        "Genre": "Crime, Drama",
        "IMDB_Rating": "9",
        "Overview": "The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate.",
        "Director": "Francis Ford Coppola",
        "Star1": "Al Pacino",
        "Star2": "Robert De Niro",
        "Star3": "Robert Duvall",
        "Star4": "Diane Keaton",
        "Gross": "57,300,000",
        "Synopsis": "\"The Godfather: Part II\" is a cinematic masterpiece that serves as both a sequel and prequel to the original \"The Godfather,\" exploring the dual narratives of young Vito Corleone's rise to power and his son Michael's consolidation of the family's criminal empire.\n\nThe film opens with Michael Corleone, now the head of the Corleone crime family, navigating the complicated world of organized crime in the late 1950s. Michael is expanding the family's operations into Las Vegas and Cuba, facing betrayal, and dealing with the Senate hearings on organized crime. His personal life is also in turmoil, with his relationship with his wife, Kay, becoming increasingly strained.\n\nParallelly, the film flashes back to the early 1900s, depicting young Vito Corleone's journey from Sicily to New York after his own family is murdered by a local Mafia boss. Settling in the Italian-American community, Vito begins his ascent to power by taking on the local crime boss, eventually establishing the Corleone family's criminal empire.\n\nAs Michael's story unfolds, he struggles with internal betrayal and familial discord, moving ruthlessly against enemies, including his own brother Fredo, to protect his position and the legacy handed down to him. The saga intricately contrasts Michael's moral descent with Vito's rise, highlighting themes of family, power, and corruption.\n\nThe film culminates with Michael isolated from his family, having chosen ruthless power over personal connections, symbolizing the heavy cost of his ambition and the cyclical nature of crime and violence."
    },
    {
        "id": 4,
        "Series_Title": "12 Angry Men",
        "Released_Year": "1957",
        "Runtime": "96 min",
        "Genre": "Crime, Drama",
        "IMDB_Rating": "9",
        "Overview": "A jury holdout attempts to prevent a miscarriage of justice by forcing his colleagues to reconsider the evidence.",
        "Director": "Sidney Lumet",
        "Star1": "Henry Fonda",
        "Star2": "Lee J. Cobb",
        "Star3": "Martin Balsam",
        "Star4": "John Fiedler",
        "Gross": "4,360,000",
        "Synopsis": "**12 Angry Men** - Synopsis:\n\nIn a sweltering New York City courthouse, a diverse group of twelve jurors convenes in a cramped deliberation room to decide the fate of a young defendant accused of murdering his father. The evidence appears overwhelming, and it seems to be an open-and-shut case, prompting a preliminary vote. Eleven jurors are convinced of the boy's guilt, but Juror #8, played by Henry Fonda, casts a solitary not-guilty vote, urging his peers to discuss the evidence before condemning the boy to the electric chair.\n\nJuror #8 meticulously questions the reliability of the witnesses and the supposed murder weapon, revealing prejudices and personal biases among the jurors. Tensions rise as the jurors' backgrounds and beliefs clash, exposing themes of justice, morality, and the value of reasonable doubt. \n\nOver a series of heated exchanges and re-examinations of testimonies, Juror #8's calm demeanor and logical reasoning gradually sway a few jurors to reconsider their initial positions. Members question the credibility of an elderly witness, the timing of the events, and the accuracy of a key piece of forensic evidence—the alleged murder weapon, a knife.\n\nPersonal conflicts arise, and intense arguments erupt, particularly with Juror #3, who harbors deep-seated anger and a personal vendetta that clouds his judgment. As the deliberation continues, each juror confronts their own biases and learns the importance of a fair trial.\n\nSlowly, one by one, the jurors change their votes, and the intense atmosphere gives way to a collective agreement on the boy's innocence, exonerating him of the charges. The film concludes with the jurors leaving the courthouse, reflecting on the weight of their decision and their understanding of justice and humanity."
    },
    {
        "id": 5,
        "Series_Title": "The Lord of the Rings: The Return of the King",
        "Released_Year": "2003",
        "Runtime": "201 min",
        "Genre": "Action, Adventure, Drama",
        "IMDB_Rating": "8.9",
        "Overview": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
        "Director": "Peter Jackson",
        "Star1": "Elijah Wood",
        "Star2": "Viggo Mortensen",
        "Star3": "Ian McKellen",
        "Star4": "Orlando Bloom",
        "Gross": "377,845,905",
        "Synopsis": "In \"The Lord of the Rings: The Return of the King,\" the epic conclusion to J.R.R. Tolkien's saga, Middle-earth teeters on the brink of destruction. Frodo Baggins, accompanied by Samwise Gamgee and the treacherous Gollum, continues the perilous journey to destroy the One Ring in the fires of Mount Doom.\n\nAs Sauron's forces prepare to unleash their might on Gondor, the city of Minas Tirith is besieged. Aragorn, revealed as the heir to Gondor's throne, must unite the broken factions of men and rally them for an epic confrontation. He journeys to the Paths of the Dead to enlist the aid of a cursed army, promising them release from their curse if they fight for him.\n\nMeanwhile, in Rohan, Éowyn and Merry covertly join the Riders as they ride to support Gondor. Pippin, who has joined Gandalf in Minas Tirith, pledges his service to the Steward, Denethor, who has descended into madness amidst the chaos.\n\nAs the Battle of Pelennor Fields rages, Éowyn, with Merry's help, defeats the Witch-king of Angmar. Denethor, in his despair, attempts to kill himself and his injured son Faramir, but is thwarted by Gandalf and Pippin.\n\nSimultaneously, Frodo and Sam navigate the treacherous landscapes of Mordor, overcoming hunger, exhaustion, and Gollum's deceit. In a final confrontation at Mount Doom, Gollum attacks Frodo, biting off his finger and falling into the volcanic fire with the Ring, obliterating Sauron's power forever.\n\nWith Sauron's fall, Aragorn is crowned King of Gondor and marries Arwen. Peace returns to Middle-earth. The Hobbits return to the Shire, forever changed by their experiences. In the end, Frodo, alongside Gandalf, Bilbo, and the Elves, departs for the Undying Lands, leaving Sam, now married and content, to continue life in the Shire, cherishing the memory of their extraordinary journey."
    },
    {
        "id": 6,
        "Series_Title": "Pulp Fiction",
        "Released_Year": "1994",
        "Runtime": "154 min",
        "Genre": "Crime, Drama",
        "IMDB_Rating": "8.9",
        "Overview": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
        "Director": "Quentin Tarantino",
        "Star1": "John Travolta",
        "Star2": "Uma Thurman",
        "Star3": "Samuel L. Jackson",
        "Star4": "Bruce Willis",
        "Gross": "107,928,762",
        "Synopsis": "**Pulp Fiction** is a 1994 film directed by Quentin Tarantino, renowned for its eclectic dialogue, nonlinear narrative, and complex characters. The story weaves together several interrelated tales of crime and redemption in Los Angeles.\n\nThe film opens with a seemingly unrelated prologue featuring a couple, “Pumpkin” and “Honey Bunny,” who decide to rob a diner. Their storyline bookends the film.\n\nThe primary narrative follows several intersecting arcs:\n\n1. **Vincent Vega and Marsellus Wallace's Wife**: Vincent Vega and his partner, Jules Winnfield, are hitmen working for crime boss Marsellus Wallace. Vincent is tasked with taking Wallace’s wife, Mia, out for an evening while her husband is away. Their night takes a turn when Mia overdoses, prompting Vincent to rush her to a drug dealer’s house for an adrenaline shot that saves her life.\n\n2. **The Gold Watch**: The second arc follows boxer Butch Coolidge, who is paid by Marsellus to throw a fight. Instead, Butch double-crosses Marsellus, winning the match and planning to escape with his girlfriend. Events spiral out of control when Butch returns to retrieve a family heirloom—a gold watch and ends up in a run-in with Marsellus. Their ensuing altercation leads both men into a pawnshop basement where they are captured by sadistic captors. They manage to escape, forming an uneasy truce.\n\n3. **The Bonnie Situation**: After Vincent and Jules retrieve a briefcase for Marsellus, Vincent accidentally kills their informant, Marvin, leading to a tense cleanup operation at the house of Jules's friend, Jimmie. A fixer named Winston Wolfe is called to help them quickly and discreetly clean up the mess. The story elucidates Jules’s revelation and a newfound desire to leave his life of crime.\n\nThroughout the film, the mysterious briefcase serves as a MacGuffin, never revealing its contents but driving the characters' actions. The nonlinear narrative highlights themes of fate, redemption, and chance, ultimately culminating at the diner where the film began. There, Jules’s newfound perspective on life and crime influences the outcome of the robbery attempt by \"Pumpkin\" and \"Honey Bunny.\"\n\n\"Pulp Fiction\" is celebrated for its vibrant dialogue, unique structure, and the interplay of humor and violence in depicting the chaotic world of its characters."
    },
    {
        "id": 7,
        "Series_Title": "Schindler's List",
        "Released_Year": "1993",
        "Runtime": "195 min",
        "Genre": "Biography, Drama, History",
        "IMDB_Rating": "8.9",
        "Overview": "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
        "Director": "Steven Spielberg",
        "Star1": "Liam Neeson",
        "Star2": "Ralph Fiennes",
        "Star3": "Ben Kingsley",
        "Star4": "Caroline Goodall",
        "Gross": "96,898,818",
        "Synopsis": "\"Schindler's List\" is a historical drama directed by Steven Spielberg, based on the novel \"Schindler's Ark\" by Thomas Keneally. The film follows the true story of Oskar Schindler, a German businessman who becomes an unlikely hero during World War II.\n\nAt the start of the war, Schindler is a member of the Nazi Party seeking to profit from the conflict. He sets up a factory in Krakow, Poland, employing Jewish workers because they are cheaper labor. At the same time, the Jewish residents of Krakow are being forced into the overcrowded ghetto, and later, the Płaszów concentration camp.\n\nSchindler befriends Itzhak Stern, a Jewish accountant, who helps run his business and manages the workers. As the war progresses, Schindler witnesses the brutal and inhumane treatment of Jews, particularly at the hands of Amon Goeth, the ruthless commander of the Płaszów camp.\n\nGradually, Schindler becomes more haunted by the atrocities he sees, transforming from a profit-driven businessman to a compassionate humanitarian. He uses his connections and wealth to bribe Nazi officials, saving as many Jews as possible by having them classified as essential workers for his munitions factory.\n\nSchindler is eventually able to relocate his workers to a safe factory in Czechoslovakia, away from the death camps. This list of names, known as \"Schindler’s List,\" represents the lives he saved—over 1,100 Jews.\n\nThe film concludes with a powerful coda showing the surviving Schindlerjuden visiting Schindler's grave to pay their respects, highlighting the enduring impact of his compassion and bravery.\n\nThroughout the film, themes of moral ambiguity, the horrors of the Holocaust, and the capacity for good in the face of evil are explored, with powerful performances and a moving narrative that highlight the enduring human spirit."
    },
    {
        "id": 8,
        "Series_Title": "Inception",
        "Released_Year": "2010",
        "Runtime": "148 min",
        "Genre": "Action, Adventure, Sci-Fi",
        "IMDB_Rating": "8.8",
        "Overview": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O.",
        "Director": "Christopher Nolan",
        "Star1": "Leonardo DiCaprio",
        "Star2": "Joseph Gordon-Levitt",
        "Star3": "Elliot Page",
        "Star4": "Ken Watanabe",
        "Gross": "292,576,195",
        "Synopsis": "**Inception** is a sci-fi thriller directed by Christopher Nolan that explores the complex world of dreams and reality. The film follows Dom Cobb, a skilled thief who specializes in the art of extraction—stealing valuable secrets from deep within the subconscious during the dream state. Cobb is offered a chance to have his criminal history erased as payment for a task considered to be impossible: inception. Instead of stealing an idea, Cobb must implant one.\n\nCobb assembles a team consisting of Arthur, his detail-oriented partner; Ariadne, a talented architecture student to design the dream worlds; Eames, a forger capable of manipulating his appearance; and Yusuf, a chemist whose special sedative allows them to share dreams. Their target is Robert Fischer, heir to a massive corporate empire. The goal is to plant the idea in Fischer’s mind to dissolve his father’s company.\n\nAs they delve deeper into multiple layers of dreams, Cobb’s personal demons, particularly the manifestations of his deceased wife, Mal, whom he feels responsible for, threaten the mission. The notion of time is stretched across layers, and the deeper they go, the more unstable the dream world becomes.\n\nIn a culmination of intricate dream sequences and escalating tension, the team navigates challenges from Fischer’s subconscious defenses and Cobb’s own unresolved guilt about Mal. Ultimately, Ariadne helps Cobb face his inner turmoil, resolving his guilt and allowing him to separate his dream world from reality.\n\nThe film ends on an ambiguous note with Cobb finally returning home to his children, but with the question lingering—is he still in a dream? The totem, a spinning top, wobbles slightly but the scene cuts to black before its fate is revealed, leaving the audience questioning the nature of the reality Cobb has returned to."
    },
    {
        "id": 9,
        "Series_Title": "Fight Club",
        "Released_Year": "1999",
        "Runtime": "139 min",
        "Genre": "Drama",
        "IMDB_Rating": "8.8",
        "Overview": "An insomniac office worker and a devil-may-care soapmaker form an underground fight club that evolves into something much, much more.",
        "Director": "David Fincher",
        "Star1": "Brad Pitt",
        "Star2": "Edward Norton",
        "Star3": "Meat Loaf",
        "Star4": "Zach Grenier",
        "Gross": "37,030,102",
        "Synopsis": "The story follows an unnamed narrator who is disillusioned with his white-collar job and materialistic lifestyle. Suffering from chronic insomnia, he finds temporary solace by attending support groups for ailments he doesn't have. During these meetings, he encounters Marla Singer, a fellow \"tourist\" attending the groups, further complicating his efforts to find peace.\n\nOn a business trip, the narrator meets Tyler Durden, a charismatic and anarchistic soap salesman. After his apartment is mysteriously destroyed, the narrator moves in with Tyler in a dilapidated house in an industrial area. Over drinks, Tyler proposes that they hit each other, leading to the creation of a secret club where men gather to fight as a form of release from the confines of society: Fight Club.\n\nAs Fight Club grows, it evolves into \"Project Mayhem,\" a radical anti-consumerist organization led by Tyler, who is increasingly seen as a messianic figure. The narrator becomes alarmed by Tyler's growing influence and the group's escalating activities, leading him to question Tyler's motives and methods.\n\nIn a shocking twist, the narrator discovers that Tyler is a manifestation of his own split personality, representing his repressed desires for freedom and chaos. Realizing Tyler's plans to destroy consumerist symbols, the narrator attempts to stop him. This culminates in a final confrontation where the narrator confronts his alter ego in an attempt to reclaim control over his life.\n\nThe film ends with the narrator reconciled with Marla, as they watch the city skyline dramatically change—an embodiment of Tyler's nihilistic vision—as skyscrapers collapse around them."
    },
    {
        "id": 10,
        "Series_Title": "The Lord of the Rings: The Fellowship of the Ring",
        "Released_Year": "2001",
        "Runtime": "178 min",
        "Genre": "Action, Adventure, Drama",
        "IMDB_Rating": "8.8",
        "Overview": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
        "Director": "Peter Jackson",
        "Star1": "Elijah Wood",
        "Star2": "Ian McKellen",
        "Star3": "Orlando Bloom",
        "Star4": "Sean Bean",
        "Gross": "315,544,750",
        "Synopsis": "In \"The Lord of the Rings: The Fellowship of the Ring,\" the epic journey begins in the tranquil land of the Shire, home to the hobbits. Bilbo Baggins, a hobbit, celebrates his eleventy-first birthday and mysteriously disappears, leaving his magical ring to his nephew, Frodo Baggins. This seemingly innocuous ring is revealed by the wise wizard Gandalf to be the One Ring, ancient and powerful, forged by the Dark Lord Sauron to conquer Middle-earth.\n\nUnderstanding the peril the ring represents, Gandalf advises Frodo to leave the Shire, guiding him to the safety of Rivendell. Accompanied by his loyal friends Sam, Merry, and Pippin, Frodo embarks on his hazardous journey, pursued by Sauron's dark riders, the Nazgûl.\n\nIn Rivendell, a council is called, where representatives from the different races of Middle-earth—men, elves, dwarves, and hobbits—debate the fate of the ring. It is decided that the only way to thwart Sauron is to destroy the ring by casting it into the fires of Mount Doom in Mordor.\n\nFrodo volunteers to bear the ring, and a fellowship is formed to aid him: Aragorn, a skilled ranger and the heir to Gondor's throne; Legolas, an elven archer; Gimli, a doughty dwarf; Boromir, a valiant man of Gondor; and Gandalf himself. Together with Frodo's hobbit friends, they are known as the Fellowship of the Ring.\n\nThe group faces numerous trials on their path to Mordor. They navigate treacherous terrain, including the Mines of Moria, where they battle orcs and the fearsome Balrog, which claims Gandalf as they escape. In the elven realm of Lothlórien, Galadriel offers them sanctuary and gifts to aid their quest.\n\nTroubles arise as Boromir, overcome by the lure of the ring's power, attempts to seize it from Frodo. Realizing the danger he brings to his companions, Frodo decides to continue the journey to Mordor alone, but Sam insists on accompanying him.\n\nThe Fellowship is broken, and the film concludes with Frodo and Sam venturing into the perilous lands of Mordor, while Aragorn, Legolas, and Gimli set off to rescue Merry and Pippin, who have been captured by orcs. This marks the beginning of an epic struggle against the dark forces of Sauron in the quest to save Middle-earth."
    },
    {
        "id": 11,
        "Series_Title": "Forrest Gump",
        "Released_Year": "1994",
        "Runtime": "142 min",
        "Genre": "Drama, Romance",
        "IMDB_Rating": "8.8",
        "Overview": "The presidencies of Kennedy and Johnson, the events of Vietnam, Watergate and other historical events unfold through the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.",
        "Director": "Robert Zemeckis",
        "Star1": "Tom Hanks",
        "Star2": "Robin Wright",
        "Star3": "Gary Sinise",
        "Star4": "Sally Field",
        "Gross": "330,252,182",
        "Synopsis": "**Forrest Gump** follows the life of a simple, kind-hearted man from Alabama, Forrest Gump, who despite having a low IQ, leads an extraordinary life. The story begins with Forrest sitting on a bench, telling his life story to strangers who come and go. \n\nForrest recalls his childhood in the 1950s, growing up with his best friend Jenny Curran. Despite being bullied for his leg braces and perceived slowness, Forrest discovers he can run incredibly fast, which earns him a scholarship to play college football at the University of Alabama.\n\nAfter college, Forrest enlists in the U.S. Army, where he befriends Bubba, a fellow soldier. They dream of starting a shrimping business together after the war. During the Vietnam War, Forrest saves many of his fellow soldiers, including his lieutenant, Dan Taylor, though tragically, Bubba is killed. Forrest is awarded the Medal of Honor for his bravery.\n\nRecovering from injuries, Forrest showcases his talent for ping-pong, eventually representing the U.S. in matches against China, becoming a national celebrity. Upon returning home, he endorses a brand of ping-pong paddles, earning a small fortune.\n\nForrest fulfills his promise to Bubba by buying a shrimping boat. Lieutenant Dan, initially skeptical, joins him, and after struggling initially, they strike it rich after a hurricane wipes out the competition. Forrest and Dan become wealthy, and Forrest uses his share to help Bubba's family.\n\nThroughout his life, Forrest remains deeply in love with Jenny, who drifts in and out of his life. After she leaves him again, Forrest runs across the country for several years, gaining followers and unintentionally inspiring cultural phenomena.\n\nEventually, Forrest and Jenny reunite, and Jenny introduces him to his son, Forrest Jr. They marry, but Jenny soon dies of an illness. Forrest remains devoted to raising their son.\n\nThe film concludes with Forrest sending his son on the bus to school, echoing his own childhood, as he sits on the same bench, having found peace with his extraordinary journey through life."
    },
    {
        "id": 12,
        "Series_Title": "The good, the Bad and the Ugly",
        "Released_Year": "1966",
        "Runtime": "161 min",
        "Genre": "Western",
        "IMDB_Rating": "8.8",
        "Overview": "A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.",
        "Director": "Sergio Leone",
        "Star1": "Clint Eastwood",
        "Star2": "Eli Wallach",
        "Star3": "Lee Van Cleef",
        "Star4": "Aldo Giuffrè",
        "Gross": "6,100,000",
        "Synopsis": "\"The Good, the Bad and the Ugly\" is a classic 1966 Spaghetti Western directed by Sergio Leone.\n\nSet during the American Civil War, the film follows the intersecting paths of three gunslingers. Blondie (The Good), played by Clint Eastwood, is a calm and skilled bounty hunter. Angel Eyes (The Bad), portrayed by Lee Van Cleef, is a ruthless and cunning mercenary. Tuco (The Ugly), portrayed by Eli Wallach, is a comical and unpredictable bandit. \n\nThe plot centers on the hunt for a cache of Confederate gold buried in a cemetery. Blondie and Tuco form an uneasy partnership; Blondie knows the name of the grave where the gold is hidden, while Tuco knows the cemetery's name. However, Angel Eyes is also on their trail, willing to double-cross anyone to get the treasure.\n\nThe trio's journey takes them across various landscapes, marked by betrayals and shifting alliances. As they navigate battles and personal confrontations, their relentless pursuit leads them to a legendary three-way standoff in the cemetery. Each man must weigh his greed against survival as they draw their guns, aiming for the treasure and a final resolution.\n\nThe film is renowned for its iconic Ennio Morricone score, epic storytelling, and masterful direction that weave tension and introspection into the Western genre."
    },
    {
        "id": 13,
        "Series_Title": "The Lord of the Rings: The Two Towers",
        "Released_Year": "2002",
        "Runtime": "179 min",
        "Genre": "Action, Adventure, Drama",
        "IMDB_Rating": "8.7",
        "Overview": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.",
        "Director": "Peter Jackson",
        "Star1": "Elijah Wood",
        "Star2": "Ian McKellen",
        "Star3": "Viggo Mortensen",
        "Star4": "Orlando Bloom",
        "Gross": "342,551,365",
        "Synopsis": "Following the breaking of the Fellowship, \"The Two Towers\" picks up with the members scattered yet determined to fulfill their respective missions. \n\nFrodo Baggins and Samwise Gamgee continue their perilous journey to Mordor to destroy the One Ring, guided by the mysterious Gollum, who has his own secretive intentions. As they make their way through the treacherous landscapes, the bond between Frodo and Sam is tested, with the corrupting influence of the Ring growing stronger.\n\nMeanwhile, Aragorn, Legolas, and Gimli pursue captured hobbits Merry and Pippin, who have been taken by the Uruk-hai toward Isengard. Their pursuit leads them to the kingdom of Rohan, where they encounter the embattled King Théoden, manipulated by the treacherous Gríma Wormtongue under the influence of Saruman. With Rohan threatened by Saruman's forces, Aragorn and his companions must rally the kingdom to resist the coming darkness.\n\nMerry and Pippin manage to escape into Fangorn Forest, where they meet Treebeard, an ancient Ent. Discovering Saruman's destructive impact on the forest, the Ents gather for an assault on Isengard to protect their land.\n\nSimultaneously, Saruman's massive army marches toward Rohan, prompting a desperate defense at Helm's Deep. As the armies clash, Aragorn's leadership and the resolve of Rohan's people face a critical test. Despite overwhelming odds, alliances are forged, and hope emerges with unexpected reinforcements.\n\nThroughout these converging storylines, the film explores themes of courage, friendship, and the struggle against overwhelming evil. In a world gripped by war and uncertainty, the battered forces of good find strength in unity and resilience as they prepare for the greater battles that lie ahead.\n\n\"The Two Towers\" blends thrilling action with deep character development, setting the stage for the epic conclusions in the final installment of the trilogy."
    },
    {
        "id": 14,
        "Series_Title": "The Matrix",
        "Released_Year": "1999",
        "Runtime": "136 min",
        "Genre": "Action, Sci-Fi",
        "IMDB_Rating": "8.7",
        "Overview": "When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.",
        "Director": "Lana Wachowski",
        "Star1": "Lilly Wachowski",
        "Star2": "Keanu Reeves",
        "Star3": "Laurence Fishburne",
        "Star4": "Carrie-Anne Moss",
        "Gross": "171,479,930",
        "Synopsis": "In the dystopian future of \"The Matrix,\" computer hacker Thomas Anderson, known by his alias Neo, is plagued by strange, recurring dreams and cryptic online messages. Searching for truth, he encounters Morpheus, a legendary hacker who reveals a shocking reality: the world as Neo knows it is an elaborate virtual simulation called the Matrix, created by sentient machines to enslave humanity while harvesting their bodies for energy.\n\nMorpheus believes Neo is \"The One,\" prophesied to end the war between humans and machines. Neo joins Morpheus and his crew, including the skilled Trinity and the rebellious Cypher, as they fight to free humanity. Their adversaries include powerful agents led by the relentless Agent Smith, who seek to maintain control over the Matrix.\n\nMorpheus is captured by agents in the real world. Neo and Trinity mount a daring rescue, showcasing Neo’s growing mastery over the Matrix's rules. In a climactic showdown, Neo battles Agent Smith, ultimately realizing his potential as \"The One.\" He manipulates the Matrix to defeat Smith, reclaiming control and setting the stage for humanity’s potential liberation.\n\nThrough faith, choice, and the blurring lines between reality and perception, Neo embraces his destiny, challenging the boundaries of a controlled existence. The film concludes with Neo determined to show humanity the truth about their world."
    },
    {
        "id": 15,
        "Series_Title": "Goodfellas",
        "Released_Year": "1990",
        "Runtime": "146 min",
        "Genre": "Biography, Crime, Drama",
        "IMDB_Rating": "8.7",
        "Overview": "The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the Italian-American crime syndicate.",
        "Director": "Martin Scorsese",
        "Star1": "Robert De Niro",
        "Star2": "Ray Liotta",
        "Star3": "Joe Pesci",
        "Star4": "Lorraine Bracco",
        "Gross": "46,836,394",
        "Synopsis": "**Goodfellas** is a crime drama film directed by Martin Scorsese, chronicling the rise and fall of mob associate Henry Hill and his associates over a 25-year period.\n\nYoung Henry Hill grows up idolizing the mob lifestyle, eventually becoming involved with the local Mafia in Brooklyn. He becomes close to mobsters Jimmy Conway and Tommy DeVito. As Henry becomes more entrenched in the criminal world, he participates in various illegal activities, including robbery and hijacking. \n\nThe film traces their illicit businesses, marked by major heists, drug trafficking, and violent tendencies. Tensions rise as Tommy's unpredictable behavior attracts unwanted attention, leading to his murder. Meanwhile, Henry's life spirals out of control due to his increasing drug addiction.\n\nAfter a major arrest, Henry, fearing for his life and facing a long prison sentence, enters the Witness Protection Program, testifying against his former friends and associates. The film ends with an exploration of Henry's reflections on his decisions and the collapse of his once-glamorous world.\n\nThe narrative captures the allure and dangers of the mob lifestyle, emphasizing themes of loyalty, betrayal, and the relentless pursuit of power."
    },
    {
        "id": 16,
        "Series_Title": "Star Wars: Episode V - The Empire Strikes Back",
        "Released_Year": "1980",
        "Runtime": "124 min",
        "Genre": "Action, Adventure, Fantasy",
        "IMDB_Rating": "8.7",
        "Overview": "After the Rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training with Yoda, while his friends are pursued by Darth Vader and a bounty hunter named Boba Fett all over the galaxy.",
        "Director": "Irvin Kershner",
        "Star1": "Mark Hamill",
        "Star2": "Harrison Ford",
        "Star3": "Carrie Fisher",
        "Star4": "Billy Dee Williams",
        "Gross": "290,475,067",
        "Synopsis": "**Star Wars: Episode V - The Empire Strikes Back** takes place three years after the destruction of the Death Star. The Galactic Empire, under the leadership of Darth Vader, has regained control and driven the Rebel Alliance to flee to the icy planet of Hoth.\n\nThe film opens with the Empire discovering the Rebel base on Hoth and launching a surprise assault. In the ensuing battle, the Rebels suffer significant losses but manage to evacuate. Luke Skywalker, following a vision from his late mentor Obi-Wan Kenobi, heads to the planet Dagobah to train under the Jedi Master Yoda.\n\nMeanwhile, Han Solo, Princess Leia, Chewbacca, and C-3PO flee in the Millennium Falcon. They evade Imperial pursuit and seek refuge with Han's old friend Lando Calrissian in Cloud City on the planet Bespin. Unbeknownst to them, Lando has been coerced into betraying them to the Empire as he faces his own dilemmas under Vader’s pressure.\n\nIn Dagobah, Luke undergoes rigorous and challenging Jedi training with Yoda. He learns about the Force and faces his own fears and insecurities. Despite being warned by Yoda and the spirit of Obi-Wan not to take action prematurely, Luke senses his friends are in peril and decides to leave his training to rescue them.\n\nOn Bespin, Han is captured and frozen in carbonite to be delivered to bounty hunter Boba Fett. Leia, Chewbacca, and C-3PO are taken as prisoners. Lando, experiencing a change of heart and guilt for his betrayal, helps them attempt to escape.\n\nLuke arrives in Cloud City and confronts Darth Vader, culminating in a fierce lightsaber duel. Vader reveals a shocking truth to Luke: he is Luke’s father. Stunned and devastated, Luke refuses to join Vader and manages to escape with the help of Leia, Lando, and the rest of the group.\n\nThe film concludes with the Rebels in disarray but determined. Luke receives a prosthetic hand, and Lando and Chewbacca set off to rescue Han. As the Rebel fleet regroups, the looming threat of the Empire remains, casting a shadow over their hopes for freedom."
    },
    {
        "id": 17,
        "Series_Title": "One Flew Over the Cuckoo's Nest",
        "Released_Year": "1975",
        "Runtime": "133 min",
        "Genre": "Drama",
        "IMDB_Rating": "8.7",
        "Overview": "A criminal pleads insanity and is admitted to a mental institution, where he rebels against the oppressive nurse and rallies up the scared patients.",
        "Director": "Milos Forman",
        "Star1": "Jack Nicholson",
        "Star2": "Louise Fletcher",
        "Star3": "Michael Berryman",
        "Star4": "Peter Brocco",
        "Gross": "112,000,000",
        "Synopsis": "**One Flew Over the Cuckoo's Nest** follows Randle McMurphy, a rebellious and spirited man who fakes insanity to serve out his prison sentence in a mental institution rather than a work farm. Expecting a more relaxed environment, McMurphy is instead faced with a rigid and authoritarian system overseen by the tyrannical Nurse Ratched.\n\nMcMurphy quickly becomes a leader among the patients, encouraging them to challenge the oppressive rules. He befriends a diverse group of fellow inmates, including Chief Bromden, a seemingly deaf and mute Native American, and introduces them to a taste of independence with activities like card games and fishing trips.\n\nAs he rouses the spirits of the patients, McMurphy finds himself in direct conflict with Nurse Ratched, whose methods suppress individuality and autonomy. Their power struggle escalates, leading to a series of manipulations and punitive measures by Ratched, including electroshock therapy.\n\nThe turning point comes when McMurphy organizes a secret party involving alcohol and women, leading to consequences that shatter the fragile balance. The night ends in tragedy when a young patient, Billy Bibbit, is driven to suicide after a confrontation with Nurse Ratched.\n\nIn a climactic attempt to escape, McMurphy attacks Nurse Ratched, leaving her wounded but unbroken. His rebellion is violently quashed, and he is subjected to a lobotomy, rendering him catatonic.\n\nIn a final act of liberation and defiance, Chief Bromden smothers McMurphy with a pillow to end his suffering and escapes the institution by breaking through a window, symbolizing hope and the enduring spirit of freedom."
    },
    {
        "id": 18,
        "Series_Title": "Hamilton",
        "Released_Year": "2020",
        "Runtime": "160 min",
        "Genre": "Biography, Drama, History",
        "IMDB_Rating": "8.6",
        "Overview": "The real life of one of America's foremost founding fathers and first Secretary of the Treasury, Alexander Hamilton. Captured live on Broadway from the Richard Rodgers Theater with the original Broadway cast.",
        "Director": "Thomas Kail",
        "Star1": "Lin-Manuel Miranda",
        "Star2": "Phillipa Soo",
        "Star3": "Leslie Odom Jr.",
        "Star4": "Renée Elise Goldsberry",
        "Gross": "",
        "Synopsis": "\"Hamilton\" is a musical film that captures the revolutionary cultural phenomenon of the Broadway show, which was written and composed by Lin-Manuel Miranda. It tells the story of Alexander Hamilton, one of the Founding Fathers of the United States, through a diverse and dynamic cast with a blend of hip-hop, jazz, R&B, and traditional Broadway music.\n\nThe film opens by introducing Alexander Hamilton, an orphaned immigrant from the Caribbean with an unyielding ambition. His rise from poverty is chronicled through his arrival in New York in 1776, where he meets influential figures like Aaron Burr, Marquis de Lafayette, John Laurens, and Hercules Mulligan, who play pivotal roles in the American Revolution. Hamilton's fervor and intellect quickly make him a trusted aide to General George Washington.\n\nHamilton marries Eliza Schuyler and is drawn into the political sphere, participating in battles and contributing to the foundational structure of the nascent United States. His intense rivalry with Aaron Burr, depicted through powerful and competitive duels, is a recurring theme that underscores the narrative.\n\nThroughout the film, Hamilton's personal and professional life is marked by triumphs and struggles. He helps establish the nation's financial infrastructure but is caught in scandals, including an affair with Maria Reynolds, straining his marriage with Eliza.\n\nThe tension with Burr escalates, culminating in their infamous duel, where Hamilton is mortally wounded. The film ends with reflections on Hamilton's legacy, spotlighting his contributions and the resonance of his ideas in shaping the country.\n\nInterwoven with historical details and rich character development, \"Hamilton\" emphasizes themes of ambition, legacy, and the enduring impact of one's story on future generations."
    },
    {
        "id": 19,
        "Series_Title": "Parsite",
        "Released_Year": "2019",
        "Runtime": "132 min",
        "Genre": "Comedy, Drama, Thriller",
        "IMDB_Rating": "8.6",
        "Overview": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.",
        "Director": "Bong Joon Ho",
        "Star1": "Kang-ho Song",
        "Star2": "Lee Sun-kyun",
        "Star3": "Cho Yeo-jeong",
        "Star4": "Choi Woo-sik",
        "Gross": "53,367,844",
        "Synopsis": "\"Parasite\" is a South Korean dark comedy thriller directed by Bong Joon-ho. The film follows the impoverished Kim family as they infiltrate the lives of the wealthy Park family. The story begins with the Kims living in a cramped basement apartment, struggling to make ends meet through low-paying and temporary jobs.\n\nWhen the Kims' son, Ki-woo, gets a chance to tutor the Park family's daughter, the Kims see an opportunity. Using deception, Ki-woo secures the job and eventually engineers the employment of his entire family within the Park household, under false pretenses. His sister, Ki-jung, becomes an art therapist for the Parks' young son; his father, Ki-taek, is hired as the driver; and his mother, Chung-sook, replaces the existing housekeeper, Moon-gwang.\n\nAs the Kims settle into their roles, they become intoxicated by their newfound wealth and luxury. However, their deception begins to unravel when Moon-gwang returns, revealing a secret bunker beneath the Parks' home where her husband has been hiding from loan sharks for years.\n\nTensions escalate as both families' secrets collide. The Kims try to maintain control, leading to a series of violent and tragic events during a party hosted by the Parks. The climax results in a shocking confrontation that leaves several characters dead or injured.\n\nThe film concludes with Ki-woo dreaming of one day earning enough money to buy the Park house and free his father, who is now hiding in the secret bunker after the chaos. \"Parasite\" explores themes of class disparity, social mobility, and the human tendency toward self-preservation, leaving viewers with a powerful and thought-provoking commentary on inequality."
    },
    {
        "id": 20,
        "Series_Title": "Soorarai Pottru",
        "Released_Year": "2020",
        "Runtime": "153 min",
        "Genre": "Drama",
        "IMDB_Rating": "8.6",
        "Overview": "Nedumaaran Rajangam \"Maara\" sets out to make the common man fly and in the process takes on the world's most capital intensive industry and several enemies who stand in his way.",
        "Director": "Sudha Kongara",
        "Star1": "Suriya",
        "Star2": "Madhavan",
        "Star3": "Paresh Rawal",
        "Star4": "Aparna Balamurali",
        "Gross": "",
        "Synopsis": "**Soorarai Pottru** is an inspiring story centered on the ambitious dreams of Nedumaaran Rajangam, a former Indian Air Force captain played by Suriya, whose mission is to make air travel affordable for everyone. Inspired by the true story of G.R. Gopinath, founder of Air Deccan, the film depicts Maara's journey from a small village to becoming a pioneering entrepreneur in the aviation industry.\n\nMaara, driven by a childhood incident that ignites his passion for flying, dreams of launching a low-cost airline. Despite financial hardships and societal obstacles, he remains determined and resilient. Maara is supported by his wife, Sundari \"Bommi\" Nedumaaran, portrayed by Aparna Balamurali, a strong-willed woman who runs a successful bakery. Her unwavering belief in his vision is a cornerstone of Maara’s efforts.\n\nOpposition arises from Paresh Goswami, a powerful airline tycoon who views Maara's venture as a threat and goes to great lengths to thwart his plans. Despite such adversity, Maara relentlessly pursues his goal. Alongside loyal friends and colleagues, Maara navigates bureaucratic hurdles, financial constraints, and intense competition.\n\nThe film highlights Maara's relentless spirit and the support from his wife, showing the emotional and psychological toll of his pursuits. After numerous trials, setbacks, and exhausting efforts, Maara's dream finally takes flight as he successfully launches his airline, making air travel accessible to the common man.\n\n\"Soorarai Pottru\" beautifully weaves themes of determination, love, and ambition against the backdrop of a socially relevant narrative, ultimately celebrating human resilience and the power of dreams."
    },
    {
        "id": 21,
        "Series_Title": "Interstellar",
        "Released_Year": "2014",
        "Runtime": "169 min",
        "Genre": "Adventure, Drama, Sci-Fi",
        "IMDB_Rating": "8.6",
        "Overview": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.",
        "Director": "Christopher Nolan",
        "Star1": "Matthew McConaughey",
        "Star2": "Anne Hathaway",
        "Star3": "Jessica Chastain",
        "Star4": "Mackenzie Foy",
        "Gross": "188,020,017",
        "Synopsis": "In \"Interstellar,\" Earth is on the brink of collapse due to environmental degradation and failing crops, leading humanity to face imminent extinction. The story follows Cooper, a former NASA pilot turned farmer, who is struggling to sustain his family, including his daughter Murph and son Tom.\n\nA mysterious gravitational anomaly in Murph's room leads Cooper to a hidden NASA base where he reconnects with Professor Brand. Brand reveals that NASA has discovered a wormhole near Saturn, offering a chance to find habitable planets in a distant galaxy. Cooper is recruited to lead the mission, alongside scientists Amelia Brand, Romilly, and Doyle, with the objective of finding a new home for humanity.\n\nThe team travels through the wormhole and explores several planets, each with its challenges. They first visit a water-covered planet orbiting a supermassive black hole, resulting in a time dilation that drastically reduces their resources. Doyle is killed, and Cooper grapples with the loss as decades pass on Earth.\n\nTheir journey continues to a second planet, a frozen wasteland where they encounter Dr. Mann, a scientist previously sent to assess habitability. Mann betrays the crew in his desperation, leading to a perilous confrontation. Meanwhile, time on Earth is running out, and Murph, now a scientist herself, works with an aging Professor Brand to solve the equation that could save humanity.\n\nIn a desperate attempt to save the mission, Cooper and Amelia target the final viable planet. Cooper sacrifices himself by dropping into the black hole, \"Gargantua,\" hoping to transmit data crucial to Murph's calculations. Inside the singularity, Cooper finds himself in a multidimensional space where time is non-linear. He uses this environment, created by advanced beings, to communicate with Murph in the past, revealing the solution to the gravitational equation via the watch he left her.\n\nMurph deciphers the message, allowing humanity to harness gravity and leave Earth. Cooper is eventually rescued and brought to a space station near Saturn, where he reunites with an elderly Murph. She urges him to seek out Amelia, who is establishing a new colony. The film concludes with Cooper setting off to join her, embracing hope for humanity’s future beyond Earth."
    },
    {
        "id": 22,
        "Series_Title": "City of God",
        "Released_Year": "2002",
        "Runtime": "130 min",
        "Genre": "Crime, Drama",
        "IMDB_Rating": "8.6",
        "Overview": "In the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin.",
        "Director": "Fernando Meirelles",
        "Star1": "Kátia Lund",
        "Star2": "Alexandre Rodrigues",
        "Star3": "Leandro Firmino",
        "Star4": "Matheus Nachtergaele",
        "Gross": "7,563,397",
        "Synopsis": "\"City of God\" is a Brazilian crime drama film that follows the turbulent rise and fall of criminal factions in the slums of Rio de Janeiro, spanning the 1960s through the early 1980s.\n\nThe story is narrated by Rocket, a young aspiring photographer who grows up in the violent neighborhood. Despite the chaos around him, Rocket dreams of escaping the dangerous life of crime. His perspective offers a glimpse into the lives of those embedded in the gang culture.\n\nThe film begins with childhood stories involving Rocket and local kids, including Li'l Dice, who later becomes the ruthless drug lord Li'l Zé. As they grow older, Li'l Zé seizes power, tightening his grip on the slum's drug trade through violence and intimidation.\n\nThe narrative divides into interweaving segments showing different characters' lives: Benny, Li'l Zé's friend who dreams of a quieter life; Knockout Ned, a kind-hearted bus driver pushed into vengeance after his family is brutally attacked; and Carrot, a rival dealer attempting to challenge Li'l Zé's dominance.\n\nConflicts escalate into a brutal gang war, bringing widespread chaos and suffering to the community. Rocket, meanwhile, remains on the periphery, capturing the violence through his camera lens. In a twist of fate, his photographs earn him a newspaper job, providing a potential escape from the slum life.\n\nThe film culminates in a bloody showdown, reflecting the cyclical nature of violence and the ongoing struggle for power. Ultimately, Rocket manages to find a way out through his photography, though the neighborhood remains trapped in a cycle of crime and poverty.\n\n\"City of God\" offers a gripping, unflinching look at the harsh realities of life in the favelas, highlighting themes of destiny, survival, and the quest for a better future amidst relentless adversity."
    },
    {
        "id": 23,
        "Series_Title": "Spirited Away",
        "Released_Year": "2001",
        "Runtime": "125 min",
        "Genre": "Animation, Adventure, Family",
        "IMDB_Rating": "8.6",
        "Overview": "During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts.",
        "Director": "Hayao Miyazaki",
        "Star1": "Daveigh Chase",
        "Star2": "Suzanne Pleshette",
        "Star3": "Miyu Irino",
        "Star4": "Rumi Hiiragi",
        "Gross": "10,055,859",
        "Synopsis": "**Spirited Away** is a Japanese animated film directed by Hayao Miyazaki and produced by Studio Ghibli. The story follows a young girl named Chihiro Ogino, who stumbles into a magical world while moving to a new neighborhood with her parents.\n\nThe adventure begins when Chihiro's family takes a wrong turn and discovers what appears to be an abandoned amusement park. As they explore, Chihiro's parents are transformed into pigs after eating food destined for spirits. Terrified and alone, Chihiro encounters a mysterious boy named Haku, who warns her to leave before nightfall. However, it is too late, and she finds herself trapped in the spirit world.\n\nDesperate to survive and free her parents, Chihiro takes on a new name, Sen, and secures a job at a bathhouse run by the malevolent witch Yubaba. Sen's journey is fraught with challenges as she meets a host of strange characters, including the enigmatic No-Face, a spirit that becomes obsessed with her.\n\nWith courage and determination, Sen navigates the complexities of the spirit world, uncovering Haku's true identity and the secrets of the bathhouse. As she grows stronger and more resilient, Sen learns the importance of friendship, identity, and kindness.\n\nIn a final act of bravery, Sen confronts Yubaba and secures her parents' freedom by passing a test that challenges her perception and conviction. With her true name, Chihiro, reclaimed, she and her parents return to the human world, leaving the spirit realm behind.\n\nThe film ends as Chihiro and her family resume their journey to their new home, with Chihiro having matured immensely from her experiences, ready to face whatever lies ahead."
    },
    {
        "id": 24,
        "Series_Title": "Saving Private Ryan",
        "Released_Year": "1998",
        "Runtime": "169 min",
        "Genre": "Drama, War",
        "IMDB_Rating": "8.6",
        "Overview": "Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.",
        "Director": "Steven Spielberg",
        "Star1": "Tom Hanks",
        "Star2": "Matt Damon",
        "Star3": "Tom Sizemore",
        "Star4": "Edward Burns",
        "Gross": "216,540,909",
        "Synopsis": "During the harrowing D-Day invasion of Normandy in World War II, Captain John Miller leads his men through the chaos of Omaha Beach. In the aftermath, it is discovered that three of the four Ryan brothers have been killed in action, with their mother about to receive the tragic news. To alleviate her grief, the U.S. military decides to save the fourth brother, Private James Ryan, who is missing in action.\n\nCaptain Miller is assigned to find Ryan and bring him home. Miller gathers a squad of soldiers, each with their own expertise and personalities, as they venture through the war-torn French countryside. The mission becomes a test of their resolve and humanity as they navigate the constant threat of German forces and the moral dilemma of risking many lives to save one man.\n\nAs the squad suffers casualties and tensions rise, they finally locate Ryan in the village of Ramelle, where he is helping to defend a tactically vital bridge. Ryan initially refuses to abandon his post or his comrades. The men prepare for a brutal German assault, culminating in a fierce battle. In the process, Captain Miller is mortally wounded but manages to ensure the mission's success.\n\nIn the film’s poignant conclusion, the older James Ryan visits Miller's grave with his family, haunted by the sacrifices made for his survival. He reflects on whether he has lived a life worthy of their efforts, underscoring the film's themes of duty, sacrifice, and the profound cost of war."
    },
    {
        "id": 25,
        "Series_Title": "The Green Mile",
        "Released_Year": "1999",
        "Runtime": "189 min",
        "Genre": "Crime, Drama, Fantasy",
        "IMDB_Rating": "8.6",
        "Overview": "The lives of guards on Death Row are affected by one of their charges: a black man accused of child murder and rape, yet who has a mysterious gift.",
        "Director": "Frank Darabont",
        "Star1": "Tom Hanks",
        "Star2": "Michael Clarke Duncan",
        "Star3": "David Morse",
        "Star4": "Bonnie Hunt",
        "Gross": "136,801,374",
        "Synopsis": "Set in the 1930s, \"The Green Mile\" follows Paul Edgecomb, a corrections officer at Cold Mountain Penitentiary, who supervises death row inmates in a cell block known as \"The Green Mile.\" His life takes a dramatic turn when John Coffey, a massive yet gentle black man convicted of raping and murdering two young girls, arrives on death row.\n\nDespite his imposing size, Coffey exhibits an almost childlike innocence and possesses a mysterious healing ability that is revealed when he cures Paul’s severe bladder infection. As the guards witness more miraculous acts, including saving the life of a fellow officer’s wife suffering from a brain tumor, doubt grows about Coffey’s guilt.\n\nCoffey's presence contrasts starkly with the cruelty of another guard, Percy Wetmore, whose sadistic tendencies add tension to the block. The inmates’ lives intertwine as Delacroix, another prisoner, befriends a mouse named Mr. Jingles, leading to moments of unexpected tenderness.\n\nConfronted with evidence of Coffey's true nature and the realization of his innocence, Paul faces an impossible moral dilemma. Coffey, weary of the world's cruelties, ultimately accepts his fate, longing for peace. When Coffey is executed, the event leaves Paul and the other guards to grapple with guilt and the burden of their roles.\n\n\"The Green Mile\" is a moving exploration of humanity, justice, and redemption, highlighting the profound impact one man's life can have on others."
    },
    {
        "id": 26,
        "Series_Title": "Life is Beautiful",
        "Released_Year": "1997",
        "Runtime": "116 min",
        "Genre": "Comedy, Drama, Romance",
        "IMDB_Rating": "8.6",
        "Overview": "When an open-minded Jewish librarian and his son become victims of the Holocaust, he uses a perfect mixture of will, humor, and imagination to protect his son from the dangers around their camp.",
        "Director": "Roberto Benigni",
        "Star1": "Roberto Benigni",
        "Star2": "Nicoletta Braschi",
        "Star3": "Giorgio Cantarini",
        "Star4": "Giustino Durano",
        "Gross": "57,598,247",
        "Synopsis": "\"Life is Beautiful\" is a 1997 Italian film directed by Roberto Benigni, who also stars in the lead role. The story is set against the harrowing backdrop of World War II but is imbued with warmth, humor, and hope.\n\nThe film begins in 1930s Italy, where Guido Orefice, a charming and funny Jewish man, arrives in the city of Arezzo with dreams of opening a bookstore. Guido is an optimist with a gift for finding humor in even the direst of situations. He meets and falls in love with Dora, a beautiful schoolteacher who is engaged to a wealthy but arrogant man. Guido wins Dora's heart with his wit and persistent charm, and they eventually marry and have a son, Giosuè.\n\nAs World War II intensifies, Guido and his family are taken to a Nazi concentration camp. To protect his young son from the horrors of their situation, Guido uses his imagination to construct an elaborate fiction. He convinces Giosuè that their internment is part of a complex and entertaining game, and if they accumulate enough points by following the camp's rules, they will win a real tank.\n\nGuido's humor and creativity are unwavering as he shields Giosuè from the grim reality surrounding them. Despite the brutal conditions, he manages to turn their experiences into playful adventures, keeping his son's spirit alive.\n\nThe climax unfolds as the war nears its end. Guido's unwavering efforts to maintain the illusion of the \"game\" are put to the ultimate test. Tragically, Guido is captured and executed by the guards, but not before ensuring that Giosuè is hidden and safe.\n\nIn the film's poignant conclusion, the camp is liberated by American forces. Giosuè, safely emerging from his hiding place, is overjoyed to see a real tank arriving, his father’s make-believe story finally taking on a semblance of reality. Reunited with his mother, Giosuè narrates as an adult, appreciating the sacrifice and love his father showed to shield him from the harshness of their ordeal.\n\n\"Life is Beautiful\" is a heartwarming and tragic tale that masterfully balances comedy and drama, leaving audiences with a powerful message about the resilience of the human spirit and the enduring power of love."
    },
    {
        "id": 27,
        "Series_Title": "Se7en",
        "Released_Year": "1995",
        "Runtime": "127 min",
        "Genre": "Crime, Drama, Mystery",
        "IMDB_Rating": "8.6",
        "Overview": "Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives.",
        "Director": "David Fincher",
        "Star1": "Morgan Freeman",
        "Star2": "Brad Pitt",
        "Star3": "Kevin Spacey",
        "Star4": "Andrew Kevin Walker",
        "Gross": "100,125,643",
        "Synopsis": "**Se7en** is a psychological crime thriller directed by David Fincher. The film follows two detectives, the seasoned William Somerset and the newly transferred David Mills, as they are drawn into the hunt for a cunning and meticulous serial killer who uses the seven deadly sins as the basis for his murders.\n\nSomerset, nearing retirement, is weary of the violence and darkness of the city, while Mills is eager and impulsive, having moved to the city with his wife Tracy for a fresh start. The investigation begins with a gruesome murder representing \"Gluttony,\" where a man is forced to eat until his stomach bursts. This sets the tone for a series of grim and morbid crime scenes, each more shocking than the last.\n\nAs the murders continue, the detectives piece together the killer's plan. Each victim is chosen to represent a sin—Gluttony, Greed, Sloth, Lust, Pride, Envy, and Wrath—and die in a manner that reflects their transgressions. The killer, John Doe, remains elusive and taunts the detectives with cryptic clues and philosophical musings on the nature of sin and human depravity.\n\nThe tension escalates as Doe remains a step ahead, and Somerset becomes increasingly wary of the case's impact on Mills. Meanwhile, Tracy develops a friendship with Somerset, revealing her concerns about life in the city and her struggles adapting to their new environment.\n\nIn a shocking turn of events, Doe surrenders himself to the detectives, claiming his work is incomplete. He offers to lead them to the final bodies, manipulating the situation to his advantage. In a desolate field, Somerset and Mills discover a box containing Tracy's severed head. Doe reveals that she was killed because he envied Mills' normal life, fulfilling the \"Envy\" sin.\n\nOvercome with rage and despair, Mills executes Doe, committing the sin of \"Wrath\" and completing Doe's plan. The film ends with Mills in custody, Somerset contemplating the corrupt and dark nature of humanity, and the haunting inevitability of the cycle of violence continuing.\n\n**Se7en** is a dark exploration of morality, obsession, and the human condition, leaving audiences to ponder the thin line between justice and vengeance."
    },
    {
        "id": 28,
        "Series_Title": "The Silence of the Lambs",
        "Released_Year": "1991",
        "Runtime": "118 min",
        "Genre": "Crime, Drama, Thriller",
        "IMDB_Rating": "8.6",
        "Overview": "A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims.",
        "Director": "Jonathan Demme",
        "Star1": "Jodie Foster",
        "Star2": "Anthony Hopkins",
        "Star3": "Lawrence A. Bonney",
        "Star4": "Kasi Lemmons",
        "Gross": "130,742,922",
        "Synopsis": "\"The Silence of the Lambs\" is a psychological horror-thriller that follows FBI trainee Clarice Starling as she seeks the help of the incarcerated Dr. Hannibal Lecter, a brilliant psychiatrist and cannibalistic serial killer, to capture another killer nicknamed \"Buffalo Bill.\" Bill is known for skinning his female victims, and Starling is tasked with gaining Lecter's insights to stop him. \n\nClarice visits Lecter in a high-security asylum, where he agrees to help but demands personal information about her in return, creating a tense psychological exchange. As Lecter teases out details of her past, particularly her childhood trauma involving screaming lambs on a relative's farm, he provides cryptic clues about Bill's identity.\n\nMeanwhile, Buffalo Bill kidnaps Catherine Martin, the daughter of a U.S. senator, intensifying the urgency of the case. Using the leads provided by Lecter, who eventually escapes custody in a gruesome and cunning manner, Clarice races against time to find Bill. \n\nUltimately, her investigations lead her to a small-town house, where she discovers Bill's true identity. In a chilling confrontation in his darkened basement, Clarice overcomes her fears and shoots Bill dead, saving Catherine and ending the series of murders.\n\nThe film concludes with Clarice graduating from the FBI Academy, only to receive a phone call from Lecter, who remains at large, hinting at a future meeting. The film explores themes of power, manipulation, and the darkness within, embodying a haunting narrative that mixes horror with psychological depth."
    },
    {
        "id": 29,
        "Series_Title": "Star Wars",
        "Released_Year": "1977",
        "Runtime": "121 min",
        "Genre": "Action, Adventure, Fantasy",
        "IMDB_Rating": "8.6",
        "Overview": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader.",
        "Director": "George Lucas",
        "Star1": "Mark Hamill",
        "Star2": "Harrison Ford",
        "Star3": "Carrie Fisher",
        "Star4": "Alec Guinness",
        "Gross": "322,740,140",
        "Synopsis": "**Star Wars: A New Hope**\n\nIn a galaxy far, far away, the tyrannical Galactic Empire, led by the sinister Darth Vader, captures Princess Leia Organa, a leader of the Rebel Alliance. Before her capture, Leia sends two droids, R2-D2 and C-3PO, to the desert planet of Tatooine with a message for the old Jedi Master, Obi-Wan Kenobi.\n\nThe droids are found by Luke Skywalker, a young farm boy yearning for adventure. When Luke encounters Obi-Wan (known locally as Ben Kenobi), he learns of his father’s past as a Jedi Knight and receives his father’s lightsaber. Obi-Wan reveals that the droids carry plans for the Empire’s ultimate weapon, the Death Star, a space station capable of destroying entire planets. Luke joins Obi-Wan to deliver the plans to the Rebel Alliance.\n\nTo reach the rebel base, they hire Han Solo, a rogue smuggler, and his co-pilot, Chewbacca, to transport them on their ship, the Millennium Falcon. Meanwhile, Leia is held captive on the Death Star, where she bravely resists interrogation. The Empire, hoping to locate the rebel base, threatens her home planet, Alderaan, with destruction.\n\nThe Falcon is captured by the Death Star, where the group rescues Leia and narrowly escapes. During their escape, Obi-Wan confronts and sacrifices himself battling Darth Vader, allowing the others to flee. As they regroup with the Rebels, they plan an attack on the Death Star.\n\nIn a climactic battle, the Rebels launch a fighter assault with the hopes of exploiting a vulnerability in the station's design, uncovered by the plans Leia sent. As Darth Vader personally joins the battle, Luke lets the Force guide him during the assault. With guidance from Obi-Wan’s spirit, Luke fires a crucial shot, causing the Death Star’s destruction.\n\nThe film concludes with the heroes receiving honors for their bravery, as the hope for galactic freedom is reignited."
    },
    {
        "id": 30,
        "Series_Title": "Harakiri",
        "Released_Year": "1962",
        "Runtime": "133 min",
        "Genre": "Action, Drama, Mystery",
        "IMDB_Rating": "8.6",
        "Overview": "When a ronin requesting seppuku at a feudal lord's palace is told of the brutal suicide of another ronin who previously visited, he reveals how their pasts are intertwined - and in doing so challenges the clan's integrity.",
        "Director": "Masaki Kobayashi",
        "Star1": "Tatsuya Nakadai",
        "Star2": "Akira Ishihama",
        "Star3": "Shima Iwashita",
        "Star4": "Tetsurô Tanba",
        "Gross": "",
        "Synopsis": "Set in 1630 Japan during the Edo period, \"Harakiri\" follows the story of Hanshirō Tsugumo, a masterless samurai or ronin, who arrives at the estate of the powerful Iyi clan. He requests permission to commit seppuku (ritual suicide) in their courtyard, a common ploy by destitute samurai seeking charity rather than death.\n\nThe Iyi clan's senior counselor, Kageyu Saito, is suspicious, recalling a similar occurrence only months prior involving a young ronin named Motome Chijiiwa. To dissuade Tsugumo, Saito recounts how the clan forced Motome, who was desperate and armed only with a bamboo sword, to follow through with the gruesome ritual.\n\nUndeterred, Tsugumo insists on performing seppuku, prompting Saito to agree and arrange an audience. As the preparations are made, Tsugumo begins to tell his own story, exposing the cruel hypocrisy and callousness of the samurai code.\n\nIn a series of flashbacks, it's revealed that Motome was Tsugumo's son-in-law, forced into the desperate act by the financial struggles of his new family. The Iyi clan's merciless actions led to Motome's agonizing death and ignited Tsugumo's quest for justice.\n\nWith three of the clan's warriors conspicuously absent, Tsugumo's true intentions come to light. He engages in a deadly duel with several Iyi samurai, exposing their cowardice and the hollowness of their honor-bound lives. Ultimately, Tsugumo chooses to end his life on his own terms.\n\nThe Iyi clan erases all traces of the day's events, preserving their illusion of honor. The film concludes with a powerful critique of rigid tradition and the facade of stoic dignity, underscoring the disparity between appearance and reality in the samurai code."
    },
    {
        "id": 31,
        "Series_Title": "Seven Samurai",
        "Released_Year": "1954",
        "Runtime": "207 min",
        "Genre": "Action, Adventure, Drama",
        "IMDB_Rating": "8.6",
        "Overview": "A poor village under attack by bandits recruits seven unemployed samurai to help them defend themselves.",
        "Director": "Akira Kurosawa",
        "Star1": "Toshirô Mifune",
        "Star2": "Takashi Shimura",
        "Star3": "Keiko Tsushima",
        "Star4": "Yukiko Shimazaki",
        "Gross": "269,061",
        "Synopsis": "In \"Seven Samurai,\" directed by Akira Kurosawa, a small 16th-century Japanese farming village is repeatedly raided by ruthless bandits who steal their crops, leaving the villagers impoverished. Desperate for a solution, the villagers decide to hire samurai to protect them. However, with limited resources, they can only afford to pay in food and lodging.\n\nA wise and skilled but aging samurai, Kambei, agrees to help out of compassion. He recruits six other samurai, each with unique skills and personalities, including the spirited Kikuchiyo, who claims to be a samurai but lacks formal training.\n\nArriving at the village, the samurai begin to fortify its defenses and train the villagers to fight. As they work together, the villagers' fear gradually turns into respect and admiration for the samurai. Kikuchiyo connects with the farmers due to his own rural background, bridging the gap between the villagers and the warriors.\n\nTensions rise as the bandits prepare to attack. In a series of strategically planned confrontations, the samurai and villagers fight side by side, setting traps and ambushing the bandits. As the battle intensifies, sacrifices are made, and several samurai fall.\n\nUltimately, the bandits are defeated, but only Kambei and two other samurai survive. The film concludes on a somber note, highlighting the fleeting nature of victory. Kambei reflects that despite their efforts, true triumph belongs to the villagers who can now live in peace, while the samurai must continue their transient existence."
    },
    {
        "id": 32,
        "Series_Title": "It's a Wonderful Life",
        "Released_Year": "1946",
        "Runtime": "130 min",
        "Genre": "Drama, Family, Fantasy",
        "IMDB_Rating": "8.6",
        "Overview": "An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed.",
        "Director": "Frank Capra",
        "Star1": "James Stewart",
        "Star2": "Donna Reed",
        "Star3": "Lionel Barrymore",
        "Star4": "Thomas Mitchell",
        "Gross": "",
        "Synopsis": "**It's a Wonderful Life** is a classic 1946 film directed by Frank Capra, starring James Stewart as George Bailey. Set in the small town of Bedford Falls, the story follows George, a compassionate and selfless man who has spent his life helping others, often at the expense of his own dreams.\n\nThe film begins with an overview of George's life, emphasizing his dreams of exploring the world and becoming an architect. However, circumstances continually thwart his ambitions. When his father dies, George postpones college to manage the family-run Bailey Brothers Building and Loan, preventing the greedy banker Henry Potter from taking over the town.\n\nGeorge marries his childhood sweetheart, Mary, and they settle down in Bedford Falls. Despite his deep love for Mary and their children, George struggles with unfulfilled ambitions, while the Building and Loan barely survives Potter’s attempts to ruin it.\n\nOn Christmas Eve, an unexpected financial loss instigated by a misplaced deposit puts George in despair. Facing scandal and ruin, he contemplates suicide, believing everyone would be better off if he had never existed.\n\nThis prompts the intervention of Clarence Odbody, an angel assigned to earn his wings by helping George. Clarence shows George a grim alternate reality where he was never born. In this world, Bedford Falls is a bleak place dominated by Potter, and the people George cares about suffer greatly in his absence.\n\nRealizing the impact he’s had on others, George begs for his life back. His wish is granted. As he returns to his reality, George finds the townspeople have rallied to help him, overcoming his financial crisis. Filled with gratitude and joy, he rediscovers the value of his life and the true riches of friendship and love.\n\nThe film concludes with friends and family surrounding George, singing “Auld Lang Syne.” Clarence earns his wings, symbolized by a ringing bell, reminding viewers that no man is a failure who has friends."
    },
    {
        "id": 33,
        "Series_Title": "Joker",
        "Released_Year": "2019",
        "Runtime": "122 min",
        "Genre": "Crime, Drama, Thriller",
        "IMDB_Rating": "8.5",
        "Overview": "In Gotham City, mentally troubled comedian Arthur Fleck is disregarded and mistreated by society. He then embarks on a downward spiral of revolution and bloody crime. This path brings him face-to-face with his alter-ego: the Joker.",
        "Director": "Todd Phillips",
        "Star1": "Joaquin Phoenix",
        "Star2": "Robert De Niro",
        "Star3": "Zazie Beetz",
        "Star4": "Frances Conroy",
        "Gross": "335,451,311",
        "Synopsis": "Set in 1981 Gotham City, \"Joker\" follows Arthur Fleck, a struggling, mentally ill comedian who lives with his mother, Penny. Arthur works as a party clown but faces rejection and ridicule, causing his mental health to deteriorate. His isolation is amplified by societal neglect and a series of personal misfortunes.\n\nArthur idolizes talk show host Murray Franklin and dreams of performing stand-up comedy, but his attempts end in humiliation. After being assaulted by young thugs, Arthur receives a gun from a coworker for protection. He later uses it in self-defense, killing three Wall Street businessmen who attack him on a subway. Their deaths spark a movement against Gotham’s wealthy elite, with Arthur becoming a symbolic figure, though unknowingly.\n\nAs the city grapples with unrest, Arthur discovers that Penny had been lying about his origins and delusions of his father being Thomas Wayne. Desperate for connection, Arthur confronts Thomas Wayne, hoping for answers, but is rejected.\n\nWhile Arthur attempts to navigate reality and his own fantasies, his mental state spirals. He kills his abusive coworker and reconciles with his identity as the Joker after an impromptu, violent appearance on Murray Franklin’s show, which broadcasts his transformation to the world.\n\nIn the climax, Arthur embraces his Joker persona, leading a chaotic revolt in Gotham. With society crumbling around him, Arthur finds a sense of liberation and belonging in the chaos he has inspired, culminating in a chilling, cathartic acceptance of his identity."
    },
    {
        "id": 34,
        "Series_Title": "Whiplash",
        "Released_Year": "2014",
        "Runtime": "106 min",
        "Genre": "Drama, Music",
        "IMDB_Rating": "8.5",
        "Overview": "A promising young drummer enrolls at a cut-throat music conservatory where his dreams of greatness are mentored by an instructor who will stop at nothing to realize a student's potential.",
        "Director": "Damien Chazelle",
        "Star1": "Miles Teller",
        "Star2": "J.K. Simmons",
        "Star3": "Melissa Benoist",
        "Star4": "Paul Reiser",
        "Gross": "13,092,000",
        "Synopsis": "\"Whiplash\" follows the intense journey of Andrew Neiman, an ambitious young drummer studying at the prestigious Shaffer Conservatory in New York City. Determined to become one of the greats, Andrew is driven by his passion and a deep desire to exceed his limitations.\n\nAndrew's life takes a dramatic turn when he is invited to join the conservatory's top jazz ensemble, led by the fearsome and highly respected conductor, Terence Fletcher. Fletcher is known for his ruthless teaching methods and unyielding quest for perfection. Under his brutal direction, Andrew endures relentless pressure and psychological torment as Fletcher pushes him beyond his mental and physical boundaries.\n\nThe film delves into Andrew's obsession with achieving greatness, showing how it begins to consume him. He isolates himself from friends and family, jeopardizes his relationship with his girlfriend, and becomes fixated on earning Fletcher's approval. The extreme competitive environment leads Andrew to practice relentlessly, enduring brutal rehearsals and suffering from physical exhaustion and injuries.\n\nA pivotal performance at a jazz competition becomes a turning point when Andrew is involved in a car accident but still attempts to perform, leading to a public meltdown on stage. The incident results in his expulsion from the conservatory. Dejected, Andrew tries to move on but is haunted by his failure.\n\nLater, Andrew encounters Fletcher at a jazz club, where Fletcher explains his philosophy of pushing students to greatness. He invites Andrew to perform at the JVC Jazz Festival, offering a chance at redemption. Unbeknownst to Andrew, this is a setup for further humiliation, as Fletcher deliberately withholds the music information, banking on Andrew's failure.\n\nIn a final act of defiance, Andrew seizes control during the performance, leading into an unexpected and electrifying drum solo. His raw talent and determination shine through, capturing the audience's and Fletcher’s admiration. The climax sees a silent exchange of respect between Andrew and Fletcher, illustrating the complex, symbiotic relationship between them.\n\n\"Whiplash\" explores themes of ambition, the cost of artistic perfection, and the fine line between dedication and obsession, leaving the audience questioning the limits of pushing boundaries in the pursuit of excellence."
    },
    {
        "id": 35,
        "Series_Title": "The Intouchables",
        "Released_Year": "2011",
        "Runtime": "112 min",
        "Genre": "Biography, Comedy, Drama",
        "IMDB_Rating": "8.5",
        "Overview": "After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caregiver.",
        "Director": "Olivier Nakache",
        "Star1": "Éric Toledano",
        "Star2": "François Cluzet",
        "Star3": "Omar Sy",
        "Star4": "Anne Le Ny",
        "Gross": "13,182,281",
        "Synopsis": "The film follows the unlikely friendship between Philippe, a wealthy quadriplegic, and Driss, a young man from the projects who becomes his caregiver.\n\nPhilippe, paralyzed from a paragliding accident, needs an assistant to help him navigate daily life. Despite receiving numerous candidates, he becomes intrigued by Driss, who only applies to fulfill his unemployment benefit requirements. Impressed by Driss’s lack of pity and his straightforward manner, Philippe offers him the job.\n\nInitially reluctant, Driss accepts and moves into Philippe’s luxurious Parisian mansion. Though he has no formal caregiving experience, Driss learns quickly, and the two men develop a close bond through humor and mutual respect. Driss introduces Philippe to new experiences, such as smoking cannabis, listening to upbeat music, and even flirting with women. In turn, Philippe shares his love for classical music and art with Driss.\n\nThe film explores their contrasting worlds; Driss’s struggling family background and the challenges of life in the suburbs, juxtaposed with Philippe’s affluent lifestyle. Their friendship challenges societal perceptions about disability and class.\n\nThroughout the movie, Driss helps Philippe find joy and confidence again, while also dealing with his own personal issues, such as reconnecting with his family and taking responsibility.\n\nAs the story progresses, Driss becomes an integral part of Philippe's life, not only as a caregiver but as a dear friend. He encourages Philippe to pursue a romantic interest in Éléonore, a woman Philippe has been exchanging letters with.\n\nIn the end, Driss leaves Philippe's service after helping him overcome the biggest challenges, confident that his friend can now take control of his life. Philippe eventually meets Éléonore in person, encouraged by Driss's earlier support.\n\n*The Intouchables* is a heartwarming tale of friendship and personal growth, highlighting how two people from different walks of life can profoundly impact each other."
    },
    {
        "id": 36,
        "Series_Title": "The Prestige",
        "Released_Year": "2006",
        "Runtime": "130 min",
        "Genre": "Drama, Mystery, Sci-Fi",
        "IMDB_Rating": "8.5",
        "Overview": "After a tragic accident, two stage magicians engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit each other.",
        "Director": "Christopher Nolan",
        "Star1": "Christian Bale",
        "Star2": "Hugh Jackman",
        "Star3": "Scarlett Johansson",
        "Star4": "Michael Caine",
        "Gross": "53,089,891",
        "Synopsis": "In \"The Prestige,\" directed by Christopher Nolan, the story unfolds in the late 19th century, focusing on two rival magicians, Robert Angier and Alfred Borden. The film is structured with nonlinear storytelling, moving between multiple timelines and perspectives to reveal its complex narrative.\n\nInitially, both Angier and Borden work together as assistants for a renowned magician. A tragic accident during a performance leads to the death of Angier’s wife, Julia, for which Angier blames Borden. This incident sparks a bitter rivalry between the two, with each magician determined to outdo the other in the craft of illusion.\n\nAs their competition intensifies, both magicians push the boundaries of their skills. Borden develops a spectacular trick called \"The Transported Man,\" where he appears to teleport across the stage. Angier becomes obsessed with discovering Borden's secret and sets out on a quest that takes him across the globe. His journey leads him to Nikola Tesla, who builds a machine that allows Angier to perform a similar teleportation illusion with shocking consequences.\n\nBoth magicians become consumed by their obsession, leading to a series of increasingly destructive acts to sabotage each other's performances. Throughout, the film explores themes of sacrifice, deceit, and the cost of pursuing greatness.\n\nThe climax reveals bitter truths: Borden's trick hinges on a twin brother, unknown to Angier, who has been living as his double. Meanwhile, Angier's machine creates a duplicate of himself every time he performs the trick, with one version drowning each night to maintain the illusion.\n\nThe film concludes with Angier dying and Borden reclaiming custody of his daughter, but at great personal loss. In a poignant final moment, the true extent of their sacrifices becomes clear, leaving a haunting meditation on the nature of obsession and the tragic lengths individuals go to achieve their ambitions."
    },
    {
        "id": 37,
        "Series_Title": "The Departed",
        "Released_Year": "2006",
        "Runtime": "151 min",
        "Genre": "Crime, Drama, Thriller",
        "IMDB_Rating": "8.5",
        "Overview": "An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.",
        "Director": "Martin Scorsese",
        "Star1": "Leonardo DiCaprio",
        "Star2": "Matt Damon",
        "Star3": "Jack Nicholson",
        "Star4": "Mark Wahlberg",
        "Gross": "132,384,315",
        "Synopsis": "\"The Departed\" is a crime thriller directed by Martin Scorsese, set in Boston. It follows two parallel lives: Billy Costigan, a young cop, and Colin Sullivan, a mole planted inside the police department by Irish mob boss Frank Costello.\n\nCostigan, recruited by Captain Queenan and Sergeant Dignam, is tasked to infiltrate Costello’s crew. Meanwhile, Sullivan rises in the ranks of the Massachusetts State Police while secretly sharing information with Costello.\n\nTension builds as both groups realize they have a mole. Costigan struggles with his dual identity and paranoia, while Sullivan works to protect his secret. Both men engage in a dangerous game of cat and mouse, trying to uncover each other's identity while maintaining their own cover.\n\nThe plot intensifies with multiple betrayals and a series of violent encounters. The story culminates in a dramatic and unexpected series of deaths, including Costigan, Queenan, and eventually Sullivan, who is killed by Trooper Brown, revealing that justice, flawed and brutal, eventually prevails.\n\nThe film explores themes of identity, loyalty, and deception, with powerful performances and a complex, twisting narrative."
    },
    {
        "id": 38,
        "Series_Title": "The Pianist",
        "Released_Year": "2002",
        "Runtime": "150 min",
        "Genre": "Biography, Drama, Music",
        "IMDB_Rating": "8.5",
        "Overview": "A Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II.",
        "Director": "Roman Polanski",
        "Star1": "Adrien Brody",
        "Star2": "Thomas Kretschmann",
        "Star3": "Frank Finlay",
        "Star4": "Emilia Fox",
        "Gross": "32,572,577",
        "Synopsis": "\"The Pianist\" is a harrowing historical drama directed by Roman Polanski, based on the autobiography of Władysław Szpilman, a Polish Jewish pianist. Set in Warsaw during World War II, the film follows Szpilman's struggle to survive as the city falls under Nazi occupation.\n\nThe story begins with Szpilman, a celebrated pianist, playing live on Polish radio just as German forces invade Poland in 1939. As Warsaw is overtaken, Szpilman and his family face increasing persecution. Subjected to anti-Jewish laws, they are forced into the crowded and brutal Warsaw Ghetto. Despite the dire conditions, Szpilman continues to hope for liberation.\n\nThe situation worsens as deportations begin. Szpilman narrowly escapes being sent to a concentration camp due to the intervention of a friend. He watches helplessly as his family is taken away. Alone, Szpilman moves between hiding places, relying on the help of sympathetic friends and acquaintances.\n\nAs the war drags on, Szpilman endures countless hardships, including near starvation and constant danger. His refuge in ruined Warsaw buildings becomes increasingly precarious. Despite the adversity, he survives by his wits and a profound will to live.\n\nIn the film's climax, a German officer, Captain Wilm Hosenfeld, discovers Szpilman in hiding. Instead of turning him in, Hosenfeld is moved by Szpilman's talent after hearing him play a piano in an abandoned house. The officer provides Szpilman with food and a promise of protection, which ultimately ensures his survival.\n\nThe film concludes with a bittersweet note of Szpilman resuming his career as a pianist after the war, with Hosenfeld's own fate left to the post-war trials. \"The Pianist\" poignantly captures the resilience of the human spirit amidst the horrors of war."
    },
    {
        "id": 39,
        "Series_Title": "Gladiator",
        "Released_Year": "2000",
        "Runtime": "155 min",
        "Genre": "Action, Adventure, Drama",
        "IMDB_Rating": "8.5",
        "Overview": "A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.",
        "Director": "Ridley Scott",
        "Star1": "Russell Crowe",
        "Star2": "Joaquin Phoenix",
        "Star3": "Connie Nielsen",
        "Star4": "Oliver Reed",
        "Gross": "187,705,427",
        "Synopsis": "**Gladiator** follows the journey of Maximus Decimus Meridius, a loyal Roman general betrayed by the power-hungry Commodus, the son of Emperor Marcus Aurelius. As Marcus Aurelius nears death, he wishes to restore power to the Senate and appoints Maximus as his successor, recognizing his valor and integrity. \n\nHowever, Commodus, driven by jealousy and ambition, murders his father to seize the throne. Once emperor, Commodus orders the execution of Maximus and his family. Betrayed and devastated, Maximus escapes, only to find his home destroyed and his family murdered.\n\nCaptured by slave traders, Maximus is sold to Proximo, a former gladiator, who trains him to fight in the arena. Renowned for his prowess and strategic mind, Maximus quickly becomes a crowd favorite, known as \"The Spaniard.\"\n\nMaximus uses his rising fame to gain proximity to the emperor. During a series of brutal contests, his combat skill brings him face-to-face with Commodus in the Roman Colosseum. Revelations unfold, and Maximus's identity becomes known, igniting tensions in Rome.\n\nAs Maximus inspires the people and earns the respect of his fellow gladiators, he also forms alliances with Lucilla, Commodus's sister, who opposes her brother's tyranny, and key senators working undercover to restore the republic.\n\nIn a final confrontation, Commodus challenges an injured Maximus to a duel. Despite being weakened by Commodus’s treachery, Maximus draws on his strength and honor, ultimately killing Commodus. Mortally wounded, Maximus envisions the afterlife, reuniting with his family as he succumbs to his injuries.\n\nMaximus's death galvanizes the Senate to restore Rome to a republic, embodying the values he upheld. His legacy as a true leader and hero endures."
    },
    {
        "id": 40,
        "Series_Title": "American History X",
        "Released_Year": "1998",
        "Runtime": "119 min",
        "Genre": "Drama",
        "IMDB_Rating": "8.5",
        "Overview": "A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did.",
        "Director": "Tony Kaye",
        "Star1": "Edward Norton",
        "Star2": "Edward Furlong",
        "Star3": "Beverly D'Angelo",
        "Star4": "Jennifer Lien",
        "Gross": "6,719,864",
        "Synopsis": "\"American History X\" follows the story of Derek Vinyard, a former neo-Nazi leader in Venice Beach, California. The film opens with Derek being released from prison after serving three years for the racially motivated murder of two African-American men who tried to steal his truck. \n\nUpon his release, Derek is a changed man, having renounced his racist beliefs due to introspection and the influence of a friendship he formed with an African-American inmate named Lamont. However, he finds his younger brother, Danny, deeply entrenched in the white supremacist movement that Derek had once fiercely championed.\n\nThe film uses a non-linear narrative, interspersing color sequences of the present with black-and-white flashbacks that reveal the forces shaping Derek's past. These include the influence of his father, who was killed by a drug dealer, and the manipulative sway of Cameron Alexander, a charismatic neo-Nazi.\n\nDerek's journey away from hatred and his attempt to prevent Danny from following in his footsteps form the heart of the narrative. He meets with his former high school teacher, Dr. Bob Sweeney, who has been a mentor both to him in prison and to Danny outside. Dr. Sweeney is determined to help Derek make amends and guide Danny onto a better path.\n\nTragically, the film concludes with Danny being shot by a black student he had previously antagonized, underscoring the film's themes of hate breeding more violence. Derek cradles his dying brother, realizing the devastating cycle of hatred and retribution that he had unwittingly perpetuated.\n\n\"American History X\" is a powerful exploration of the destructive nature of racism and the possibility of redemption through personal transformation and love."
    },
    {
        "id": 41,
        "Series_Title": "The Usual Suspects",
        "Released_Year": "1995",
        "Runtime": "106 min",
        "Genre": "Crime, Mystery, Thriller",
        "IMDB_Rating": "8.5",
        "Overview": "A sole survivor tells of the twisty events leading up to a horrific gun battle on a boat, which began when five criminals met at a seemingly random police lineup.",
        "Director": "Bryan Singer",
        "Star1": "Kevin Spacey",
        "Star2": "Gabriel Byrne",
        "Star3": "Chazz Palminteri",
        "Star4": "Stephen Baldwin",
        "Gross": "23,341,568",
        "Synopsis": "\"The Usual Suspects\" is a neo-noir crime thriller that begins with the aftermath of a gruesome massacre and explosion on a ship docked in San Pedro Bay. The primary narrative is told through the interrogation of Roger \"Verbal\" Kint, a con artist with cerebral palsy, who is one of the two survivors found on the scene. \n\nThe story unfolds through Verbal's flashbacks, revealing how he and four other criminals—Dean Keaton, Michael McManus, Todd Hockney, and Fred Fenster—were brought together for a lineup in New York, supposedly as suspects for a truck hijacking. However, the lineup seems to be a ruse, leading them to collaborate on their own criminal operations. \n\nTheir schemes culminate in their involvement with a legendary and mysterious crime lord named Keyser Söze, who coerces them into attacking the cargo ship. Through various twists, it is revealed that Söze's identity is a mystery, instilling fear by eliminating enemies and even his own family to preserve his anonymity.\n\nThe climax builds as the audience learns the true power and influence of Söze, culminating in a shocking twist. As Verbal finishes his tale and is released, his narrative is revealed to be filled with fabrications, woven together from surroundings in the office. The final, iconic sequence reveals that Roger \"Verbal\" Kint himself is the elusive Keyser Söze, brilliantly manipulating events to orchestrate his own freedom."
    },
    {
        "id": 42,
        "Series_Title": "Léon",
        "Released_Year": "1994",
        "Runtime": "110 min",
        "Genre": "Action, Crime, Drama",
        "IMDB_Rating": "8.5",
        "Overview": "Mathilda, a 12-year-old girl, is reluctantly taken in by Léon, a professional assassin, after her family is murdered. An unusual relationship forms as she becomes his protégée and learns the assassin's trade.",
        "Director": "Luc Besson",
        "Star1": "Jean Reno",
        "Star2": "Gary Oldman",
        "Star3": "Natalie Portman",
        "Star4": "Danny Aiello",
        "Gross": "19,501,238",
        "Synopsis": "The Professional** is a 1994 action-thriller film directed by Luc Besson. The story unfolds in New York City, centering around Léon, a professional hitman, and Mathilda, a 12-year-old girl. Léon is a solitary and efficient assassin who works for a mafioso named Tony.\n\nThe narrative begins when Mathilda’s dysfunctional family is brutally murdered by corrupt DEA agents led by the unhinged Norman Stansfield. Unbeknownst to the killers, Mathilda was not at home during the attack. Seeking refuge, Mathilda knocks on Léon’s door, begging for help. Initially reluctant, Léon allows her to stay.\n\nAs they live together, Mathilda persuades Léon to teach her the skills of his trade, yearning for revenge against Stansfield. A unique bond forms between them, with Mathilda rekindling Léon’s humanity while she herself learns about survival and vengeance.\n\nAs Mathilda becomes proficient in Léon's techniques, she attempts a bold mission to kill Stansfield but is captured. Stansfield, now aware of the connection between Mathilda and Léon, plots to eliminate them. In a dramatic and intense climax, Léon orchestrates a daring rescue, but with lethal retaliation from Stansfield and his men.\n\nThe film crescendos as Léon devises an escape for Mathilda, sacrificing himself in a final confrontation with Stansfield. Before he dies, Léon manages to take down Stansfield, fulfilling Mathilda’s quest for justice.\n\nThe film concludes with Mathilda starting a new life, using the lessons and wisdom imparted by Léon, symbolized by replanting his cherished potted plant, as a tribute to her protector and friend."
    },
    {
        "id": 43,
        "Series_Title": "The Lion King",
        "Released_Year": "1994",
        "Runtime": "88 min",
        "Genre": "Animation, Adventure, Drama",
        "IMDB_Rating": "8.5",
        "Overview": "Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself.",
        "Director": "Roger Allers",
        "Star1": "Rob Minkoff",
        "Star2": "Matthew Broderick",
        "Star3": "Jeremy Irons",
        "Star4": "James Earl Jones",
        "Gross": "422,783,777",
        "Synopsis": "In the African savanna, King Mufasa rules over the animal kingdom from Pride Rock with wisdom and strength. His young son, Simba, is eager to follow in his father’s footsteps, but his uncle Scar harbors dark ambitions for the throne. Scar plots with a pack of hyenas to kill Mufasa and Simba, leading to a tragic stampede where Mufasa dies while rescuing his son.\n\nConvinced by Scar that he is responsible for his father's death, Simba flees into exile. In the jungle, he befriends the carefree meerkat Timon and warthog Pumbaa, learning to live by the motto \"Hakuna Matata.\" Years later, a grown Simba is confronted by his childhood friend Nala, who tells him of Scar's tyrannical rule over the Pride Lands, now turned barren and desolate.\n\nSimba musters the courage to return home, challenged by memories of his past. With the guidance of the wise mandrill Rafiki and a vision of Mufasa’s spirit, Simba understands his true identity and destiny. He returns to Pride Rock, confronting Scar. In a fierce battle, the truth of Mufasa's death is revealed. Simba overcomes Scar, who is defeated by the hyenas he once betrayed.\n\nWith Scar gone, Simba takes his rightful place as king, restoring the Pride Lands to its former glory. The circle of life continues as he and Nala welcome their own cub, ensuring the legacy of the lion king."
    },
    {
        "id": 44,
        "Series_Title": "Terminator 2: Judgment Day",
        "Released_Year": "1991",
        "Runtime": "137 min",
        "Genre": "Action, Sci-Fi",
        "IMDB_Rating": "8.5",
        "Overview": "A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her teenage son, John Connor, from a more advanced and powerful cyborg.",
        "Director": "James Cameron",
        "Star1": "Arnold Schwarzenegger",
        "Star2": "Linda Hamilton",
        "Star3": "Edward Furlong",
        "Star4": "Robert Patrick",
        "Gross": "204,843,350",
        "Synopsis": "In \"Terminator 2: Judgment Day,\" set approximately a decade after the events of the first film, John Connor, the future leader of the human resistance against machines, is living in foster care in Los Angeles. A new and more advanced Terminator, the T-1000, made of a liquid metal alloy, is sent back in time to kill him. It can shapeshift and mimic anything it touches, making it a formidable and nearly indestructible assassin.\n\nSimultaneously, the future John Connor also sends back a protector for his younger self—a reprogrammed T-800 Terminator, identical to the one that once tried to kill Sarah Connor, John's mother. Sarah has been institutionalized due to her extreme warnings about the impending apocalypse brought on by the machines. \n\nThe T-800 locates John and rescues him from the T-1000's relentless pursuit. Initially distrustful, John eventually bonds with the T-800, and together they embark on a mission to save Sarah from the psychiatric facility. After a tense escape, the trio decides to prevent Judgment Day—an event where Skynet, an artificial intelligence defense network, becomes self-aware and triggers nuclear annihilation.\n\nRealizing that key components of Skynet's development are linked to a company called Cyberdyne Systems, they plan to destroy its research and the advanced microprocessor salvaged from the first Terminator. The group breaks into Cyberdyne and rigs the facility with explosives. A massive police standoff ensues, with the T-1000 in pursuit.\n\nIn the climactic showdown, they escape to a steel mill where a final battle between the T-800 and the T-1000 occurs. The T-800, despite sustaining severe damage, manages to destroy the T-1000 by pushing it into a vat of molten steel. To ensure no trace of the future technology remains, the T-800 also sacrifices itself, leaving John and Sarah to face an uncertain future, but with the hope that they might have prevented Judgment Day."
    },
    {
        "id": 45,
        "Series_Title": "Cinema Paradiso",
        "Released_Year": "1988",
        "Runtime": "155 min",
        "Genre": "Drama, Romance",
        "IMDB_Rating": "8.5",
        "Overview": "A filmmaker recalls his childhood when falling in love with the pictures at the cinema of his home village and forms a deep friendship with the cinema's projectionist.",
        "Director": "Giuseppe Tornatore",
        "Star1": "Philippe Noiret",
        "Star2": "Enzo Cannavale",
        "Star3": "Antonella Attili",
        "Star4": "Isa Danieli",
        "Gross": "11,990,401",
        "Synopsis": "\"Cinema Paradiso\" is a heartfelt Italian drama that unfolds through the life of Salvatore \"Toto\" Di Vita, a successful film director, who recalls his childhood when he returns to his Sicilian hometown after learning about the death of his beloved mentor, Alfredo.\n\nAs a boy, Toto is enchanted by the movies shown at the local cinema, the Cinema Paradiso. Alfredo, the projectionist, becomes a father figure to him, teaching him about films and life. Despite his mother's disapproval, Toto spends most of his time at the cinema, learning the intricacies of film projection and developing a deep passion for storytelling.\n\nTheir bond strengthens as they share moments of joy and sorrow, especially when Alfredo becomes blind after a tragic fire in the cinema. Toto steps in to help, and eventually, Alfredo convinces him to leave the small town to pursue a brighter future, urging him never to return if he wants to succeed.\n\nYears later, Toto has become a renowned filmmaker, but Alfredo’s lessons and the love for cinema still echo in his life. During his return for Alfredo's funeral, Toto reflects on the passage of time, lost love, and the captivating magic of cinema that defined his youth. He discovers a reel Alfredo left for him, containing spliced-together snippets of romantic scenes censored by the local priest—a testament to Alfredo’s belief in the beauty of cinema and a touching reminder of their unique bond. \n\n\"Cinema Paradiso\" is a nostalgic tribute to the power of films, the influence of mentorship, and the bittersweet nature of growing up and moving on."
    },
    {
        "id": 46,
        "Series_Title": "Grave of the Fireflies",
        "Released_Year": "1988",
        "Runtime": "89 min",
        "Genre": "Animation, Drama, War",
        "IMDB_Rating": "8.5",
        "Overview": "A young boy and his little sister struggle to survive in Japan during World War II.",
        "Director": "Isao Takahata",
        "Star1": "Tsutomu Tatsumi",
        "Star2": "Ayano Shiraishi",
        "Star3": "Akemi Yamaguchi",
        "Star4": "Yoshiko Shinohara",
        "Gross": "",
        "Synopsis": "Set in the final months of World War II, \"Grave of the Fireflies\" follows the harrowing tale of Seita and Setsuko, two siblings struggling to survive in war-torn Japan. After their mother is killed during the firebombing of Kobe, they find temporary refuge with a distant aunt, but her increasing resentment forces them to leave.\n\nSeeking independence, Seita and Setsuko move to an abandoned bomb shelter, where they try to create a semblance of normalcy amidst the desolation. As resources dwindle, Seita resorts to theft to feed Setsuko, who becomes increasingly ill due to malnutrition. The siblings find brief joy through small acts of love, such as catching fireflies to light their dark nights, symbolizing fleeting beauty amidst despair.\n\nDespite Seita’s desperate efforts, Setsuko's condition worsens. Tragically, she succumbs to starvation. Left to fend for himself, Seita soon follows, succumbing to the harsh realities of a forgotten war survivor. The film ends with the spirits of Seita and Setsuko together, finally at peace, as they overlook the modern world that has moved on from the devastation. The story is a poignant reflection on the human cost of war and the innocence lost amidst its horrors."
    },
    {
        "id": 47,
        "Series_Title": "Back to the Future",
        "Released_Year": "1985",
        "Runtime": "116 min",
        "Genre": "Adventure, Comedy, Sci-Fi",
        "IMDB_Rating": "8.5",
        "Overview": "Marty McFly, a 17-year-old high school student, is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his close friend, the eccentric scientist Doc Brown.",
        "Director": "Robert Zemeckis",
        "Star1": "Michael J. Fox",
        "Star2": "Christopher Lloyd",
        "Star3": "Lea Thompson",
        "Star4": "Crispin Glover",
        "Gross": "210,609,762",
        "Synopsis": "Marty McFly, a teenage high school student, is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his eccentric scientist friend, Dr. Emmett \"Doc\" Brown. The story begins in 1985, where Marty lives an ordinary life with his ineffective father, George, and alcoholic mother, Lorraine. Doc reveals his time machine invention during an experiment, but things go awry when Marty is forced to flee from Libyan terrorists who pursue Doc for stealing their plutonium, which powers the time machine.\n\nMarty inadvertently travels back to 1955, a time when his parents were teenagers. Stranded without a power source to return to his own time, Marty seeks out the younger Doc Brown for assistance. He encounters his parents at their high school and inadvertently interferes with their first meeting, causing his future mother, Lorraine, to fall for him instead.\n\nIn an attempt to repair the timeline, Marty must ensure his parents meet and fall in love. He faces numerous challenges, including dealing with the school bully, Biff Tannen, and trying to fit into a time long before his own. With the clock ticking, Marty and Doc devise a plan to harness the power of a lightning strike to fuel the DeLorean's return to 1985.\n\nUltimately, Marty manages to set things right by orchestrating his parents' dance, ensuring their future together. As Marty returns to 1985, he finds his family's fortunes have improved due to his influence in the past. However, his relief is short-lived when Doc suddenly appears, urging him to accompany him to the future, setting the stage for further adventures."
    },
    {
        "id": 48,
        "Series_Title": "Once Upon a Time in the West",
        "Released_Year": "1968",
        "Runtime": "165 min",
        "Genre": "Western",
        "IMDB_Rating": "8.5",
        "Overview": "A mysterious stranger with a harmonica joins forces with a notorious desperado to protect a beautiful widow from a ruthless assassin working for the railroad.",
        "Director": "Sergio Leone",
        "Star1": "Henry Fonda",
        "Star2": "Charles Bronson",
        "Star3": "Claudia Cardinale",
        "Star4": "Jason Robards",
        "Gross": "5,321,508",
        "Synopsis": "**Once Upon a Time in the West** is an epic Western film directed by Sergio Leone.\n\nIn the arid landscapes of the American frontier, the ambitious and ruthless railroad tycoon Morton is determined to extend his railroad empire. He employs the assistance of a remorseless hired gun named Frank to coerce and eliminate any obstacles in his path. \n\nFrank’s latest target is the McBain family, who own a key piece of land in the town of Flagstone that has strategic access to water, making it essential for the railway. Frank massacres the family, framing the outlaws Cheyenne and his gang for the crime.\n\nEnter Jill McBain, a former New Orleans prostitute who had married into the McBain family. Arriving from the city, she finds her new family dead and is determined to seek justice. Meanwhile, a mysterious harmonica-playing gunman known only as \"Harmonica\" shows up in town, having his own vendetta against Frank.\n\nAs Harmonica and Cheyenne uncover the truth behind the massacre, they step in to protect Jill and her rights to the land. The film builds towards a climactic showdown where Harmonica seeks revenge and reveals the dark history he shares with Frank.\n\nIn an iconic final duel, Harmonica finally confronts Frank, exposing the past grievances between them. As Frank lies dying, Harmonica places his harmonica in Frank’s mouth, signaling the closure of past wounds.\n\nWith the conflict resolved, Jill sets out to build a new life, aligning with the demands of the burgeoning West. The railroad progresses, symbolizing the inevitable march of time and change."
    },
    {
        "id": 49,
        "Series_Title": "Psycho",
        "Released_Year": "1960",
        "Runtime": "109 min",
        "Genre": "Horror, Mystery, Thriller",
        "IMDB_Rating": "8.5",
        "Overview": "A Phoenix secretary embezzles $40,000 from her employer's client, goes on the run, and checks into a remote motel run by a young man under the domination of his mother.",
        "Director": "Alfred Hitchcock",
        "Star1": "Anthony Perkins",
        "Star2": "Janet Leigh",
        "Star3": "Vera Miles",
        "Star4": "John Gavin",
        "Gross": "32,000,000",
        "Synopsis": "\"Psycho\" is a 1960 thriller directed by Alfred Hitchcock. The film begins with Marion Crane, a secretary in Phoenix, Arizona, who embezzles $40,000 from her employer. Desperate to start a new life, she flees the city and drives toward California. Exhausted from the journey, she decides to stop for the night at the secluded Bates Motel.\n\nThe motel is run by Norman Bates, a shy and peculiar young man who lives with his domineering mother in a Gothic house nearby. During her stay, Marion has a conversation with Norman, learning about his difficult relationship with his mother. That night, while Marion takes a shower, she is brutally murdered by a shadowy figure.\n\nNorman, believing his mother committed the crime, cleans up the scene and disposes of Marion's body and car in a nearby swamp. Meanwhile, Marion's disappearance prompts concern. Her sister Lila and her boyfriend Sam investigate her whereabouts. Private investigator Arbogast is also hired to find her and eventually traces her steps to the Bates Motel.\n\nSuspicious of Norman and his mother, Arbogast probes further but is murdered before uncovering the truth. Lila and Sam take matters into their own hands and visit the motel. Pretending to be a married couple, they search for clues.\n\nThe investigation culminates in a shocking discovery. Lila sneaks into the Bates house, finding Mrs. Bates' mummified corpse. It is revealed that Norman, suffering from a split personality disorder, committed the murders while assuming his mother's identity.\n\nIn the end, Norman is arrested, and the full extent of his psychological torment is uncovered. The film closes with Norman, now fully consumed by his mother’s persona, sitting in a cell, while Marion’s stolen money remains undiscovered in the swamp."
    },
    {
        "id": 50,
        "Series_Title": "Casablanca",
        "Released_Year": "1942",
        "Runtime": "102 min",
        "Genre": "Drama, Romance, War",
        "IMDB_Rating": "8.5",
        "Overview": "A cynical expatriate American cafe owner struggles to decide whether or not to help his former lover and her fugitive husband escape the Nazis in French Morocco.",
        "Director": "Michael Curtiz",
        "Star1": "Humphrey Bogart",
        "Star2": "Ingrid Bergman",
        "Star3": "Paul Henreid",
        "Star4": "Claude Rains",
        "Gross": "1,024,560",
        "Synopsis": "In the midst of World War II, Rick Blaine, an American expatriate, runs a popular nightclub in Casablanca, Morocco. The club attracts a diverse clientele, including French locals, Vichy officials, Axis representatives, and refugees desperate to escape to America. One day, Rick's former lover, Ilsa Lund, walks into the nightclub with her husband, Czech resistance leader Victor Laszlo. \n\nIlsa and Rick's past in Paris is revealed through flashbacks. They were deeply in love, but Ilsa abruptly left Rick when she learned that Victor, who she thought was dead, was actually alive. Now, they need Rick's help to secure letters of transit, which allow safe passage to America, to escape the Nazis closing in on Victor.\n\nRick initially refuses, still hurt by Ilsa's departure, but his love for her and commitment to the greater good ultimately sway him. The film builds to a tense climax at the airport, where Rick makes a selfless decision. He arranges an escape for Ilsa and Victor on a plane to Lisbon, ensuring their safety, while remaining behind to face the consequences of his actions in Casablanca.\n\nThe film ends with Rick walking away with Captain Louis Renault, hinting at a new alliance and friendship. \"Casablanca\" explores themes of love, sacrifice, and moral ambiguity amidst the chaos of war."
    },
    {
        "id": 51,
        "Series_Title": "Modern Times",
        "Released_Year": "1936",
        "Runtime": "87 min",
        "Genre": "Comedy, Drama, Family",
        "IMDB_Rating": "8.5",
        "Overview": "The Tramp struggles to live in modern industrial society with the help of a young homeless woman.",
        "Director": "Charles Chaplin",
        "Star1": "Charles Chaplin",
        "Star2": "Paulette Goddard",
        "Star3": "Henry Bergman",
        "Star4": "Tiny Sandford",
        "Gross": "163,245",
        "Synopsis": "In \"Modern Times,\" Charlie Chaplin's iconic character, the Little Tramp, navigates the challenges and absurdities of industrial society during the Great Depression. The film opens in a factory where the Tramp works on an assembly line, dizzyingly tightening bolts on a conveyor belt. The repetitive, dehumanizing work pushes him to a nervous breakdown, causing chaos and leading to his arrest.\n\nAfter his release, the Tramp unwittingly becomes a protest leader and is jailed again. Meanwhile, he encounters a spirited young woman, a \"Gamine,\" who is struggling to survive on the streets. The two form a bond, dreaming of a better life together.\n\nThe Tramp takes on various jobs to support them, including as a night watchman in a department store and a singing waiter, but misfortune follows them both. Their adventures are marked by humor and resilience in the face of adversity.\n\nThe film culminates with the pair, facing uncertain futures, walking down a deserted road, hand in hand, resolved to keep going no matter what lies ahead. \"Modern Times\" poignantly critiques the mechanization of society and the enduring human spirit."
    },
    {
        "id": 52,
        "Series_Title": "City Lights",
        "Released_Year": "1931",
        "Runtime": "87 min",
        "Genre": "Comedy, Drama, Romance",
        "IMDB_Rating": "8.5",
        "Overview": "With the aid of a wealthy erratic tippler, a dewy-eyed tramp who has fallen in love with a sightless flower girl accumulates money to be able to help her medically.",
        "Director": "Charles Chaplin",
        "Star1": "Charles Chaplin",
        "Star2": "Virginia Cherrill",
        "Star3": "Florence Lee",
        "Star4": "Harry Myers",
        "Gross": "19,181",
        "Synopsis": "\"City Lights,\" a 1931 silent romantic comedy film written, directed by, and starring Charlie Chaplin, follows the story of Chaplin's iconic character, the Tramp. Living a meager life, the Tramp encounters a beautiful, blind Flower Girl on the bustling city streets. Mistakenly believing him to be a wealthy gentleman, she kindly sells him a flower, and he becomes smitten, dedicating himself to helping improve her life.\n\nMeanwhile, the Tramp also forms an unlikely friendship with a Millionaire, whom he saves from a drunken suicide attempt. The wealthy man, inebriated, takes a liking to the Tramp and invites him into his luxurious life, but notably forgets him when sober, leading to comedic misadventures.\n\nOvercome by his affection for the Flower Girl, the Tramp learns of an expensive surgery that could restore her sight. Determined to help her, he takes on a series of jobs, each ending in comedic disaster. His friendship with the Millionaire seems to promise a solution, but it's fraught with misunderstandings and trouble.\n\nAs the Flower Girl and her grandmother face eviction, the Tramp's fortunes turn when the Millionaire, in another drunken state, gives him money for the girl's surgery. However, chaos ensues when the Millionaire sobers up and accuses the Tramp of stealing the money. After a series of chases and a well-intentioned but ill-fated attempt to return to the Millionaire's good graces, the Tramp is arrested.\n\nThe film concludes with the Tramp, recently released from jail, wandering the streets once more. He soon encounters the Flower Girl again, who now works in a flower shop. With her sight restored, she initially does not recognize him but offers him a flower and some coins out of kindness. Through a gentle touch, she realizes who he is and expresses gratitude, leading to an emotional, silent exchange filled with recognition and affection.\n\n\"City Lights\" ends on an ambiguous yet hopeful note, highlighting themes of love, sacrifice, and the power of genuine human connection."
    },
    {
        "id": 53,
        "Series_Title": "Capharnaüm",
        "Released_Year": "2018",
        "Runtime": "126 min",
        "Genre": "Drama",
        "IMDB_Rating": "8.4",
        "Overview": "While serving a five-year sentence for a violent crime, a 12-year-old boy sues his parents for neglect.",
        "Director": "Nadine Labaki",
        "Star1": "Zain Al Rafeea",
        "Star2": "Yordanos Shiferaw",
        "Star3": "Boluwatife Treasure Bankole",
        "Star4": "Kawsar Al Haddad",
        "Gross": "1,661,096",
        "Synopsis": "**Capharnaüm** is a Lebanese drama film directed by Nadine Labaki. The film follows the harrowing journey of Zain, a 12-year-old boy living in the slums of Beirut, as he sues his parents for neglect and bringing him into a world of poverty and suffering.\n\nZain is a resourceful and sharp-witted boy burdened by the responsibilities of caring for his siblings, as his parents are overwhelmed and often neglectful. The family's dire circumstances force Zain to drop out of school and work odd jobs to make ends meet. Despite his tough exterior, Zain has a tender relationship with his younger sister, Sahar. When Sahar is married off to an older man, Zain is devastated and runs away from home.\n\nDuring his escape, Zain befriends Rahil, an undocumented Ethiopian migrant worker, and her infant son, Yonas. Zain and Rahil form a makeshift family, living together in a ramshackle shelter as they try to survive the harsh realities of life in the streets. Zain looks after Yonas with great care, displaying a maturity beyond his years.\n\nThe film starkly portrays the cycle of poverty and the struggle for survival faced by children in such environments. Zain's situation spirals further when Rahil is arrested, leaving him to fend for himself and the baby. Desperate for justice and a sense of control, Zain decides to sue his parents for giving him life in such cruel conditions.\n\nThe narrative unfolds in flashbacks from the courtroom where Zain makes his case. His testimony is both heart-wrenching and brutally honest, exposing the systemic failures and indifference faced by many children. Through Zain’s eyes, the film paints a broader picture of social injustice, child exploitation, and the resilience of the human spirit.\n\n\"Capharnaüm\" highlights Zain's incredible strength and the glimpses of hope that persist amid immense hardships, leaving a profound impact on the audience."
    },
    {
        "id": 54,
        "Series_Title": "Ayla: The Daughter of War",
        "Released_Year": "2017",
        "Runtime": "125 min",
        "Genre": "Biography, Drama, History",
        "IMDB_Rating": "8.4",
        "Overview": "In 1950, amid-st the ravages of the Korean War, Sergeant Süleyman stumbles upon a half-frozen little girl, with no parents and no help in sight. Frantic, scared and on the verge of death, ...                See full summary »",
        "Director": "Can Ulkay",
        "Star1": "Erdem Can",
        "Star2": "Çetin Tekindor",
        "Star3": "Ismail Hacioglu",
        "Star4": "Kyung-jin Lee",
        "Gross": "",
        "Synopsis": "Set during the Korean War in 1950, \"Ayla: The Daughter of War\" tells the heartwarming and emotional story of Süleyman Dilbirliği, a Turkish sergeant, who encounters a young Korean girl, Ayla, amidst the chaos of war. Displaced and orphaned, Ayla is found by Süleyman alone and frightened in the cold night.\n\nMoved by her plight, Süleyman takes responsibility for Ayla, smuggling her into his military base and raising her as his own. Despite language barriers, a deep bond forms between them, and she becomes a cherished part of the Turkish brigade. They form a makeshift family, offering each other solace and happiness during harrowing times.\n\nAs the war progresses, political and military circumstances threaten to separate them. Efforts to find a way to prevent their separation are met with bureaucratic challenges. With his term in Korea coming to an end, Süleyman faces the heartbreaking reality of leaving Ayla behind or risking everything to take her home.\n\nThe film poignantly explores themes of love, family, and humanity amidst the backdrop of war, leading to a climax that tests their bond and resilience. Inspired by true events, it showcases the enduring power of connection across cultures and the enduring hope of reunion."
    },
    {
        "id": 55,
        "Series_Title": "Vikram Vedha",
        "Released_Year": "2017",
        "Runtime": "147 min",
        "Genre": "Action, Crime, Drama",
        "IMDB_Rating": "8.4",
        "Overview": "Vikram, a no-nonsense police officer, accompanied by Simon, his partner, is on the hunt to capture Vedha, a smuggler and a murderer. Vedha tries to change Vikram's life, which leads to a conflict.",
        "Director": "Gayatri",
        "Star1": "Pushkar",
        "Star2": "Madhavan",
        "Star3": "Vijay Sethupathi",
        "Star4": "Shraddha Srinath",
        "Gross": "",
        "Synopsis": "**Vikram Vedha** is a gripping action-thriller centered around a riveting cat-and-mouse game between an honest cop and a cunning gangster.   \n\nThe film follows Vikram, a righteous police officer known for his integrity and dedication to upholding the law. He works alongside his close-knit team, which includes his trusted partner Simon. Vikram is determined to eradicate crime in the city and sets his sights on the notorious gangster, Vedha, who has eluded the law for years.  \n\nAs Vikram and his team close in, Vedha, played by a charismatic and formidable figure, voluntarily surrenders. This unexpected move sets the stage for a series of intense confrontations between the two. Vedha starts narrating his life story to Vikram, intertwining it with moral dilemmas and challenging the black-and-white notions of right and wrong that Vikram believes in.  \n\nThroughout their encounters, Vedha tells three stories, each symbolizing critical junctures in his life, forcing Vikram to reevaluate his own principles and the complexities of justice. As the lines blur between the hunter and the hunted, Vikram's pursuit becomes more personal and introspective.  \n\nSimultaneously, Simon is working on a side-investigation that uncovers a web of corruption within their own ranks, further complicating the narrative and raising the stakes for Vikram.  \n\nThe film builds to a climactic face-off, where Vikram must confront the reality of his choices and the true nature of justice. The villain's clever manipulation makes Vikram question everything he stands for, revealing that good and evil are not as clear-cut as they seem.  \n\nIn the end, Vikram is left with moral ambiguities and a greater understanding of the dualities of human nature, forever changed by his encounter with Vedha."
    },
    {
        "id": 56,
        "Series_Title": "Your Name.",
        "Released_Year": "2016",
        "Runtime": "106 min",
        "Genre": "Animation, Drama, Fantasy",
        "IMDB_Rating": "8.4",
        "Overview": "Two strangers find themselves linked in a bizarre way. When a connection forms, will distance be the only thing to keep them apart?",
        "Director": "Makoto Shinkai",
        "Star1": "Ryûnosuke Kamiki",
        "Star2": "Mone Kamishiraishi",
        "Star3": "Ryô Narita",
        "Star4": "Aoi Yûki",
        "Gross": "5,017,246",
        "Synopsis": "\"Your Name.\" is a Japanese animated film directed by Makoto Shinkai. The story revolves around two high school students, Taki Tachibana and Mitsuha Miyamizu, who live in different parts of Japan and mysteriously begin to swap bodies intermittently.\n\nMitsuha is a girl from a small rural town called Itomori, and she dreams of living in the bustling city of Tokyo. Taki, on the other hand, is a boy living in Tokyo who juggles his time between school, a part-time job, and his friends. As they swap bodies unpredictably, they start communicating by leaving notes and messages on each other’s phones and paper.\n\nInitially bewildered by the body-swapping, they gradually begin to learn more about each other's lives, forming a strong connection. Mitsuha experiences the vibrant city life, while Taki gains insight into the charming, traditional lifestyle of Itomori. As they support each other through their personal struggles and desires, they form a deep bond.\n\nHowever, an unexpected revelation occurs. Taki learns that a catastrophic comet event destroyed Itomori three years prior, suggesting that they are separated not only by distance but also by time. Determined to save Mitsuha and the townspeople, Taki embarks on a journey to Itomori, hoping to prevent the disaster.\n\nUsing the fleeting connection provided by their body swaps, Taki and Mitsuha work together to warn the town, convincing the residents to evacuate before disaster strikes. The emotional climax involves their efforts to meet in person and rewrite fate.\n\nIn the film's poignant conclusion, years pass, and both Taki and Mitsuha retain only vague memories of their experiences but feel an inexplicable longing. In Tokyo, as they catch glimpses of each other in the city, destiny leads them to a fateful encounter. On a set of stairs, they finally meet face to face, compelled to ask for each other's name, signaling the beginning of a new connection."
    },
    {
        "id": 57,
        "Series_Title": "Dangal",
        "Released_Year": "2016",
        "Runtime": "161 min",
        "Genre": "Action, Biography, Drama",
        "IMDB_Rating": "8.4",
        "Overview": "Former wrestler Mahavir Singh Phogat and his two wrestler daughters struggle towards glory at the Commonwealth Games in the face of societal oppression.",
        "Director": "Nitesh Tiwari",
        "Star1": "Aamir Khan",
        "Star2": "Sakshi Tanwar",
        "Star3": "Fatima Sana Shaikh",
        "Star4": "Sanya Malhotra",
        "Gross": "12,391,761",
        "Synopsis": "\"Dangal\" follows the inspiring true story of Mahavir Singh Phogat, a former national wrestling champion who harbors unfulfilled dreams of winning a gold medal for India. Living in the small village of Balali in Haryana, Mahavir is forced to abandon his wrestling career due to financial constraints, but he dreams of grooming a son to achieve the glory he could not.\n\nDisappointed by the birth of four daughters and pressured by societal norms, Mahavir's hopes seem dashed until he recognizes the potential in his two eldest daughters, Geeta and Babita, after they fiercely fight some boys in the village. Ignoring societal criticism and traditional gender roles, Mahavir begins rigorous training for Geeta and Babita, instilling in them the discipline and skills required for wrestling. Despite initial reluctance and societal obstacles, the sisters develop a passion for the sport.\n\nAs the girls grow, they start competing in state and national level competitions, facing challenges both within their family and from opponents and officials who doubt their capabilities due to their gender. Geeta, in particular, rises to prominence but finds herself at odds with her father's methods as she trains at the National Sports Academy. This leads to a personal and professional rift between them.\n\nThe story culminates at the 2010 Commonwealth Games, where Geeta advances to the finals. Guided by her father's teachings and her newfound experience, Geeta wrestles for the gold medal, a moment that symbolizes the broader struggle for gender equality and dreams coming to fruition against all odds.\n\n\"Dangal\" not only illustrates a gripping sports journey but also highlights themes of perseverance, empowerment, and the breaking of social barriers, ultimately showing how determination, family support, and unwavering belief can lead to extraordinary achievements."
    },
    {
        "id": 58,
        "Series_Title": "Spider-Man: Into the Spider-Verse",
        "Released_Year": "2018",
        "Runtime": "117 min",
        "Genre": "Animation, Action, Adventure",
        "IMDB_Rating": "8.4",
        "Overview": "Teen Miles Morales becomes the Spider-Man of his universe, and must join with five spider-powered individuals from other dimensions to stop a threat for all realities.",
        "Director": "Bob Persichetti",
        "Star1": "Peter Ramsey",
        "Star2": "Rodney Rothman",
        "Star3": "Shameik Moore",
        "Star4": "Jake Johnson",
        "Gross": "190,241,310",
        "Synopsis": "In \"Spider-Man: Into the Spider-Verse,\" teenager Miles Morales struggles with the pressures of a new private school and difficulty connecting with his father. His life takes a dramatic turn when he is bitten by a radioactive spider in a subway and gains spider-like abilities. During his exploration of his newfound powers, Miles witnesses a battle between Spider-Man and the villain Kingpin, who is attempting to access parallel universes with a super-collider.\n\nIn the ensuing chaos, Spider-Man is fatally wounded, but not before he entrusts Miles with the task of disabling the collider. Overwhelmed by the responsibility, Miles meets Peter B. Parker, a disheveled and older version of Spider-Man from another universe, who reluctantly becomes his mentor.\n\nAs the collider’s dimensions intersect, they encounter other Spider-People: Gwen Stacy (Spider-Woman), Spider-Man Noir, Peni Parker and her robotic companion SP//dr, and the cartoonish Spider-Ham. This diverse group of spider-heroes unite to stop Kingpin and return to their respective dimensions.\n\nMiles, unsure of himself and his abilities, faces internal conflict and doubts. However, with encouragement and guidance from his new allies, he learns to embrace his own unique identity as Spider-Man. He develops his own style and overcomes his fears to confront Kingpin and his allies.\n\nIn a climactic showdown at the collider, Miles uses his newfound skills and ingenuity to help each Spider-Person return home. He finally faces Kingpin, triumphing with cleverness and bravery, stopping the collider from destroying reality.\n\nIn the aftermath, Miles embraces his role as his universe's Spider-Man, confident in his abilities and committed to continuing the legacy of his mentor. The film closes with the other Spider-People back in their own dimensions, hinting at their continued connection and the potential for future adventures across the Spider-Verse."
    },
    {
        "id": 59,
        "Series_Title": "Avengers: Endgame",
        "Released_Year": "2019",
        "Runtime": "181 min",
        "Genre": "Action, Adventure, Drama",
        "IMDB_Rating": "8.4",
        "Overview": "After the devastating events of Avengers: Infinity War (2018), the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to reverse Thanos' actions and restore balance to the universe.",
        "Director": "Anthony Russo",
        "Star1": "Joe Russo",
        "Star2": "Robert Downey Jr.",
        "Star3": "Chris Evans",
        "Star4": "Mark Ruffalo",
        "Gross": "858,373,000",
        "Synopsis": "After the devastating events of \"Avengers: Infinity War,\" the universe is in ruins due to the actions of Thanos, who used the Infinity Stones to wipe out half of all life. In \"Avengers: Endgame,\" the remaining Avengers are struggling to cope with the loss. When they receive a signal from Scott Lang, trapped in the quantum realm, they devise a plan to undo Thanos' actions by traveling back in time to collect the Infinity Stones before Thanos can.\n\nThe Avengers are divided into teams and sent to pivotal moments in the timeline to retrieve the Stones. Meanwhile, Thanos becomes aware of their plan and sets out to prevent them. The team faces challenges, including confronting past selves and unforeseen difficulties, but eventually reassembles the Stones for a new gauntlet.\n\nTony Stark, in an act of sacrifice, uses the Stones to defeat Thanos and his army, restoring everyone to life who had been snapped away. However, wielding the immense power kills him. The film concludes with the Avengers mourning Tony’s loss, returning the Stones to their respective timelines, and passing the torch to new heroes. An aging Steve Rogers decides to stay in the past with Peggy Carter, entrusting his shield to Sam Wilson. The film closes a chapter on the original Avengers, laying the groundwork for new beginnings."
    },
    {
        "id": 60,
        "Series_Title": "Avengers: Infinity War",
        "Released_Year": "2018",
        "Runtime": "149 min",
        "Genre": "Action, Adventure, Sci-Fi",
        "IMDB_Rating": "8.4",
        "Overview": "The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe.",
        "Director": "Anthony Russo",
        "Star1": "Joe Russo",
        "Star2": "Robert Downey Jr.",
        "Star3": "Chris Hemsworth",
        "Star4": "Mark Ruffalo",
        "Gross": "678,815,482",
        "Synopsis": "The film opens with the aftermath of Thanos' attack on the Asgardian ship, where he defeats Thor and Hulk, and kills Loki while acquiring the Space Stone. The Hulk is sent to Earth and crashes into the New York Sanctum, warning Doctor Strange and Wong about Thanos’ impending arrival. They enlist Tony Stark's help, and soon after, Thanos' children, known as the Black Order, attack.\n\nIn Scotland, the Black Order ambushes Vision and Wanda Maximoff in an attempt to retrieve the Mind Stone from Vision's forehead. Steve Rogers, Natasha Romanoff, and Sam Wilson intervene, saving them. They take refuge with James Rhodes at the Avengers facility, deciding to go to Wakanda, where they hope to remove the Mind Stone without killing Vision.\n\nMeanwhile, in space, the Guardians of the Galaxy, responding to a distress signal, save Thor, who informs them about Thanos’ plan to acquire all six Infinity Stones. Thor, Rocket, and Groot head to Nidavellir to create a weapon capable of killing Thanos, while the others go to Knowhere to secure the Reality Stone. However, Thanos has already taken the stone and captures Gamora.\n\nThanos reveals his plan to Gamora, explaining he seeks to \"balance\" the universe by eradicating half of all life. He demands Gamora reveal the Soul Stone's location, threatening Nebula's life. Reluctantly, Gamora leads him to Vormir, where the Stone’s keeper, Red Skull, reveals Thanos must sacrifice someone he loves to obtain it. Thanos heart-wrenchingly sacrifices Gamora, securing the Soul Stone.\n\nBack on Earth, the heroes prepare for battle when Thanos’ army arrives in Wakanda. Meanwhile, Iron Man, Spider-Man, Doctor Strange, and half of the Guardians confront Thanos on his home planet, Titan. Despite their efforts and a significant struggle, they fail to stop Thanos, and he acquires the Time Stone from Doctor Strange.\n\nIn Wakanda, a massive battle rages as Thanos arrives to claim the final Mind Stone. Despite a combined effort from all the heroes, Thanos effortlessly overpowers them. Vision pleads with Wanda to destroy the Stone, which she does, but Thanos reverses time using the Time Stone, revives Vision, and tears the Mind Stone from his head.\n\nWith all six Stones, Thanos snaps his fingers in an event now known as \"The Blip,\" erasing half of all life across the universe. Many of the Avengers and their allies disintegrate to dust, leaving the survivors in shock and despair.\n\nThor, having arrived too late to stop the snap with his new weapon, watches helplessly as Thanos retires to a distant planet. The film ends with the haunting image of Thanos, seemingly content, watching a sunset, while those left behind mourn the great loss.\n\nThe credits feature a post-credits scene of Nick Fury sending a distress call before he, too, turns to dust, with a glimpse of Captain Marvel's emblem on a device he activates."
    },
    {
        "id": 61,
        "Series_Title": "Coco",
        "Released_Year": "2017",
        "Runtime": "105 min",
        "Genre": "Animation, Adventure, Family",
        "IMDB_Rating": "8.4",
        "Overview": "Aspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer.",
        "Director": "Lee Unkrich",
        "Star1": "Adrian Molina",
        "Star2": "Anthony Gonzalez",
        "Star3": "Gael García Bernal",
        "Star4": "Benjamin Bratt",
        "Gross": "209,726,015",
        "Synopsis": "In the vibrant town of Santa Cecilia, Mexico, young Miguel Rivera dreams of becoming a famous musician like his idol, the late Ernesto de la Cruz. However, his family has banned music for generations, ever since Miguel's great-great-grandfather abandoned his wife, Imelda, to pursue a music career. Despite this, Miguel secretly idolizes de la Cruz and practices guitar in a hidden space.\n\nAs the Día de los Muertos (Day of the Dead) festival approaches, Miguel accidentally damages a framed photo of Imelda on the family ofrenda. Behind the photo, he discovers a torn image of his great-great-grandfather holding Ernesto's famous guitar, leading him to believe Ernesto is his ancestor.\n\nDesperate to prove his musical talent, Miguel sneaks into Ernesto's mausoleum and borrows his guitar. Upon strumming it, he becomes invisible to the living, crossing into the vibrant Land of the Dead. In this fantastical realm, he meets his deceased family members, who are shocked to see a living boy.\n\nImelda discovers Miguel’s presence and demands he return to the living world on one condition: he must give up music. Miguel refuses and decides to seek Ernesto, believing he is the key to returning home and lifting the music ban.\n\nMiguel meets Héctor, a charming trickster who is desperate to visit his daughter in the living world before she forgets him, which would condemn him to “the Final Death.” Héctor agrees to help Miguel find Ernesto in exchange for placing his photo on the ofrenda.\n\nTogether, Miguel and Héctor face challenges and uncover truths as they pursue Ernesto. Miguel eventually finds de la Cruz, who initially welcomes him. However, Miguel soon discovers that Ernesto poisoned Héctor to steal his songs and rise to fame. Outraged, Ernesto throws Miguel and Héctor into a pit, but they escape with the help of Dante, Miguel’s stray dog companion.\n\nImelda tracks down Miguel, and after an emotional reconciliation, the family bands together to confront Ernesto. They reveal Hector's true legacy to the citizens of the Land of the Dead, exposing Ernesto’s betrayal.\n\nWith time running out, Miguel races back to the living world with Héctor’s photo. He returns just before dawn, restoring the photo on the ofrenda and saving Héctor from being forgotten. Miguel plays music for his ailing great-grandmother, Coco, who is Héctor’s daughter. This stirs her memories, reviving her connection to her father.\n\nA year later, music is once again part of the Rivera family, as Miguel and his relatives honor their ancestors during Día de los Muertos. Héctor, now remembered, reunites with Imelda, and together, they visit their loved ones, ensuring their stories live on."
    },
    {
        "id": 62,
        "Series_Title": "Django Unchained",
        "Released_Year": "2012",
        "Runtime": "165 min",
        "Genre": "Drama, Western",
        "IMDB_Rating": "8.4",
        "Overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
        "Director": "Quentin Tarantino",
        "Star1": "Jamie Foxx",
        "Star2": "Christoph Waltz",
        "Star3": "Leonardo DiCaprio",
        "Star4": "Kerry Washington",
        "Gross": "162,805,434",
        "Synopsis": "**Django Unchained** is a revisionist Western film set in the antebellum American South. It follows Django, a slave who is freed by Dr. King Schultz, a German bounty hunter masquerading as a traveling dentist. Schultz is on the trail of the ruthless Brittle Brothers, and he needs Django, who has seen them before, to help identify them.\n\nThe two form an unlikely partnership, with Schultz offering Django his freedom in exchange for his assistance. Django proves to be a quick learner and the pair become successful partners. Django reveals that his ultimate goal is to find and rescue his wife, Broomhilda, who was sold into slavery.\n\nTheir search leads them to \"Candyland,\" a notorious plantation owned by Calvin Candie, a brutal and flamboyant slave owner. Schultz, posing as a wealthy buyer interested in purchasing one of Candie's slave fighters, gains entry to the estate. They discover Broomhilda is indeed there, serving as a household slave.\n\nTheir plan to rescue her involves deception and careful negotiation, but things go awry when Candie's loyal house slave, Stephen, becomes suspicious. Suspense builds as Schultz and Django confront the sinister environment of Candyland.\n\nTensions explode into a violent confrontation, resulting in Schultz and Candie's deaths. Django is captured but manages to escape through his wit and sheer determination. He returns to Candyland, frees Broomhilda, and exacts revenge on their oppressors with a final explosive showdown.\n\nThe film concludes with Django and Broomhilda riding off together, free at last, against the backdrop of a burning plantation. Django Unchained is a tale of revenge, resilience, and the unbreakable spirit of a man fighting to reclaim his freedom and his love."
    },
    {
        "id": 63,
        "Series_Title": "The Dark Knight Rises",
        "Released_Year": "2012",
        "Runtime": "164 min",
        "Genre": "Action, Adventure",
        "IMDB_Rating": "8.4",
        "Overview": "Eight years after the Joker's reign of anarchy, Batman, with the help of the enigmatic Catwoman, is forced from his exile to save Gotham City from the brutal guerrilla terrorist Bane.",
        "Director": "Christopher Nolan",
        "Star1": "Christian Bale",
        "Star2": "Tom Hardy",
        "Star3": "Anne Hathaway",
        "Star4": "Gary Oldman",
        "Gross": "448,139,099",
        "Synopsis": "**The Dark Knight Rises** is the epic conclusion to Christopher Nolan's Batman trilogy. Set eight years after the events of *The Dark Knight*, Gotham City is enjoying a period of peace. Harvey Dent is celebrated as a hero, and the Dent Act, inspired by his legacy, has nearly eradicated organized crime. However, this peace is built on a lie, as Batman took the fall for Dent’s crimes to preserve his image.\n\nBruce Wayne has become a reclusive figure, haunted by the death of Rachel Dawes and the downfall of his alter ego. However, a new threat emerges in the form of Bane, a physically formidable terrorist leader who plans to fulfill the legacy of Ra’s al Ghul by destroying Gotham. With the help of Selina Kyle, a cunning cat burglar with mysterious motives, Wayne is drawn out of retirement and must don the Bat-suit once more.\n\nAs Bane takes control of Gotham, revealing the truth about Harvey Dent, he plunges the city into chaos and isolation. He cripples Batman and imprisons him in a prison pit designed to crush hope. There, Wayne learns about the true nature of fear and the origins of Bane. \n\nWith a renewed sense of determination, Wayne escapes and returns to Gotham, assembling allies including Selina Kyle and the ever-loyal Commissioner Gordon, as well as police officer John Blake, who has deduced his identity.\n\nIn a final epic showdown, Batman confronts Bane and his army. Talia al Ghul, Ra's al Ghul's daughter, is revealed to be Bane’s true accomplice and mastermind. As she attempts to destroy the city with a nuclear bomb, Batman and his allies race against time to prevent disaster. \n\nIn a heroic act, Batman apparently sacrifices himself by flying the bomb over the bay, allowing it to detonate safely. Gotham is saved, and Bruce Wayne is assumed dead.\n\nThe film concludes with Gotham beginning to rebuild, a statue honoring Batman is unveiled, and Bruce’s legacy preserved. However, Alfred discovers Bruce alive and starting a new life in Europe. Meanwhile, John Blake, inspired by the legend, inherits the Batcave, hinting at the continuation of Batman’s legacy."
    },
    {
        "id": 64,
        "Series_Title": "3 Idiots",
        "Released_Year": "2009",
        "Runtime": "170 min",
        "Genre": "Comedy, Drama",
        "IMDB_Rating": "8.4",
        "Overview": "Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think differently, even as the rest of the world called them \"idiots\".",
        "Director": "Rajkumar Hirani",
        "Star1": "Aamir Khan",
        "Star2": "Madhavan",
        "Star3": "Mona Singh",
        "Star4": "Sharman Joshi",
        "Gross": "6,532,908",
        "Synopsis": "\"3 Idiots\" follows the journey of two friends, Farhan Qureshi and Raju Rastogi, as they search for their long-lost college companion, Rancho. Set in India, the story unfolds through flashbacks to their time at the prestigious Imperial College of Engineering.\n\nRancho, portrayed as an unconventional and brilliant student, challenges the traditional and rigid educational system, often clashing with the authoritative and stern college director, Viru Sahastrabuddhe, known as \"Virus.\" His unorthodox methods and philosophical beliefs about learning inspire his friends, encouraging them to pursue their true passions rather than succumb to societal pressures.\n\nFarhan, an aspiring wildlife photographer, and Raju, who faces immense pressure to lift his family out of poverty, both initially struggle with their futures. Rancho's presence helps them shift their perspectives, fostering courage and self-belief.\n\nThe narrative's present timeline involves a road trip as Farhan and Raju, prompted by a clue from their rival Chatur, track down Rancho. They confront various revelations, including the discovery that their friend has assumed the identity of someone else, leading them to learn Rancho's true background and purpose.\n\nThe film culminates in a reunion that reconciles past misgivings and celebrates the triumph of following one's heart over conforming to expectations. Through humor, emotion, and poignant social commentary, \"3 Idiots\" delivers a timeless message about education, friendship, and the pursuit of happiness."
    },
    {
        "id": 65,
        "Series_Title": "Like Stars on Earth",
        "Released_Year": "2007",
        "Runtime": "165 min",
        "Genre": "Drama, Family",
        "IMDB_Rating": "8.4",
        "Overview": "An eight-year-old boy is thought to be a lazy trouble-maker, until the new art teacher has the patience and compassion to discover the real problem behind his struggles in school.",
        "Director": "Aamir Khan",
        "Star1": "Amole Gupte",
        "Star2": "Darsheel Safary",
        "Star3": "Aamir Khan",
        "Star4": "Tisca Chopra",
        "Gross": "1,223,869",
        "Synopsis": "\"Like Stars on Earth\" is an Indian drama film that centers around an eight-year-old boy named Ishaan Awasthi, played by Darsheel Safary. Ishaan is a free-spirited child with a vivid imagination, fascinated by the world around him. However, he struggles with academics, specifically with reading and writing, much to the frustration of his parents and teachers who label him as lazy and inattentive.\n\nIshaan's elder brother is an exemplary student, and their parents constantly compare the two, causing Ishaan to feel isolated and misunderstood. His struggles reach a tipping point when his father decides to send him to a boarding school, hoping that strict discipline will remedy his perceived shortcomings.\n\nAt the boarding school, Ishaan becomes withdrawn and despondent, losing interest in his surroundings. It's not until the arrival of a new art teacher, Ram Shankar Nikumbh (played by Aamir Khan), that things begin to change. Unlike other teachers, Nikumbh recognizes the signs of dyslexia in Ishaan and empathizes with him, having struggled with similar issues himself as a child.\n\nNikumbh takes a unique, empathetic approach, nurturing Ishaan's artistic talent and building his confidence. He explains to the other faculty members and Ishaan's parents that Ishaan's difficulties are not due to laziness, but rather a learning disability that requires understanding and support.\n\nThrough personalized attention and unconventional teaching methods, Nikumbh helps Ishaan overcome his academic challenges and flourish. Ishaan begins to thrive, finding joy and self-worth through art, and gaining the approval of both his parents and teachers.\n\nThe film concludes with Ishaan winning an art competition judged by Mr. Nikumbh, highlighting his transformation and newfound confidence. \"Like Stars on Earth\" poignantly draws attention to the often overlooked struggles of children with learning disabilities and the profound impact that empathy and understanding can have on their lives."
    },
    {
        "id": 66,
        "Series_Title": "WALL·E",
        "Released_Year": "2008",
        "Runtime": "98 min",
        "Genre": "Animation, Adventure, Family",
        "IMDB_Rating": "8.4",
        "Overview": "In the distant future, a small waste-collecting robot inadvertently embarks on a space journey that will ultimately decide the fate of mankind.",
        "Director": "Andrew Stanton",
        "Star1": "Ben Burtt",
        "Star2": "Elissa Knight",
        "Star3": "Jeff Garlin",
        "Star4": "Fred Willard",
        "Gross": "223,808,164",
        "Synopsis": "In the distant future, Earth has become an uninhabitable wasteland covered in trash, forcing humanity to evacuate and live aboard massive starliners in space. The story centers around WALL·E (Waste Allocation Load Lifter: Earth-Class), a lonely and curious trash compactor robot left behind to clean up the planet. Over the centuries, WALL·E has developed a personality and a sense of wonder, collecting interesting human artifacts and maintaining a love for an old musical.\n\nWALL·E's routine is disrupted when a spaceship arrives and deploys EVE (Extraterrestrial Vegetation Evaluator), a sleek, sophisticated probe sent to scout for plant life on Earth. WALL·E falls in love with EVE and eagerly shows her the plant he discovered, which she stores inside herself as evidence of Earth's potential revival.\n\nEVE is summoned back to the starliner Axiom with WALL·E clinging to her spaceship. On the Axiom, humans have become sedentary and dependent on technology, living in a state of perpetual leisure. Despite initial confusion, WALL·E's actions inspire both EVE and the humans around him to reconsider their lives. Captain McCrea, curious about Earth's history, becomes determined to return humanity to its home planet.\n\nThe revelation of the plant sparks a series of events, culminating in a struggle against the ship's autopilot, designed to prevent humans from returning. With bravery and determination, WALL·E helps EVE and the humans take back control of the Axiom.\n\nThe film concludes with the Axiom returning to Earth, its passengers ready to rebuild civilization and revive the planet. WALL·E is repaired by EVE, and their enduring companionship signifies hope and the potential for a fresh start for humanity."
    },
    {
        "id": 67,
        "Series_Title": "The Lives of Others",
        "Released_Year": "2006",
        "Runtime": "137 min",
        "Genre": "Drama, Mystery, Thriller",
        "IMDB_Rating": "8.4",
        "Overview": "In 1984 East Berlin, an agent of the secret police, conducting surveillance on a writer and his lover, finds himself becoming increasingly absorbed by their lives.",
        "Director": "Florian Henckel von Donnersmarck",
        "Star1": "Ulrich Mühe",
        "Star2": "Martina Gedeck",
        "Star3": "Sebastian Koch",
        "Star4": "Ulrich Tukur",
        "Gross": "11,286,112",
        "Synopsis": "**The Lives of Others** is a gripping German drama set in 1984, depicting the oppressive surveillance state of East Germany. The film follows Stasi officer Gerd Wiesler, who is assigned to spy on playwright Georg Dreyman and his lover, actress Christa-Maria Sieland. As Wiesler monitors their every move, he becomes absorbed in their lives and begins to question his loyalty to the regime.\n\nDreyman appears to be a loyal supporter of the state but is secretly disillusioned, especially after the suicide of a fellow artist who was blacklisted. Driven by guilt and discontent, Dreyman decides to write an exposé on the state's oppressive tactics for a West German magazine, smuggling it out through underground channels.\n\nMeanwhile, Wiesler becomes increasingly sympathetic to Dreyman's cause. Despite being tasked with gathering incriminating evidence, he subtly manipulates his reports to protect Dreyman and Christa-Maria. As the narrative unfolds, Wiesler's internal conflict deepens, and he finds himself making profound personal sacrifices to shield the couple from the Stasi's watchful eye.\n\nThe tension escalates when the Stasi's higher-ups, fueled by a personal vendetta against Dreyman, close in on the writer and his circle. Caught between his sworn duty and his conscience, Wiesler faces a life-altering decision that could either save or destroy the lives of those he's grown to care for.\n\nAs the Berlin Wall falls and East Germany collapses, the repercussions of Wiesler's choices resonate, revealing unlikely acts of heroism and unexpected redemption. \"The Lives of Others\" is a poignant exploration of humanity, integrity, and the power of personal transformation amidst the shadows of a surveillance state."
    },
    {
        "id": 68,
        "Series_Title": "Oldboy",
        "Released_Year": "2003",
        "Runtime": "101 min",
        "Genre": "Action, Drama, Mystery",
        "IMDB_Rating": "8.4",
        "Overview": "After being kidnapped and imprisoned for fifteen years, Oh Dae-Su is released, only to find that he must find his captor in five days.",
        "Director": "Chan-wook Park",
        "Star1": "Choi Min-sik",
        "Star2": "Yoo Ji-Tae",
        "Star3": "Kang Hye-jeong",
        "Star4": "Kim Byeong-Ok",
        "Gross": "707,481",
        "Synopsis": "\"Oldboy\" is a South Korean neo-noir action thriller directed by Park Chan-wook. The film follows Oh Dae-su, an average man who is abruptly kidnapped and imprisoned in a mysterious, decrepit hotel-like room for 15 years without knowing his captor's motives. During his imprisonment, Dae-su learns through a television broadcast that his wife has been murdered and he has been framed for the crime. Consumed by rage and driven by a desire for vengeance, he spends his time training and plotting his escape.\n\nUnexpectedly released one day with no explanation, Dae-su finds himself thrust into a complex web of conspiracy and revenge. He is given a cellphone and money, and soon meets a young sushi chef named Mi-do, who becomes his ally. As Dae-su delves deeper into uncovering the identity of his captor, he discovers that Woo-jin Lee, a wealthy businessman, orchestrated his imprisonment. Woo-jin begins a tormenting game, insisting that Dae-su figure out the reason behind his ordeal within five days.\n\nThe film unfolds through intense encounters and revelations, as Dae-su confronts traumatic memories and is pushed to the edge of sanity. In a climactic confrontation, Dae-su learns that his imprisonment was orchestrated due to his involvement in a past incident that indirectly led to Woo-jin’s sister's death.\n\nAs Dae-su grapples with these revelations, the shocking reality of Woo-jin's meticulously crafted plan is laid bare, leading to a harrowing and unexpected conclusion. Enveloped in themes of regret, memory, and the cyclical nature of vengeance, \"Oldboy\" presents a poignant exploration of human psyche and morality."
    },
    {
        "id": 69,
        "Series_Title": "Memento",
        "Released_Year": "2000",
        "Runtime": "113 min",
        "Genre": "Mystery, Thriller",
        "IMDB_Rating": "8.4",
        "Overview": "A man with short-term memory loss attempts to track down his wife's murderer.",
        "Director": "Christopher Nolan",
        "Star1": "Guy Pearce",
        "Star2": "Carrie-Anne Moss",
        "Star3": "Joe Pantoliano",
        "Star4": "Mark Boone Junior",
        "Gross": "25,544,867",
        "Synopsis": "**Memento** is a psychological thriller directed by Christopher Nolan. The film follows Leonard Shelby, a former insurance investigator suffering from anterograde amnesia, a condition that prevents him from forming new memories. Leonard's last clear memory is of his wife's brutal murder, which also left him with his condition. Driven by a need for revenge, he is on a mission to find and kill his wife's murderer.\n\nThe story unfolds in two timelines, one moving forward in color and the other moving backward in black and white, eventually converging at the end. In the color sequences, Leonard uses a system of Polaroid photographs, handwritten notes, and tattoos on his body to retain crucial information and track his progress. In the black-and-white sequences, he explains his condition and methodology over the phone to a mysterious caller in a motel room.\n\nLeonard's interactions with various characters, including Teddy, a dubious acquaintance who claims to be helping him, and Natalie, a barmaid with her own agenda, complicate his quest. As the story progresses, Leonard's trust in his allies and his method of creating a reliable narrative are continually tested.\n\nUltimately, it is revealed that Leonard has deceived himself, having already avenged his wife’s death but resetting his search to maintain a purpose. The film ends with Leonard choosing to lie to himself, setting a new target, and allowing the cycle of revenge and forgetfulness to continue."
    },
    {
        "id": 70,
        "Series_Title": "Princess Mononoke",
        "Released_Year": "1997",
        "Runtime": "134 min",
        "Genre": "Animation, Action, Adventure",
        "IMDB_Rating": "8.4",
        "Overview": "On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining colony. In this quest he also meets San, the Mononoke Hime.",
        "Director": "Hayao Miyazaki",
        "Star1": "Yôji Matsuda",
        "Star2": "Yuriko Ishida",
        "Star3": "Yûko Tanaka",
        "Star4": "Billy Crudup",
        "Gross": "2,375,308",
        "Synopsis": "In \"Princess Mononoke,\" set in the late Muromachi period of Japan, young Ashitaka, the last Emishi prince, becomes cursed by a demon boar while protecting his village. Seeking a cure for the deadly curse, Ashitaka journeys westward, where he discovers a land in turmoil.\n\nAshitaka encounters Iron Town, an industrious and isolated community led by the ambitious Lady Eboshi. The town thrives on iron production, but the process devastates the surrounding forests, angering the spirits and animals. Lady Eboshi seeks to kill the Forest Spirit to secure her town's future.\n\nIn the forest, Ashitaka meets San, a fierce young woman raised by wolves who is determined to protect the forest from human encroachment. Known as Princess Mononoke, San harbors a deep hatred for humans, especially Lady Eboshi.\n\nCaught in the crossfire, Ashitaka strives to mediate peace between Iron Town and the forest creatures. As war looms between humans and the animal gods, Ashitaka and San must reconcile their differences to restore balance and harmony.\n\nThe film explores themes of nature, industrialization, and the interconnectedness of all beings, culminating in a poignant message about coexistence and respect for the natural world."
    },
    {
        "id": 71,
        "Series_Title": "Once Upon a Time in America",
        "Released_Year": "1984",
        "Runtime": "229 min",
        "Genre": "Crime, Drama",
        "IMDB_Rating": "8.4",
        "Overview": "A former Prohibition-era Jewish gangster returns to the Lower East Side of Manhattan over thirty years later, where he once again must confront the ghosts and regrets of his old life.",
        "Director": "Sergio Leone",
        "Star1": "Robert De Niro",
        "Star2": "James Woods",
        "Star3": "Elizabeth McGovern",
        "Star4": "Treat Williams",
        "Gross": "5,321,508",
        "Synopsis": "\"Once Upon a Time in America\" is a sprawling epic directed by Sergio Leone, exploring the themes of friendship, betrayal, and the passage of time. The story unfolds over several decades, focusing on the lives of Jewish gangsters in New York City.\n\nThe film begins in the 1920s with a group of young friends, led by David \"Noodles\" Aaronson and Maximilian \"Max\" Bercovicz, as they engage in petty crimes. As they grow, their ambitions and operations expand, cementing their influence within the criminal underworld during the Prohibition era.\n\nNoodles and Max's friendship is central to the narrative, though it becomes increasingly strained due to differing visions for their future. Max is driven by an insatiable hunger for power and takes escalating risks, while Noodles desires a way out of the life of crime.\n\nFollowing a botched robbery, Noodles betrays the group, leading to a violent turn that marks the end of their youthful camaraderie. He goes into hiding, weighed down by guilt and loss, as his friends are either killed or imprisoned.\n\nYears later, in the 1960s, an older Noodles returns to New York, drawn back by mysterious letters. His return is shrouded in a quest for redemption and answers about the fate of his old friends. As he uncovers layers of deception, he faces the ghosts of his past, confronting the choices that defined his life.\n\nThe narrative structure is non-linear, interweaving memories and dreams with reality, emphasizing the impact of time and nostalgia. The film culminates in a revelation about Max’s fate, leaving Noodles—and the audience—with haunting reflections on the cost of ambition and the elusive nature of the American Dream."
    },
    {
        "id": 72,
        "Series_Title": "Raiders of the Lost Ark",
        "Released_Year": "1981",
        "Runtime": "115 min",
        "Genre": "Action, Adventure",
        "IMDB_Rating": "8.4",
        "Overview": "In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before Adolf Hitler's Nazis can obtain its awesome powers.",
        "Director": "Steven Spielberg",
        "Star1": "Harrison Ford",
        "Star2": "Karen Allen",
        "Star3": "Paul Freeman",
        "Star4": "John Rhys-Davies",
        "Gross": "248,159,971",
        "Synopsis": "Set in 1936, \"Raiders of the Lost Ark\" follows the daring adventures of Indiana Jones, a ruggedly handsome archaeologist and professor. The film begins with Indiana in the jungles of Peru, expertly navigating through a series of ancient booby traps to retrieve a golden idol. His success is short-lived as he is immediately tracked by his rival, René Belloq, who steals the artifact, forcing Indiana to narrowly escape with his life.\n\nBack in the United States, Indiana is approached by two Army intelligence agents. They inform him that the Nazis, under the guidance of Hitler, are seeking the Ark of the Covenant, a biblical artifact said to possess immense power. Jones learns that Hitler believes the Ark will make his army invincible. To locate the Ark, the Nazis require the ancient Staff of Ra, a key component tied to the excavation site in the Egyptian city of Tanis.\n\nIndiana agrees to retrieve the Ark before the Nazis. The quest leads him to Nepal, where he reunites with Marion Ravenwood, his spirited former lover, and the daughter of Jones's mentor. They have a contentious reunion, but Marion eventually agrees to help, as she possesses a crucial artifact, the headpiece to the Staff of Ra.\n\nTheir journey then takes them to Cairo, where they face numerous perils and Nazi operatives, including a sinister Gestapo agent named Arnold Toht. With the help of his friend Sallah, a skilled digger, Indiana learns that the Nazis' excavation for the Ark is in the wrong location.\n\nUsing the headpiece to decipher the correct site, Indiana and Sallah find the Well of Souls, the true resting place of the Ark. They manage to uncover it, but are ambushed by Belloq and the Nazis, who seize the Ark and trap Indiana and Marion inside the Well, surrounded by deadly snakes.\n\nIn a daring escape, Indiana and Marion pursue the Nazis, leading to a thrilling series of chases and fights, including a dramatic sequence involving a truck convoy. Despite their efforts, Belloq and the Nazis transport the Ark to a secret island base.\n\nThe film reaches its climax as Belloq, eager to unlock the Ark's power, holds a ceremonial opening. Indiana and Marion, tied up nearby, realize they cannot intervene physically. Instead, Indiana warns Marion to close her eyes and not look at the Ark when it opens.\n\nAs the Ark is unveiled, mystical forces are unleashed, destroying the Nazi soldiers and Belloq in a terrifying display of divine wrath. Indiana and Marion survive by keeping their eyes shut, allowing the Ark to seal itself once more.\n\nBack in Washington, D.C., Indiana learns that the Ark is secured by the U.S. government, stored in a vast warehouse among countless other mysterious artifacts. He leaves with Marion, contemplating the enigmatic and powerful nature of the Ark, as they embrace a future of further untold adventures."
    },
    {
        "id": 73,
        "Series_Title": "The Shining",
        "Released_Year": "1980",
        "Runtime": "146 min",
        "Genre": "Drama, Horror",
        "IMDB_Rating": "8.4",
        "Overview": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future.",
        "Director": "Stanley Kubrick",
        "Star1": "Jack Nicholson",
        "Star2": "Shelley Duvall",
        "Star3": "Danny Lloyd",
        "Star4": "Scatman Crothers",
        "Gross": "44,017,374",
        "Synopsis": "Jack Torrance, a struggling writer and recovering alcoholic, takes a job as the winter caretaker of the isolated Overlook Hotel in the Colorado Rockies. He moves there with his wife, Wendy, and their young son, Danny, who possesses psychic abilities known as \"the shining,\" which allow him to see the hotel's horrifying past.\n\nThe hotel's cook, Dick Hallorann, also has \"the shining\" and shares a telepathic bond with Danny. Before leaving for the winter, Hallorann warns Danny about the hotel’s dangerous nature, especially Room 237.\n\nAs winter sets in, the isolation begins to impact Jack's sanity. He becomes increasingly unstable and irritable, struggling with writer's block and haunted by the hotel's dark influence. Meanwhile, Danny has terrifying visions, including encounters with ghostly apparitions and rivers of blood.\n\nJack becomes more entranced by the hotel's supernatural forces, particularly through interactions with the ghostly bartender Lloyd and the former caretaker, Delbert Grady, who killed his family. Under their influence, Jack descends into madness, believing he must murder his wife and child to fulfill the hotel’s wishes.\n\nWendy realizes the danger they are in and tries to protect Danny. She discovers that Jack’s manuscript consists only of the repeated phrase, \"All work and no play makes Jack a dull boy.\" In a fit of rage, Jack attacks Wendy, but she is able to lock him in a pantry.\n\nWith Jack incapacitated, Wendy plans their escape. However, the hotel releases Jack, who pursues them with an axe. Danny escapes into the snow-filled hedge maze, using his wits to outsmart Jack, while Wendy manages to flee the hotel.\n\nIn a climactic chase through the maze, Jack becomes hopelessly lost. Danny and Wendy escape in Hallorann’s snowcat, whom Jack had killed earlier after being summoned by Danny’s telepathic cries for help.\n\nThe film concludes with a haunting shot of a photograph from 1921, showing Jack among the hotel’s partygoers, suggesting he has become a part of the Overlook’s dark history."
    },
    {
        "id": 74,
        "Series_Title": "Apocalypse Now",
        "Released_Year": "1979",
        "Runtime": "147 min",
        "Genre": "Drama, Mystery, War",
        "IMDB_Rating": "8.4",
        "Overview": "A U.S. Army officer serving in Vietnam is tasked with assassinating a renegade Special Forces Colonel who sees himself as a god.",
        "Director": "Francis Ford Coppola",
        "Star1": "Martin Sheen",
        "Star2": "Marlon Brando",
        "Star3": "Robert Duvall",
        "Star4": "Frederic Forrest",
        "Gross": "83,471,511",
        "Synopsis": "**Apocalypse Now** is a 1979 epic war film directed by Francis Ford Coppola. Set during the Vietnam War, the film begins with U.S. Army Captain Benjamin L. Willard, who's on leave in Saigon, spiraling into a state of disillusionment and despair. His purpose is rekindled when he's assigned a clandestine mission to eliminate Colonel Walter E. Kurtz, a once-prominent and highly esteemed officer who has gone rogue.\n\nKurtz, living deep within the Cambodian jungle, has established himself as a god-like figure, commanding a private army of natives who worship him. His methods are extreme, and his renegade operations are considered a threat to both sides of the conflict. Willard, tasked with \"terminating\" Kurtz's command \"with extreme prejudice,\" sets off on a journey aboard a Navy patrol boat with a diverse crew, including Chief Phillips, and young soldiers Chef, Lance, and Clean.\n\nAs they travel upriver, the men encounter numerous surreal and harrowing experiences that reflect the chaos and madness of war. They witness eccentric lieutenant colonel Bill Kilgore's obsession with surfing amidst combat, stumble upon a chaotic USO show, endure night-time attacks, and face the psychological strain of their journey. The crew is gradually worn down by the implacable, hallucinatory jungle environment, symbolizing the war's unpredictable nature.\n\nArriving at Kurtz's camp, Willard finds a community engulfed in madness. The inhabitants, including a manic photojournalist, idolize Kurtz. During their encounter, Kurtz discusses his views on the brutality and duality of human nature with Willard, revealing a deeply philosophical and disillusioned man, torn by the horrors of war.\n\nThe film culminates in Willard confronting and killing Kurtz, fulfilling his mission. As he departs, Kurtz’s followers seem ready to accept him as their new leader. The final moments leave viewers contemplating the nature of power, the thin line between sanity and madness, and the moral ambiguity of war. The haunting journey encapsulates the psychological and philosophical depths of both a soldier’s psyche and the Vietnam conflict itself."
    },
    {
        "id": 75,
        "Series_Title": "Alien",
        "Released_Year": "1979",
        "Runtime": "117 min",
        "Genre": "Horror, Sci-Fi",
        "IMDB_Rating": "8.4",
        "Overview": "After a space merchant vessel receives an unknown transmission as a distress call, one of the crew is attacked by a mysterious life form and they soon realize that its life cycle has merely begun.",
        "Director": "Ridley Scott",
        "Star1": "Sigourney Weaver",
        "Star2": "Tom Skerritt",
        "Star3": "John Hurt",
        "Star4": "Veronica Cartwright",
        "Gross": "78,900,000",
        "Synopsis": "In the 1979 science fiction horror film \"Alien,\" directed by Ridley Scott, the commercial space tug Nostromo is on a return journey to Earth with a crew of seven. When the ship's computer detects a mysterious signal from a nearby planetoid, the crew is awakened from stasis to investigate the source.\n\nUpon landing on the desolate planet, crew members Kane, Dallas, and Lambert discover a derelict alien spacecraft. Inside, Kane finds a chamber filled with egg-like objects. As he examines one, it opens, and a creature leaps out, attaching itself to his face.\n\nKane, unconscious but still alive, is brought back aboard the Nostromo. Attempts to remove the creature, now known as a facehugger, prove futile, with the alien eventually detaching on its own and dying. The crew decides to resume their journey home, believing the danger has passed.\n\nHowever, during a routine meal, Kane convulses in pain as an embryonic creature bursts from his chest, killing him. The new alien, rapidly growing and lethally aggressive, begins stalking the crew members one by one. Dallas attempts to trap it in the air ducts but is ambushed and killed.\n\nAs the crew dwindles, Ripley, the warrant officer, discovers that the company's secret directive prioritizes the retrieval of the alien for their bio-weapons division, even at the cost of the crew's lives. The ship's science officer, Ash, is revealed to be an android enforcing this order.\n\nWith Ash's destruction, Ripley takes command, planning to escape using the ship's shuttle. After a harrowing pursuit, Ripley narrowly escapes in the shuttle as she sets the Nostromo to self-destruct.\n\nHowever, the alien has stowed away on the shuttle. In a tense confrontation, Ripley dons a spacesuit and expels the creature into space using the vessel's airlock and jets.\n\nThe film concludes with Ripley, the sole survivor, entering stasis for the return to Earth, leaving the fate of the Nostromo and its crew a chilling lesson in the perils of space exploration."
    },
    {
        "id": 76,
        "Series_Title": "Anand",
        "Released_Year": "1971",
        "Runtime": "122 min",
        "Genre": "Drama, Musical",
        "IMDB_Rating": "8.4",
        "Overview": "The story of a terminally ill man who wishes to live life to the fullest before the inevitable occurs, as told by his best friend.",
        "Director": "Hrishikesh Mukherjee",
        "Star1": "Rajesh Khanna",
        "Star2": "Amitabh Bachchan",
        "Star3": "Sumita Sanyal",
        "Star4": "Ramesh Deo",
        "Gross": "",
        "Synopsis": "\"Anand\" is a classic Hindi film directed by Hrishikesh Mukherjee, released in 1971. The story revolves around the poignant friendship between a terminally ill cancer patient, Anand Saigal, and his doctor, Bhaskar Banerjee.\n\nBhaskar, also known as \"Babu Moshai,\" is a dedicated physician but somewhat cynical and world-weary. He meets Anand, a charismatic and joyful man who, despite knowing he has limited time to live due to lymphosarcoma of the intestine, maintains an infectious zest for life. Anand's positive outlook and happiness touch everyone around him, bringing laughter and warmth into their lives.\n\nThe unlikely friendship between the somber Bhaskar and the vivacious Anand forms the heart of the narrative. While Bhaskar is initially skeptical of Anand's relentless optimism, he gradually becomes deeply attached to him, learning to appreciate life's small joys. Through his journey with Anand, Bhaskar grapples with his own personal struggles, including his unrequited love for a colleague, Dr. Renu.\n\nAnand's interactions with the people around him—such as Isa Bhai, a hilarious storyteller, and others—add depth and humor to the story. As Anand's health deteriorates, his spirit remains unbroken, leaving a lasting impact on everyone he meets.\n\nThe film culminates in a deeply emotional climax, capturing Anand's eventual passing. Still, his indomitable spirit and the lessons he imparts leave Bhaskar transformed, ensuring that Anand's legacy of love and joy endures.\n\n\"Anand\" is celebrated for its powerful performances, particularly by Rajesh Khanna as Anand and Amitabh Bachchan as Bhaskar, and its soul-stirring music, making it an enduring classic in Indian cinema."
    },
    {
        "id": 77,
        "Series_Title": "High and Low",
        "Released_Year": "1963",
        "Runtime": "143 min",
        "Genre": "Crime, Drama, Mystery",
        "IMDB_Rating": "8.4",
        "Overview": "An executive of a shoe company becomes a victim of extortion when his chauffeur's son is kidnapped and held for ransom.",
        "Director": "Akira Kurosawa",
        "Star1": "Toshirô Mifune",
        "Star2": "Yutaka Sada",
        "Star3": "Tatsuya Nakadai",
        "Star4": "Kyôko Kagawa",
        "Gross": "",
        "Synopsis": "\"High and Low\" is a 1963 Japanese crime thriller directed by Akira Kurosawa, based on Ed McBain's novel \"King's Ransom.\"\n\nThe film centers around Kingo Gondo, a wealthy executive living in Yokohama who is on the brink of taking over the shoe company where he works. Just as he's about to finalize a risky financial maneuver to gain control, he receives a distressing phone call. The caller claims to have kidnapped Gondo's son and demands a hefty ransom.\n\nGondo is thrown into turmoil, debating the moral and financial implications of paying the ransom. However, it’s soon discovered that the kidnapper mistakenly abducted the chauffeur’s son instead. Despite knowing this, Gondo faces a fierce inner conflict about whether to sacrifice his ambitious plan for the boy's safe return.\n\nThe police become heavily involved, led by a diligent Inspector Tokura, and a meticulous investigation unfolds. They navigate the wealthy highlands and the impoverished lowlands of the city to track the kidnapper. Throughout this process, Gondo wrestles with his conscience and eventually decides to pay the ransom, driven by a sense of moral responsibility and empathy.\n\nThe latter part of the film focuses on the intense police effort to capture the kidnapper, revealing a stark contrast between Gondo’s world of privilege and the kidnapper’s life of desperation and enmity. The film concludes with a confrontation between Gondo and the kidnapper, offering a poignant reflection on justice, social disparity, and the human condition.\n\n\"High and Low\" is applauded for its compelling narrative, strategic tension, and exploration of ethical dilemmas, establishing it as a classic in cinema."
    },
    {
        "id": 78,
        "Series_Title": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
        "Released_Year": "1964",
        "Runtime": "95 min",
        "Genre": "Comedy",
        "IMDB_Rating": "8.4",
        "Overview": "An insane general triggers a path to nuclear holocaust that a War Room full of politicians and generals frantically tries to stop.",
        "Director": "Stanley Kubrick",
        "Star1": "Peter Sellers",
        "Star2": "George C. Scott",
        "Star3": "Sterling Hayden",
        "Star4": "Keenan Wynn",
        "Gross": "275,902",
        "Synopsis": "Set during the Cold War, the film opens with the unhinged United States Air Force Brigadier General Jack D. Ripper initiating a plan to launch a nuclear attack on the Soviet Union without authorization. Convinced that a Communist conspiracy is affecting American bodily fluids, Ripper orders his bomber planes to move toward Russia and issues an order that prevents any retraction of his command.\n\nCaptain Lionel Mandrake, a British RAF officer stationed at Burpelson Air Force Base, attempts to stop the attack after realizing Ripper's madness, but he is unable to communicate with the outside world due to Ripper's lockdown of the base and cutting off communications.\n\nMeanwhile, in the Pentagon’s War Room, President Merkin Muffley and his advisors scramble to regain control. Muffley communicates with Soviet Premier Dimitri Kissoff, attempting to avert catastrophe by explaining the situation and stressing the unauthorized nature of the attack.\n\nAmong the advisors in the War Room is Dr. Strangelove, a former Nazi and current strategic advisor, who explains the existence of the Soviets' \"Doomsday Machine.\" This device is designed to automatically trigger a nuclear apocalypse should Russia be attacked, ensuring mutual destruction.\n\nTensions rise as the bombers near their targets, with the U.S. military trying to recall them. Major T.J. \"King\" Kong, pilot of one B-52 bomber, becomes an emblem of determined patriotism as he defies all orders to stop and forges ahead.\n\nAs time runs out, Mandrake finally succeeds in getting through to the Pentagon, providing the recall code. However, Major Kong's plane is damaged and cannot be contacted. In a darkly comedic climax, Kong rides a nuclear bomb to its target, ushering in the triggering of the Doomsday Machine.\n\nThe film concludes with Dr. Strangelove, irrepressibly excited by the prospect of a post-apocalyptic world where people live underground, suggesting survival strategies. Ultimately, multiple atomic explosions erupt across the Earth, underscoring the absurdity and terrifying power of nuclear annihilation.\n\n\"Dr. Strangelove\" masterfully blends dark humor with a biting commentary on military politics and the fragility of human decision-making, cementing its place as a timeless satire."
    },
    {
        "id": 79,
        "Series_Title": "Witness for the Prosecution",
        "Released_Year": "1957",
        "Runtime": "116 min",
        "Genre": "Crime, Drama, Mystery",
        "IMDB_Rating": "8.4",
        "Overview": "A veteran British barrister must defend his client in a murder trial that has surprise after surprise.",
        "Director": "Billy Wilder",
        "Star1": "Tyrone Power",
        "Star2": "Marlene Dietrich",
        "Star3": "Charles Laughton",
        "Star4": "Elsa Lanchester",
        "Gross": "8,175,000",
        "Synopsis": "\"Witness for the Prosecution\" is a compelling 1957 courtroom drama directed by Billy Wilder, based on Agatha Christie's play of the same name. The film unfolds in post-World War II London and centers around Sir Wilfrid Robarts, a renowned but ailing barrister who is reluctantly recovering from a heart attack.\n\nDespite his doctor's orders to avoid stressful cases, Sir Wilfrid becomes engrossed in the defense of Leonard Vole, a charming, unemployed man accused of murdering a wealthy widow, Emily French, who had made him her principal heir. The case seems hopeless, as the evidence appears damning and circumstantial.\n\nLeonard maintains his innocence, claiming his alibi depends on the testimony of his enigmatic German wife, Christine Vole. However, to Sir Wilfrid's shock, Christine is called as a witness—not by the defense, but by the prosecution. She delivers a damning testimony, alleging that Leonard confessed to the murder, which heightens the suspense and complicates the defense’s strategy.\n\nAs the trial progresses, Sir Wilfrid's sharp instincts and legal acumen are on full display as he navigates through the tense courtroom drama and unexpected revelations. The plot twists when a mysterious woman provides letters discrediting Christine’s testimony, casting doubts on her motives.\n\nIn a gripping climax, just when the case seems to unravel in favor of the defense, a shocking twist reveals Christine’s true intentions. The twist not only impacts the verdict but also exposes hidden loyalties and deceits.\n\n\"Witness for the Prosecution\" masterfully blends suspense, drama, and surprise, with standout performances, particularly by Charles Laughton as Sir Wilfrid, and Marlene Dietrich as Christine. The film concludes with an ambiguous and intriguing ending, leaving audiences contemplating questions of justice and truth."
    },
    {
        "id": 80,
        "Series_Title": "Paths of Glory",
        "Released_Year": "1957",
        "Runtime": "88 min",
        "Genre": "Drama, War",
        "IMDB_Rating": "8.4",
        "Overview": "After refusing to attack an enemy position, a general accuses the soldiers of cowardice and their commanding officer must defend them.",
        "Director": "Stanley Kubrick",
        "Star1": "Kirk Douglas",
        "Star2": "Ralph Meeker",
        "Star3": "Adolphe Menjou",
        "Star4": "George Macready",
        "Gross": "",
        "Synopsis": "Set during World War I, \"Paths of Glory\" follows Colonel Dax, a French officer who is ordered by his superiors to lead his men in an attack on a heavily fortified German position, the Anthill. Knowing the mission is a suicide attack, Dax tries to convince his superiors of its futility, but the assault goes ahead. As Dax predicted, the attack results in catastrophic failure, with heavy casualties and a chaotic retreat.\n\nIn the aftermath, to cover up their own errors and assert control, the commanding officers decide to court-martial three randomly selected soldiers for cowardice in the face of the enemy. Colonel Dax, who is also a criminal defense lawyer in civilian life, takes on their defense. Despite his compelling arguments and clear evidence of the orders' impossibility, the trial is a farce, and the soldiers are sentenced to execution by firing squad.\n\nDax confronts his superiors, attempting to expose their abuse of power and call for justice, but his appeals fall on deaf ears. As the soldiers face their grim fate, Dax's bitter struggle underscores the human cost of war and the moral corruption within the military hierarchy.\n\nThe film concludes with a poignant scene where Dax witnesses French soldiers in a tavern momentarily finding solace and humanity before returning to the front lines, encapsulating the tragedy and futility of war."
    },
    {
        "id": 81,
        "Series_Title": "Rear Window",
        "Released_Year": "1954",
        "Runtime": "112 min",
        "Genre": "Mystery, Thriller",
        "IMDB_Rating": "8.4",
        "Overview": "A wheelchair-bound photographer spies on his neighbors from his apartment window and becomes convinced one of them has committed murder.",
        "Director": "Alfred Hitchcock",
        "Star1": "James Stewart",
        "Star2": "Grace Kelly",
        "Star3": "Wendell Corey",
        "Star4": "Thelma Ritter",
        "Gross": "36,764,313",
        "Synopsis": "**Rear Window** is a 1954 thriller directed by Alfred Hitchcock. The film follows L.B. \"Jeff\" Jeffries, a professional photographer confined to his New York City apartment with a broken leg. Spending his days recuperating in a wheelchair, Jeff passes the time by observing his neighbors through the rear window of his apartment.\n\nHe becomes intrigued by the various lives unfolding before him, including a dancer, a lonely woman he dubs \"Miss Lonelyhearts,\" and a composer. However, his attention increasingly focuses on Lars Thorwald, a traveling salesman whose mysterious behavior raises Jeff's suspicions. When Thorwald's bedridden wife disappears, Jeff becomes convinced that Thorwald has murdered her.\n\nWith the help of his stylish girlfriend Lisa Fremont and nurse Stella, Jeff begins to investigate. Lisa and Stella are initially skeptical, but they gradually become more involved in the unfolding mystery. Lisa even puts herself in danger by sneaking into Thorwald's apartment to find evidence.\n\nAs Jeff becomes more entrenched in uncovering the truth, he faces several tense moments, culminating in a dramatic confrontation. Thorwald eventually discovers Jeff's surveillance and attempts to confront him, leading to a climactic sequence where Jeff’s ingenuity and the arrival of the police thwart Thorwald.\n\nThe film concludes with Jeff having solved the mystery, Thorwald brought to justice, and the couple’s relationship solidified, highlighting themes of voyeurism, ethics, and the complexity of human relationships."
    },
    {
        "id": 82,
        "Series_Title": "Sunset Blvd.",
        "Released_Year": "1950",
        "Runtime": "110 min",
        "Genre": "Drama, Film-Noir",
        "IMDB_Rating": "8.4",
        "Overview": "A screenwriter develops a dangerous relationship with a faded film star determined to make a triumphant return.",
        "Director": "Billy Wilder",
        "Star1": "William Holden",
        "Star2": "Gloria Swanson",
        "Star3": "Erich von Stroheim",
        "Star4": "Nancy Olson",
        "Gross": "",
        "Synopsis": "**Sunset Blvd.** is a 1950 film noir directed by Billy Wilder. The story opens with the lifeless body of a screenwriter, Joe Gillis, floating in a swimming pool. The narrative, told through Joe's voiceover, flashes back to explain how he ended up there.\n\nJoe Gillis, struggling to make ends meet in Hollywood, stumbles upon the mansion of Norma Desmond, a reclusive former silent film star, while trying to avoid repossession agents. Norma, living in her decaying mansion with her butler, Max, is obsessed with reviving her career. She hires Joe to help her with a screenplay she believes will be her triumphant return to the silver screen.\n\nAs Joe becomes entangled in Norma's delusional world, he moves into her mansion and becomes both a kept man and a prisoner. Norma's grip on reality continues to slip, fueled by her unrequited affection for Joe and the ghosts of her storied past.\n\nSimultaneously, Joe collaborates on a separate script with Betty Schaefer, a young and idealistic writer engaged to his friend. Despite his relationship with Norma, Joe finds himself romantically drawn to Betty, complicating matters further.\n\nNorma's dream of a Hollywood comeback is shattered when the studio shows no interest in her script. In a fit of jealousy and despair upon discovering Joe’s connection with Betty, Norma's mental state unravels.\n\nThe film hurtles towards its tragic conclusion as Norma, in a state of madness, fatally shoots Joe. The police arrive, and Norma descends the grand staircase, imagining she is back on the set of a film, while uttering the famous line, \"All right, Mr. DeMille, I'm ready for my close-up.\" \n\nSunset Blvd. is a dark exploration of faded fame, delusion, and the dreamlike allure of Hollywood."
    },
    {
        "id": 83,
        "Series_Title": "The Great Dictator",
        "Released_Year": "1940",
        "Runtime": "125 min",
        "Genre": "Comedy, Drama, War",
        "IMDB_Rating": "8.4",
        "Overview": "Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime.",
        "Director": "Charles Chaplin",
        "Star1": "Charles Chaplin",
        "Star2": "Paulette Goddard",
        "Star3": "Jack Oakie",
        "Star4": "Reginald Gardiner",
        "Gross": "288,475",
        "Synopsis": "\"The Great Dictator\" is a satirical comedy-drama film from 1940, directed by and starring Charlie Chaplin. The film presents a poignant commentary on fascism, specifically Adolf Hitler and the Nazi regime.\n\nThe story unfolds in the fictional nation of Tomainia, where a Jewish barber, who bears a striking resemblance to the country’s tyrannical dictator, Adenoid Hynkel, resides. During World War I, the barber saves the life of a soldier named Schultz, but loses his memory in an accident and spends years in a hospital.\n\nMeanwhile, Hynkel rises to power, spouting antisemitic rhetoric and plotting world domination with his allies, including fellow dictator Napaloni of Bacteria. Hynkel's regime enforces brutal discrimination against Jewish citizens, urging their businesses to close and forcing them into ghettos.\n\nThe barber, oblivious to these changes, returns to his neighborhood after his recovery. He reconnects with his friends, including Hannah, a kind-hearted laundress, and again meets Schultz, now a high-ranking officer who opposes Hynkel's anti-Jewish policies. Schultz protects the barber and his neighbors from persecution.\n\nConflict intensifies as Hynkel’s ambitions grow. Desperate to lead a war effort, he plans an invasion of neighboring Osterlich. Hynkel imprisons Schultz and the barber in a concentration camp for their dissent.\n\nIn a twist of fate, the barber and Hynkel swap identities when Hynkel is mistakenly arrested, allowing the barber to take on the role of the dictator. During a military rally meant to celebrate the invasion, the barber, as Hynkel, delivers a powerful speech promoting peace, unity, and humanity, denouncing dictatorship and hatred.\n\nThe film concludes with a hopeful message as the barber, still disguised, encourages the soldiers and citizens to fight for freedom and justice, inspiring them to look beyond oppression towards a brighter future.\n\n\"The Great Dictator\" combines Chaplin's masterful comedic talent with profound political commentary, making it a timeless exploration of power, identity, and resistance against tyranny."
    },
    {
        "id": 84,
        "Series_Title": "1917",
        "Released_Year": "2019",
        "Runtime": "119 min",
        "Genre": "Drama, Thriller, War",
        "IMDB_Rating": "8.3",
        "Overview": "April 6th, 1917. As a regiment assembles to wage war deep in enemy territory, two soldiers are assigned to race against time and deliver a message that will stop 1,600 men from walking straight into a deadly trap.",
        "Director": "Sam Mendes",
        "Star1": "Dean-Charles Chapman",
        "Star2": "George MacKay",
        "Star3": "Daniel Mays",
        "Star4": "Colin Firth",
        "Gross": "159,227,644",
        "Synopsis": "Set amidst the backdrop of World War I, \"1917\" follows two young British soldiers, Lance Corporals Schofield and Blake, who are given a seemingly impossible mission. The pair is tasked with delivering a crucial message deep within enemy territory to prevent an ambush on a battalion of 1,600 men, including Blake's brother.\n\nAs they traverse the treacherous and war-torn landscape of northern France, the two soldiers face relentless challenges. They navigate through abandoned German trenches, dodge enemy fire, and witness the grim realities of war. Time is their greatest enemy, pressing them forward through devastated towns, perilous rivers, and eerie nighttime encounters.\n\nThe film's unique presentation, designed to appear as one continuous shot, immerses the audience in the intense and urgent journey. Schofield and Blake's mission is a race against time, testing their resolve, courage, and the deep bond of friendship forged in the darkest of times. As they endure physical and emotional trials, the film explores themes of sacrifice, duty, and the enduring human spirit amidst the horrors of war."
    },
    {
        "id": 85,
        "Series_Title": "Tumbbad",
        "Released_Year": "2018",
        "Runtime": "104 min",
        "Genre": "Drama, Fantasy, Horror",
        "IMDB_Rating": "8.3",
        "Overview": "A mythological story about a goddess who created the entire universe. The plot revolves around the consequences when humans build a temple for her first-born.",
        "Director": "Rahi Anil Barve",
        "Star1": "Anand Gandhi",
        "Star2": "Adesh Prasad",
        "Star3": "Sohum Shah",
        "Star4": "Jyoti Malshe",
        "Gross": "",
        "Synopsis": "**Tumbbad** is a 2018 Indian horror fantasy film that intertwines mythology and human greed. Set in the early 20th century in the rustic village of Tumbbad, Maharashtra, the film follows the story of Vinayak Rao and the cursed family treasure he obsessively seeks.\n\nThe narrative begins with Vinayak as a young boy. The legend of Tumbbad is introduced through his grandmother's frightening tales about Hastar, a demonic entity and the firstborn of the Goddess of Prosperity. Hastar was cursed for his insatiable greed, having attempted to seize both gold and food from the goddess. He was condemned to eternal hunger, punished never to be worshipped.\n\nThe family lives in a decrepit mansion on the outskirts of Tumbbad, guarding a secret shrine where Hastar allegedly remains imprisoned. Vinayak's mother warns him to stay away from the mansion's forbidden well, where Hastar is believed to lurk. However, after a tragic accident claiming his younger brother's life, Vinayak's family abandons the village.\n\nYears later, driven by persistent dreams of the hidden treasure, an adult Vinayak returns to Tumbbad. With his grandmother as the last keeper of the secret, he learns the methods to seize the gold coins hidden in Hastar's lair. This involves terrifying rituals and encounters with ghastly creatures that embody Hastar's curse.\n\nVinayak's visits to the shrine yield great wealth, but at the risk of succumbing to sheer madness and the moral decay that accompanies insatiable greed. Over time, he involves his young son in the pursuit, perpetuating a cycle of avarice and ambition.\n\nAs Vinayak's greed grows, he underestimates the dangers of the malevolent curse. The film builds tension to a climactic confrontation where the twisted and dark family legacy threatens to consume everything Vinayak holds dear.\n\nTumbbad is acclaimed for its atmospheric storytelling, masterful integration of Indian folklore, and an exploration of intergenerational greed and its consequences. The film combines suspenseful horror with a poignant moral, captivating audiences with its unique visual and narrative style."
    },
    {
        "id": 86,
        "Series_Title": "Andhadhun",
        "Released_Year": "2018",
        "Runtime": "139 min",
        "Genre": "Crime, Drama, Music",
        "IMDB_Rating": "8.3",
        "Overview": "A series of mysterious events change the life of a blind pianist, who must now report a crime that he should technically know nothing of.",
        "Director": "Sriram Raghavan",
        "Star1": "Ayushmann Khurrana",
        "Star2": "Tabu",
        "Star3": "Radhika Apte",
        "Star4": "Anil Dhawan",
        "Gross": "1,373,943",
        "Synopsis": "\"Andhadhun\" is a thriller about a talented blind pianist named Akash who becomes embroiled in a series of mysterious events. Living in Pune, Akash fakes his blindness to enhance his musical inspiration. One day, he meets Sophie, who is impressed by his talent and offers him a gig at her father's diner.\n\nAkash is invited to a private concert at the home of Pramod Sinha, a former film star. However, upon arriving, he discovers Sinha's dead body. Pretending not to see anything due to his supposed blindness, Akash is forced to perform with the body hidden from view. He soon realizes that the murder was orchestrated by Simi, Sinha's wife, in collusion with her lover, Inspector Manohar.\n\nAs events spiral out of control, Akash unwittingly becomes a pawn in Simi and Manohar's deadly game. He is determined to report the crime, but his blindness poses a tough challenge, especially when faced with disbelief and further threats from the murderers.\n\nThe tension escalates as Simi and Manohar's plans unravel. Akash is double-crossed, and his life is imperiled multiple times. He temporarily loses his sight for real due to a twist of fate but manages to outsmart his adversaries.\n\nIn a gripping climax, Akash's musical genius and wit guide him through perilous circumstances, leading to a showdown that tests his morals and instincts. The film concludes ambiguously, leaving the audience questioning morality and the blurred lines between right and wrong, all punctuated by Akash's haunting, soulful piano melodies."
    },
    {
        "id": 87,
        "Series_Title": "Drishyam",
        "Released_Year": "2013",
        "Runtime": "160 min",
        "Genre": "Crime, Drama, Thriller",
        "IMDB_Rating": "8.3",
        "Overview": "A man goes to extreme lengths to save his family from punishment after the family commits an accidental crime.",
        "Director": "Jeethu Joseph",
        "Star1": "Mohanlal",
        "Star2": "Meena",
        "Star3": "Asha Sharath",
        "Star4": "Ansiba",
        "Gross": "",
        "Synopsis": "\"Drishyam\" is a gripping Indian thriller that delves into the lengths a man will go to protect his family. The story is set in a small town in India and follows Vijay Salgaonkar, a cable TV service provider and a devoted family man who lives a simple life with his wife, Nandini, and their two daughters.\n\nTheir lives take a dramatic turn when a troubling incident involving their older daughter, Anju, precipitates a deadly chain of events. Anju accidentally kills Sam, the wayward son of the local Inspector General, Geetha Prabhakar, in self-defense as he tries to blackmail her with a compromising video. In a panic, the family decides to cover up the death to protect Anju.\n\nVijay manages to outsmart the police by creating an elaborate alibi, using skills he has picked up from watching films. He meticulously plans every move, coaching his family on how to behave and what to say. He buries Sam's body in an under-construction police station, banking on the last place they would think to search.\n\nThe investigation intensifies as Geetha uses all her power and resources to find her missing son. Despite intense scrutiny and interrogation tactics used by the police, Vijay's plan holds strong, with him maintaining a calm and collected demeanor throughout.\n\nThe narrative unfolds with numerous twists, as tension builds between the law and Vijay's unwavering determination to shield his family. The climax reveals layers of emotional depth and complexity, questioning the morality of justice and the lengths one might go to protect loved ones.\n\nIn the end, Vijay succeeds in keeping his family safe, while the emotional burden of their actions looms large, leaving the audience to ponder the thin line between right and wrong. The film closes with Vijay introspecting on his deeds, knowing the ordeal is behind them, yet the moral implications leave a lingering impact."
    },
    {
        "id": 88,
        "Series_Title": "The Hunt",
        "Released_Year": "2012",
        "Runtime": "115 min",
        "Genre": "Drama",
        "IMDB_Rating": "8.3",
        "Overview": "A teacher lives a lonely life, all the while struggling over his son's custody. His life slowly gets better as he finds love and receives good news from his son, but his new luck is about to be brutally shattered by an innocent little lie.",
        "Director": "Thomas Vinterberg",
        "Star1": "Mads Mikkelsen",
        "Star2": "Thomas Bo Larsen",
        "Star3": "Annika Wedderkopp",
        "Star4": "Lasse Fogelstrøm",
        "Gross": "687,185",
        "Synopsis": "In \"The Hunt,\" a group of elite, wealthy individuals engage in a secretive and dangerous game where they hunt humans for sport. The film opens with the participants preparing for their ruthless pastime, known as \"The Manor Gate,\" which takes place in a remote area.\n\nUnwittingly, twelve strangers find themselves in a clearing, gagged and bewildered, with no memory of how they got there. Among them is Crystal, a resourceful woman with military experience, who quickly emerges as the unlikely leader of the group. As the hunt begins, the captives realize they are being pursued by a band of merciless hunters equipped with advanced weaponry and gadgets.\n\nThe narrative unfolds through a satirical lense, critiquing societal divides and highlighting the absurdity of the rich versus poor dynamic. As the hunted struggle for survival, tensions rise among them, revealing personal motives and allegiances.\n\nCrystal proves to be a formidable opponent, outsmarting and taking down many of the pursuers with cunning and strategic prowess. As the group dwindles, it becomes apparent that Crystal has a personal vendetta against the person orchestrating the hunt.\n\nThe climax builds as Crystal ultimately confronts Athena, the mastermind behind the game. In a gripping showdown, the two engage in a fierce battle of wits and combat, exposing the underlying themes of power and class conflict.\n\nThe film concludes with Crystal emerging victorious, leaving a trail of destruction in her wake as she steps out, reasserting her autonomy and the triumph of wit and willpower over oppression."
    },
    {
        "id": 89,
        "Series_Title": "A Seperation",
        "Released_Year": "2011",
        "Runtime": "123 min",
        "Genre": "Drama",
        "IMDB_Rating": "8.3",
        "Overview": "A married couple are faced with a difficult decision - to improve the life of their child by moving to another country or to stay in Iran and look after a deteriorating parent who has Alzheimer's disease.",
        "Director": "Asghar Farhadi",
        "Star1": "Payman Maadi",
        "Star2": "Leila Hatami",
        "Star3": "Sareh Bayat",
        "Star4": "Shahab Hosseini",
        "Gross": "7,098,492",
        "Synopsis": "\"A Separation\" is an Iranian drama film directed by Asghar Farhadi. The story centers around Nader and Simin, a couple living in Tehran who are experiencing marital difficulties. Simin wants to leave Iran to provide a better future for their daughter, Termeh, but Nader refuses to leave his ailing father who suffers from Alzheimer's disease. This disagreement leads Simin to file for divorce.\n\nWith Simin temporarily moving out, Nader hires Razieh, a deeply religious woman, to take care of his father. However, caring for the elderly man proves challenging, and Razieh, who is pregnant and struggling with her own financial difficulties, faces moral and ethical dilemmas, especially when Nader's father wanders off and gets hurt.\n\nA critical incident occurs when Nader returns home to find his father tied to the bed and alone. An argument ensues, leading to Razieh's fall and subsequent miscarriage. Razieh's husband, Hodjat, files a complaint against Nader, accusing him of murder.\n\nThe ensuing legal battles unravel hidden truths and strain relationships as each character is faced with difficult choices that challenge their honesty, duty, and compassion. The film intricately explores themes of family, justice, and the complexities of human nature, leaving the audience to contemplate the fine line between right and wrong."
    },
    {
        "id": 90,
        "Series_Title": "Incendies",
        "Released_Year": "2010",
        "Runtime": "131 min",
        "Genre": "Drama, Mystery, War",
        "IMDB_Rating": "8.3",
        "Overview": "Twins journey to the Middle East to discover their family history and fulfill their mother's last wishes.",
        "Director": "Denis Villeneuve",
        "Star1": "Lubna Azabal",
        "Star2": "Mélissa Désormeaux-Poulin",
        "Star3": "Maxim Gaudette",
        "Star4": "Mustafa Kamel",
        "Gross": "6,857,096",
        "Synopsis": "\"Incendies\" is a gripping drama-thriller directed by Denis Villeneuve, based on Wajdi Mouawad’s play. The story follows twins Jeanne and Simon Marwan, whose lives are upended when their Lebanese-Canadian mother, Nawal, passes away. In her will, she leaves mysterious instructions: Jeanne is to find the father they thought was dead, and Simon is to locate a brother they never knew existed. Their journey takes them to an unnamed Middle Eastern country, uncovering their mother's harrowing past.\n\nAs Jeanne begins tracing Nawal’s steps, she discovers her mother’s life was marked by conflict and tragedy during a civil war. Simon, initially reluctant, joins Jeanne, and together they unravel a shocking story of love, resilience, and the devastating impact of war.\n\nThrough a series of intense flashbacks, the film reveals Nawal's youthful involvement in a political resistance movement, her capture, and the horrific experiences she endured in prison, including giving birth to a child in captivity. The film masterfully intertwines the twins' investigation with Nawal’s backstory, gradually connecting the past with their present.\n\nThe siblings' quest ultimately uncovers a heartbreaking revelation about their family, forcing them to confront their identity and legacy. The film ends with a powerful acknowledgment of Nawal’s enduring love and sacrifice, leaving Jeanne and Simon with both closure and a newfound understanding of their mother’s profound struggle."
    },
    {
        "id": 91,
        "Series_Title": "Miracle in cell NO.7",
        "Released_Year": "2019",
        "Runtime": "132 min",
        "Genre": "Drama",
        "IMDB_Rating": "8.3",
        "Overview": "A story of love between a mentally-ill father who was wrongly accused of murder and his lovely six years old daughter. The prison would be their home. Based on the 2013 Korean movie 7-beon-bang-ui seon-mul (2013).",
        "Director": "Mehmet Ada Öztekin",
        "Star1": "Aras Bulut Iynemli",
        "Star2": "Nisa Sofiya Aksongur",
        "Star3": "Deniz Baysal",
        "Star4": "Celile Toyon Uysal",
        "Gross": "",
        "Synopsis": "\"Miracle in Cell No. 7\" is a poignant drama about a mentally challenged man, Lee Yong-gu, and his young daughter, Ye-sung, living in South Korea. Yong-gu is wrongfully accused and convicted of a crime he did not commit—the murder of a police commissioner’s daughter. Despite his intellectual disabilities, which inhibit his ability to defend himself, he finds himself sentenced to death and incarcerated in Cell No. 7, a high-security prison.\n\nWithin the prison, Yong-gu's kind-hearted nature gradually wins over his initially hostile cellmates, who come to believe in his innocence. Deeply touched by his love for Ye-sung, the inmates devise an elaborate plan to smuggle the little girl into the prison, allowing father and daughter brief reunions filled with warmth and love.\n\nThe story unfolds through flashbacks narrated by an adult Ye-sung, now a lawyer, who tirelessly works to clear her father's name, demonstrating her unwavering belief in his innocence. As she delves into the past, the narrative explores themes of justice, love, and sacrifice.\n\nThe prison's unlikely family grows closer, supporting Yong-gu through his trial, while Ye-sung's dedication underscores the enduring bond between father and daughter. The film highlights acts of kindness and humanity against the stark realities of injustice, culminating in an emotional resolution that speaks to the power of love and redemption."
    },
    {
        "id": 92,
        "Series_Title": "My Father and My Son",
        "Released_Year": "2005",
        "Runtime": "112 min",
        "Genre": "Drama, Family",
        "IMDB_Rating": "8.3",
        "Overview": "The family of a left-wing journalist is torn apart after the military coup of Turkey in 1980.",
        "Director": "Çagan Irmak",
        "Star1": "Çetin Tekindor",
        "Star2": "Fikret Kuskan",
        "Star3": "Hümeyra",
        "Star4": "Ege Tanman",
        "Gross": "",
        "Synopsis": "**My Father and My Son** is a poignant Turkish drama that centers on the complex relationships within a family torn apart by political and personal conflicts. The story unfolds against the backdrop of Turkey's turbulent political climate in the late 20th century.\n\nThe film follows Sadik, an idealistic young journalist who becomes embroiled in political activism during a tumultuous period in Turkey. His decision to pursue a career in journalism and engage in political protest estranges him from his conservative family. His father, Hüseyin, a staunch farmer, disagrees with Sadik's choices, leading to a bitter familial rift.\n\nAs political tensions reach their peak, tragedy strikes, resulting in Sadik's imprisonment and the loss of his wife during childbirth. Upon his release years later, Sadik is left to care for his young son, Deniz, alone. Faced with the uncertainties of life after his wife's death, Sadik returns to his rural village, seeking reconciliation with his estranged father and a stable upbringing for Deniz.\n\nThe reunion is fraught with tension as Sadik and Hüseyin attempt to bridge the years of silence and misunderstanding. Throughout the narrative, Deniz becomes the focal point, unknowingly guiding his father and grandfather towards healing and forgiveness. As old wounds resurface, the family must confront their past grievances and find a way to reconnect.\n\nThe film delicately explores themes of family loyalty, regret, and the enduring bond between parents and children, culminating in an emotionally charged resolution that emphasizes love and understanding across generations. Through its heartfelt narrative, \"My Father and My Son\" captures the essence of familial reconciliation amidst a backdrop of societal change."
    },
    {
        "id": 93,
        "Series_Title": "Inglourious Basterds",
        "Released_Year": "2009",
        "Runtime": "153 min",
        "Genre": "Adventure, Drama, War",
        "IMDB_Rating": "8.3",
        "Overview": "In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same.",
        "Director": "Quentin Tarantino",
        "Star1": "Brad Pitt",
        "Star2": "Diane Kruger",
        "Star3": "Eli Roth",
        "Star4": "Mélanie Laurent",
        "Gross": "120,540,719",
        "Synopsis": "Inglourious Basterds is a 2009 film directed by Quentin Tarantino. Set in Nazi-occupied France during World War II, the film weaves together multiple storylines aimed at overthrowing the Third Reich.\n\nThe film opens in 1941 with Colonel Hans Landa, a cunning Nazi officer, interrogating a dairy farmer in rural France about the whereabouts of a Jewish family. Landa’s brutal interrogation leads to the discovery and massacre of the hidden family, sparing only the young Shosanna Dreyfus, who escapes.\n\nSeveral years later, Shosanna is living in Paris under the false identity of Emmanuelle Mimieux and running a cinema. Meanwhile, Lieutenant Aldo Raine leads a special unit of Jewish American soldiers known as the \"Basterds.\" Their mission is to spread fear by brutally killing Nazis and taking scalps. Among their ranks is Sergeant Donny Donowitz, known as \"The Bear Jew,\" famed for beating Nazis to death with a baseball bat.\n\nThe two storylines converge when German war hero Fredrick Zoller, smitten with Shosanna, convinces Nazi leaders to premiere a propaganda film at her cinema. Shosanna seizes the opportunity to exact revenge, planning to burn the theater with flammable nitrate film.\n\nSimultaneously, a British operation, led by Lieutenant Archie Hicox and aided by the \"Basterds,\" intends to assassinate Nazi leaders at the premiere. The plan goes awry when the team is compromised in a tense standoff in a tavern. Surviving members team up with German actress and double agent Bridget von Hammersmark.\n\nAt the premiere, both the \"Basterds\" and Shosanna execute their plans independently. Shosanna’s projectionist lover ignites the film, sparking a massive fire that engulfs the theater. Meanwhile, the \"Basterds\" launch their attack inside the cinema.\n\nThe climax sees both plans succeeding, resulting in the death of key Nazi leaders, including Hitler. In the aftermath, Raine captures Landa, marking him for life with a swastika, ensuring his allegiance is known forever.\n\nInglourious Basterds ends with Aldo Raine declaring that his act of marking Landa is his \"masterpiece,\" signifying the unconventional yet impactful acts throughout the film."
    },
    {
        "id": 94,
        "Series_Title": "Eternal Sunshine of the Spotless Mind",
        "Released_Year": "2004",
        "Runtime": "108 min",
        "Genre": "Drama, Romance, Sci-Fi",
        "IMDB_Rating": "8.3",
        "Overview": "When their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories.",
        "Director": "Michel Gondry",
        "Star1": "Jim Carrey",
        "Star2": "Kate Winslet",
        "Star3": "Tom Wilkinson",
        "Star4": "Gerry Robert Byrne",
        "Gross": "34,400,301",
        "Synopsis": "\"Eternal Sunshine of the Spotless Mind\" is a 2004 romantic science fiction film directed by Michel Gondry and written by Charlie Kaufman. The film follows the story of Joel Barish, a man who is heartbroken to discover that his ex-girlfriend, Clementine Kruczynski, has undergone a procedure to erase all memories of their relationship from her mind. In an impulsive reaction, Joel decides to undergo the same procedure.\n\nAs the procedure is set in motion and Joel’s memories of Clementine begin to disappear, he finds himself reflecting on their relationship. The film seamlessly blends reality and subconscious as Joel relives moments of joy, arguments, and intimacy with Clementine. As the memories unfold, he starts to regret his decision and attempts to hide the memory of Clementine in unrelated parts of his mind to stop the erasure.\n\nThroughout the film, a secondary storyline revolves around the employees of the memory-erasing company, Lacuna Inc., including technicians Stan and Patrick, and receptionist Mary. As they perform the procedure, their lives become intertwined with Joel’s, revealing their own complicated relationships and ethical dilemmas.\n\nEventually, despite all the chaos and attempts to hold on, Joel's memories of Clementine are erased. However, fate seems to bring them back together. They meet anew, seemingly drawn to each other, and when they discover the truth about their past relationship, they face the decision to start over, embracing the messiness of human connection and the value of memory.\n\n\"Eternal Sunshine of the Spotless Mind\" explores themes of love, memory, and identity, questioning the pain and beauty inherent in human relationships and the nature of forgetting."
    },
    {
        "id": 95,
        "Series_Title": "Amélie",
        "Released_Year": "2001",
        "Runtime": "122 min",
        "Genre": "Comedy, Romance",
        "IMDB_Rating": "8.3",
        "Overview": "Amélie is an innocent and naive girl in Paris with her own sense of justice. She decides to help those around her and, along the way, discovers love.",
        "Director": "Jean-Pierre Jeunet",
        "Star1": "Audrey Tautou",
        "Star2": "Mathieu Kassovitz",
        "Star3": "Rufus",
        "Star4": "Lorella Cravotta",
        "Gross": "33,225,499",
        "Synopsis": "In the whimsical streets of Montmartre, Paris, lives Amélie Poulain, a shy and imaginative young woman with a unique sense of justice and a fascination for life's simple pleasures. Having grown up isolated from other children due to her father's health concerns, Amélie develops a rich inner world. Her life takes a pivotal turn when she discovers a hidden box of childhood treasures in her apartment, left by a previous tenant.\n\nDetermined to return the box to its owner, Amélie embarks on a mission that transforms her life. She anonymously returns the box to its owner, and upon witnessing his joyous reaction, Amélie resolves to discreetly improve the lives of those around her. As her covert operations unfold, she orchestrates small yet meaningful acts of kindness for her neighbors and colleagues, including matchmaking, justice-serving pranks, and encouraging others to follow their dreams.\n\nWhile helping others, Amélie encounters her own challenge: an unexpected budding romance with Nino Quincampoix, an eccentric collector of discarded photo booth pictures. Initially shy and hesitant, Amélie devises elaborate schemes to communicate with Nino without revealing herself. However, she eventually realizes that to find happiness, she must take direct action and confront her own fears.\n\nWith her quirky charm and imaginative approach to life, Amélie learns that genuine connections require vulnerability. In pursuing love and friendship, she transcends her self-imposed solitude and embraces the beauty of human interaction. Through her journey, Amélie discovers the power of small acts of kindness to create ripples of joy and transform her world."
    },
    {
        "id": 96,
        "Series_Title": "Snatch",
        "Released_Year": "2000",
        "Runtime": "104 min",
        "Genre": "Comedy, Crime",
        "IMDB_Rating": "8.3",
        "Overview": "Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers and supposedly Jewish jewelers fight to track down a priceless stolen diamond.",
        "Director": "Guy Ritchie",
        "Star1": "Jason Statham",
        "Star2": "Brad Pitt",
        "Star3": "Benicio Del Toro",
        "Star4": "Dennis Farina",
        "Gross": "30,328,156",
        "Synopsis": "\"Snatch\" is a 2000 British crime comedy film directed by Guy Ritchie. The film intertwines multiple storylines centered around the underworld of London's crime scene, with a signature fast-paced and witty style.\n\nAt the heart of the story is a large, stolen diamond that attracts the attention of various unsavory characters. Franky \"Four-Fingers\" is a diamond thief sent by New York jeweler and gangster, Avi, to deliver the precious stone to him in London. However, Franky's gambling addiction leads him to place a bet at an illegal boxing match, unknowingly involving him with the unpredictable crime boss, Brick Top.\n\nMeanwhile, two small-time boxing promoters, Turkish and Tommy, find themselves in a precarious situation with Brick Top as well. Brick Top forces them to set up a fixed fight involving Mickey O'Neil, a gypsy bare-knuckle boxing champion with a thick accent and erratic behavior. However, Mickey's refusal to follow the script complicates their lives.\n\nAvi flies to London to reclaim the diamond, accompanied by \"Bullet-Tooth\" Tony, a hitman known for his resilience. As they search for Franky and the diamond, they encounter various criminal figures, resulting in chaotic and violent confrontations.\n\nParallel to this, a group of amateur criminals led by the bumbling Sol and Vinny, along with their companion Tyrone, attempt to rob a bookie only to stumble into the diamond heist. Their involvement further entangles the web of deception and betrayal.\n\nEach character's path crosses in a series of unpredictable events, leading to a climactic confrontation that resolves the multiple threads of intrigue. In the end, the fate of the diamond is decided in a darkly humorous twist, with Turkish and Tommy seizing an unexpected opportunity.\n\n\"Snatch\" is known for its lively ensemble cast, which includes Jason Statham, Brad Pitt, Benicio del Toro, and Vinnie Jones, along with its stylish direction, rapid editing, and clever dialogue."
    },
    {
        "id": 97,
        "Series_Title": "Requiem for a Dream",
        "Released_Year": "2000",
        "Runtime": "102 min",
        "Genre": "Drama",
        "IMDB_Rating": "8.3",
        "Overview": "The drug-induced utopias of four Coney Island people are shattered when their addictions run deep.",
        "Director": "Darren Aronofsky",
        "Star1": "Ellen Burstyn",
        "Star2": "Jared Leto",
        "Star3": "Jennifer Connelly",
        "Star4": "Marlon Wayans",
        "Gross": "3,635,482",
        "Synopsis": "\"Requiem for a Dream\" is a psychological drama that explores the harrowing descent into addiction for four interconnected characters. The film is set in Brooklyn and follows Sara Goldfarb, a lonely widow who dreams of appearing on a TV game show. Her life spirals out of control when she becomes addicted to amphetamines in a desperate attempt to lose weight for her television debut, experiencing vivid hallucinations as her mental state deteriorates.\n\nHer son, Harry, is a charming young man with dreams of escaping his bleak reality. He partners with his girlfriend, Marion, a promising fashion designer, and his best friend, Tyrone, in a mid-level heroin dealing operation. As their addiction deepens, their enterprise unravels, leading to tragic consequences. Harry ends up hospitalized after a failed drug transaction leaves him with a severely infected arm. Marion, addicted herself, becomes desperate enough to sell her body to maintain her habit.\n\nAs each character pursues their illusory dreams, their worlds collapse. Sara, now institutionalized and treated with electroconvulsive therapy, loses her grip on reality entirely. Harry, losing both his physical health and his aspirations, is left desolate. Marion becomes estranged from Harry, trapped in her own abyss of dependency and degradation. Tyrone, crippled by his habit, languishes in prison dealing with systemic racism and isolation.\n\nThe film’s relentless depiction of the brutal consequences of addiction is underscored by its haunting score and powerful cinematography, painting a grim portrait of the fragility of dreams and the destructive power of dependency."
    },
    {
        "id": 98,
        "Series_Title": "American Beauty",
        "Released_Year": "1999",
        "Runtime": "122 min",
        "Genre": "Drama",
        "IMDB_Rating": "8.3",
        "Overview": "A sexually frustrated suburban father has a mid-life crisis after becoming infatuated with his daughter's best friend.",
        "Director": "Sam Mendes",
        "Star1": "Kevin Spacey",
        "Star2": "Annette Bening",
        "Star3": "Thora Birch",
        "Star4": "Wes Bentley",
        "Gross": "130,096,601",
        "Synopsis": "\"American Beauty\" is a 1999 drama film that delves into the seemingly idyllic American suburban life, revealing the underlying dissatisfaction and turmoil of its characters. The story centers around Lester Burnham, a disillusioned middle-aged advertising executive who undergoes a personal transformation following a midlife crisis. Feeling trapped in a stagnant life and a loveless marriage with his ambitious wife Carolyn, Lester becomes infatuated with Angela, his teenage daughter's alluring friend.\n\nAs Lester begins to rebel against societal norms—quitting his job and embracing a carefree attitude—his impulsive actions trigger a chain of events that unravel the facades held by those around him. His wife, Carolyn, is consumed by materialism and an affair with a real estate rival, while their daughter, Jane, feels alienated and becomes emotionally involved with their enigmatic neighbor, Ricky Fitts. Ricky, an amateur filmmaker, lives with his repressive father, Colonel Fitts, whose strict demeanor conceals his own inner struggles.\n\nThrough a series of poignant and darkly comedic events, the film explores themes of beauty, freedom, and self-discovery. Lester's pursuit of happiness leads to unexpected consequences, culminating in an introspective reflection on fulfillment and the simplicity of life. \"American Beauty\" paints a profound portrait of the complexities of desire and the search for authenticity in the modern world."
    },
    {
        "id": 99,
        "Series_Title": "Good Will Hunting",
        "Released_Year": "1997",
        "Runtime": "126 min",
        "Genre": "Drama, Romance",
        "IMDB_Rating": "8.3",
        "Overview": "Will Hunting, a janitor at M.I.T., has a gift for mathematics, but needs help from a psychologist to find direction in his life.",
        "Director": "Gus Van Sant",
        "Star1": "Robin Williams",
        "Star2": "Matt Damon",
        "Star3": "Ben Affleck",
        "Star4": "Stellan Skarsgård",
        "Gross": "138,433,435",
        "Synopsis": "Will Hunting, a janitor at the Massachusetts Institute of Technology, is a self-taught genius with a photographic memory and an unparalleled talent for mathematics. Despite his gifts, Will leads a troubled life in South Boston, where he spends his time with friends, often getting into fights and run-ins with the law.\n\nWhen MIT Professor Gerald Lambeau challenges his students with a complex mathematics problem, Will solves it anonymously, stunning the academic community. Professor Lambeau is determined to find the mystery genius, eventually catching Will in the act as he solves another problem. However, Will's involvement in a violent street fight lands him in jail.\n\nProfessor Lambeau intercedes, arranging for Will's release under two conditions: he must study mathematics under Lambeau's guidance and attend therapy sessions. Will reluctantly agrees, initially displaying contempt towards his first few therapists. Eventually, Lambeau enlists the help of Sean Maguire, his former college roommate, who becomes Will's therapist.\n\nSean, a community college professor with his own personal struggles, begins to break through Will's defenses with his empathetic approach and willingness to confront Will's emotional trauma. Over time, Sean and Will form a deep and transformative bond, with Sean encouraging Will to confront his past and embrace his potential.\n\nMeanwhile, Will embarks on a new romantic relationship with Skylar, a Harvard student, but his fear of vulnerability and abandonment leads to tension between them. As Will navigates these complex personal relationships, he faces the pressure of choosing between lucrative job offers that capitalize on his mathematical brilliance and the opportunity for a different path.\n\nThrough his sessions with Sean, Will gradually learns to trust others and confront his deep-seated fears. In a pivotal moment, Sean helps Will realize that his abusive upbringing was not his fault, allowing Will to release much of his internalized pain.\n\nIn the end, Will decides to pursue a life outside of his comfort zone. He turns down prestigious job offers to follow Skylar to California, seeking a chance for genuine happiness and self-discovery. The film concludes with Will leaving Boston, driving towards an uncertain but hopeful future, symbolizing his journey towards healing and freedom."
    }
]